EfficientNetB6----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [2, 51, 264, 264]           1,377
       BatchNorm2d-2          [2, 51, 264, 264]             102
              SiLU-3          [2, 51, 264, 264]               0
          CNNBlock-4          [2, 51, 264, 264]               0
            Conv2d-5          [2, 51, 264, 264]             459
       BatchNorm2d-6          [2, 51, 264, 264]             102
              SiLU-7          [2, 51, 264, 264]               0
          CNNBlock-8          [2, 51, 264, 264]               0
 AdaptiveAvgPool2d-9              [2, 51, 1, 1]               0
           Conv2d-10              [2, 12, 1, 1]             624
             SiLU-11              [2, 12, 1, 1]               0
           Conv2d-12              [2, 51, 1, 1]             663
          Sigmoid-13              [2, 51, 1, 1]               0
SqueezeExcitation-14          [2, 51, 264, 264]               0
           Conv2d-15          [2, 28, 264, 264]           1,428
      BatchNorm2d-16          [2, 28, 264, 264]              56
InvertedResidualBlock-17          [2, 28, 264, 264]               0
           Conv2d-18          [2, 28, 264, 264]             252
      BatchNorm2d-19          [2, 28, 264, 264]              56
             SiLU-20          [2, 28, 264, 264]               0
         CNNBlock-21          [2, 28, 264, 264]               0
AdaptiveAvgPool2d-22              [2, 28, 1, 1]               0
           Conv2d-23               [2, 7, 1, 1]             203
             SiLU-24               [2, 7, 1, 1]               0
           Conv2d-25              [2, 28, 1, 1]             224
          Sigmoid-26              [2, 28, 1, 1]               0
SqueezeExcitation-27          [2, 28, 264, 264]               0
           Conv2d-28          [2, 28, 264, 264]             784
      BatchNorm2d-29          [2, 28, 264, 264]              56
InvertedResidualBlock-30          [2, 28, 264, 264]               0
           Conv2d-31          [2, 28, 264, 264]             252
      BatchNorm2d-32          [2, 28, 264, 264]              56
             SiLU-33          [2, 28, 264, 264]               0
         CNNBlock-34          [2, 28, 264, 264]               0
AdaptiveAvgPool2d-35              [2, 28, 1, 1]               0
           Conv2d-36               [2, 7, 1, 1]             203
             SiLU-37               [2, 7, 1, 1]               0
           Conv2d-38              [2, 28, 1, 1]             224
          Sigmoid-39              [2, 28, 1, 1]               0
SqueezeExcitation-40          [2, 28, 264, 264]               0
           Conv2d-41          [2, 28, 264, 264]             784
      BatchNorm2d-42          [2, 28, 264, 264]              56
InvertedResidualBlock-43          [2, 28, 264, 264]               0
           Conv2d-44         [2, 168, 264, 264]          42,336
      BatchNorm2d-45         [2, 168, 264, 264]             336
             SiLU-46         [2, 168, 264, 264]               0
         CNNBlock-47         [2, 168, 264, 264]               0
           Conv2d-48         [2, 168, 132, 132]           1,512
      BatchNorm2d-49         [2, 168, 132, 132]             336
             SiLU-50         [2, 168, 132, 132]               0
         CNNBlock-51         [2, 168, 132, 132]               0
AdaptiveAvgPool2d-52             [2, 168, 1, 1]               0
           Conv2d-53               [2, 7, 1, 1]           1,183
             SiLU-54               [2, 7, 1, 1]               0
           Conv2d-55             [2, 168, 1, 1]           1,344
          Sigmoid-56             [2, 168, 1, 1]               0
SqueezeExcitation-57         [2, 168, 132, 132]               0
           Conv2d-58          [2, 40, 132, 132]           6,720
      BatchNorm2d-59          [2, 40, 132, 132]              80
InvertedResidualBlock-60          [2, 40, 132, 132]               0
           Conv2d-61         [2, 240, 132, 132]          86,400
      BatchNorm2d-62         [2, 240, 132, 132]             480
             SiLU-63         [2, 240, 132, 132]               0
         CNNBlock-64         [2, 240, 132, 132]               0
           Conv2d-65         [2, 240, 132, 132]           2,160
      BatchNorm2d-66         [2, 240, 132, 132]             480
             SiLU-67         [2, 240, 132, 132]               0
         CNNBlock-68         [2, 240, 132, 132]               0
AdaptiveAvgPool2d-69             [2, 240, 1, 1]               0
           Conv2d-70              [2, 10, 1, 1]           2,410
             SiLU-71              [2, 10, 1, 1]               0
           Conv2d-72             [2, 240, 1, 1]           2,640
          Sigmoid-73             [2, 240, 1, 1]               0
SqueezeExcitation-74         [2, 240, 132, 132]               0
           Conv2d-75          [2, 40, 132, 132]           9,600
      BatchNorm2d-76          [2, 40, 132, 132]              80
InvertedResidualBlock-77          [2, 40, 132, 132]               0
           Conv2d-78         [2, 240, 132, 132]          86,400
      BatchNorm2d-79         [2, 240, 132, 132]             480
             SiLU-80         [2, 240, 132, 132]               0
         CNNBlock-81         [2, 240, 132, 132]               0
           Conv2d-82         [2, 240, 132, 132]           2,160
      BatchNorm2d-83         [2, 240, 132, 132]             480
             SiLU-84         [2, 240, 132, 132]               0
         CNNBlock-85         [2, 240, 132, 132]               0
AdaptiveAvgPool2d-86             [2, 240, 1, 1]               0
           Conv2d-87              [2, 10, 1, 1]           2,410
             SiLU-88              [2, 10, 1, 1]               0
           Conv2d-89             [2, 240, 1, 1]           2,640
          Sigmoid-90             [2, 240, 1, 1]               0
SqueezeExcitation-91         [2, 240, 132, 132]               0
           Conv2d-92          [2, 40, 132, 132]           9,600
      BatchNorm2d-93          [2, 40, 132, 132]              80
InvertedResidualBlock-94          [2, 40, 132, 132]               0
           Conv2d-95         [2, 240, 132, 132]          86,400
      BatchNorm2d-96         [2, 240, 132, 132]             480
             SiLU-97         [2, 240, 132, 132]               0
         CNNBlock-98         [2, 240, 132, 132]               0
           Conv2d-99         [2, 240, 132, 132]           2,160
     BatchNorm2d-100         [2, 240, 132, 132]             480
            SiLU-101         [2, 240, 132, 132]               0
        CNNBlock-102         [2, 240, 132, 132]               0
AdaptiveAvgPool2d-103             [2, 240, 1, 1]               0
          Conv2d-104              [2, 10, 1, 1]           2,410
            SiLU-105              [2, 10, 1, 1]               0
          Conv2d-106             [2, 240, 1, 1]           2,640
         Sigmoid-107             [2, 240, 1, 1]               0
SqueezeExcitation-108         [2, 240, 132, 132]               0
          Conv2d-109          [2, 40, 132, 132]           9,600
     BatchNorm2d-110          [2, 40, 132, 132]              80
InvertedResidualBlock-111          [2, 40, 132, 132]               0
          Conv2d-112         [2, 240, 132, 132]          86,400
     BatchNorm2d-113         [2, 240, 132, 132]             480
            SiLU-114         [2, 240, 132, 132]               0
        CNNBlock-115         [2, 240, 132, 132]               0
          Conv2d-116         [2, 240, 132, 132]           2,160
     BatchNorm2d-117         [2, 240, 132, 132]             480
            SiLU-118         [2, 240, 132, 132]               0
        CNNBlock-119         [2, 240, 132, 132]               0
AdaptiveAvgPool2d-120             [2, 240, 1, 1]               0
          Conv2d-121              [2, 10, 1, 1]           2,410
            SiLU-122              [2, 10, 1, 1]               0
          Conv2d-123             [2, 240, 1, 1]           2,640
         Sigmoid-124             [2, 240, 1, 1]               0
SqueezeExcitation-125         [2, 240, 132, 132]               0
          Conv2d-126          [2, 40, 132, 132]           9,600
     BatchNorm2d-127          [2, 40, 132, 132]              80
InvertedResidualBlock-128          [2, 40, 132, 132]               0
          Conv2d-129         [2, 240, 132, 132]          86,400
     BatchNorm2d-130         [2, 240, 132, 132]             480
            SiLU-131         [2, 240, 132, 132]               0
        CNNBlock-132         [2, 240, 132, 132]               0
          Conv2d-133           [2, 240, 66, 66]           6,000
     BatchNorm2d-134           [2, 240, 66, 66]             480
            SiLU-135           [2, 240, 66, 66]               0
        CNNBlock-136           [2, 240, 66, 66]               0
AdaptiveAvgPool2d-137             [2, 240, 1, 1]               0
          Conv2d-138              [2, 10, 1, 1]           2,410
            SiLU-139              [2, 10, 1, 1]               0
          Conv2d-140             [2, 240, 1, 1]           2,640
         Sigmoid-141             [2, 240, 1, 1]               0
SqueezeExcitation-142           [2, 240, 66, 66]               0
          Conv2d-143            [2, 64, 66, 66]          15,360
     BatchNorm2d-144            [2, 64, 66, 66]             128
InvertedResidualBlock-145            [2, 64, 66, 66]               0
          Conv2d-146           [2, 384, 66, 66]         221,184
     BatchNorm2d-147           [2, 384, 66, 66]             768
            SiLU-148           [2, 384, 66, 66]               0
        CNNBlock-149           [2, 384, 66, 66]               0
          Conv2d-150           [2, 384, 66, 66]           9,600
     BatchNorm2d-151           [2, 384, 66, 66]             768
            SiLU-152           [2, 384, 66, 66]               0
        CNNBlock-153           [2, 384, 66, 66]               0
AdaptiveAvgPool2d-154             [2, 384, 1, 1]               0
          Conv2d-155              [2, 16, 1, 1]           6,160
            SiLU-156              [2, 16, 1, 1]               0
          Conv2d-157             [2, 384, 1, 1]           6,528
         Sigmoid-158             [2, 384, 1, 1]               0
SqueezeExcitation-159           [2, 384, 66, 66]               0
          Conv2d-160            [2, 64, 66, 66]          24,576
     BatchNorm2d-161            [2, 64, 66, 66]             128
InvertedResidualBlock-162            [2, 64, 66, 66]               0
          Conv2d-163           [2, 384, 66, 66]         221,184
     BatchNorm2d-164           [2, 384, 66, 66]             768
            SiLU-165           [2, 384, 66, 66]               0
        CNNBlock-166           [2, 384, 66, 66]               0
          Conv2d-167           [2, 384, 66, 66]           9,600
     BatchNorm2d-168           [2, 384, 66, 66]             768
            SiLU-169           [2, 384, 66, 66]               0
        CNNBlock-170           [2, 384, 66, 66]               0
AdaptiveAvgPool2d-171             [2, 384, 1, 1]               0
          Conv2d-172              [2, 16, 1, 1]           6,160
            SiLU-173              [2, 16, 1, 1]               0
          Conv2d-174             [2, 384, 1, 1]           6,528
         Sigmoid-175             [2, 384, 1, 1]               0
SqueezeExcitation-176           [2, 384, 66, 66]               0
          Conv2d-177            [2, 64, 66, 66]          24,576
     BatchNorm2d-178            [2, 64, 66, 66]             128
InvertedResidualBlock-179            [2, 64, 66, 66]               0
          Conv2d-180           [2, 384, 66, 66]         221,184
     BatchNorm2d-181           [2, 384, 66, 66]             768
            SiLU-182           [2, 384, 66, 66]               0
        CNNBlock-183           [2, 384, 66, 66]               0
          Conv2d-184           [2, 384, 66, 66]           9,600
     BatchNorm2d-185           [2, 384, 66, 66]             768
            SiLU-186           [2, 384, 66, 66]               0
        CNNBlock-187           [2, 384, 66, 66]               0
AdaptiveAvgPool2d-188             [2, 384, 1, 1]               0
          Conv2d-189              [2, 16, 1, 1]           6,160
            SiLU-190              [2, 16, 1, 1]               0
          Conv2d-191             [2, 384, 1, 1]           6,528
         Sigmoid-192             [2, 384, 1, 1]               0
SqueezeExcitation-193           [2, 384, 66, 66]               0
          Conv2d-194            [2, 64, 66, 66]          24,576
     BatchNorm2d-195            [2, 64, 66, 66]             128
InvertedResidualBlock-196            [2, 64, 66, 66]               0
          Conv2d-197           [2, 384, 66, 66]         221,184
     BatchNorm2d-198           [2, 384, 66, 66]             768
            SiLU-199           [2, 384, 66, 66]               0
        CNNBlock-200           [2, 384, 66, 66]               0
          Conv2d-201           [2, 384, 66, 66]           9,600
     BatchNorm2d-202           [2, 384, 66, 66]             768
            SiLU-203           [2, 384, 66, 66]               0
        CNNBlock-204           [2, 384, 66, 66]               0
AdaptiveAvgPool2d-205             [2, 384, 1, 1]               0
          Conv2d-206              [2, 16, 1, 1]           6,160
            SiLU-207              [2, 16, 1, 1]               0
          Conv2d-208             [2, 384, 1, 1]           6,528
         Sigmoid-209             [2, 384, 1, 1]               0
SqueezeExcitation-210           [2, 384, 66, 66]               0
          Conv2d-211            [2, 64, 66, 66]          24,576
     BatchNorm2d-212            [2, 64, 66, 66]             128
InvertedResidualBlock-213            [2, 64, 66, 66]               0
          Conv2d-214           [2, 384, 66, 66]         221,184
     BatchNorm2d-215           [2, 384, 66, 66]             768
            SiLU-216           [2, 384, 66, 66]               0
        CNNBlock-217           [2, 384, 66, 66]               0
          Conv2d-218           [2, 384, 33, 33]           3,456
     BatchNorm2d-219           [2, 384, 33, 33]             768
            SiLU-220           [2, 384, 33, 33]               0
        CNNBlock-221           [2, 384, 33, 33]               0
AdaptiveAvgPool2d-222             [2, 384, 1, 1]               0
          Conv2d-223              [2, 16, 1, 1]           6,160
            SiLU-224              [2, 16, 1, 1]               0
          Conv2d-225             [2, 384, 1, 1]           6,528
         Sigmoid-226             [2, 384, 1, 1]               0
SqueezeExcitation-227           [2, 384, 33, 33]               0
          Conv2d-228           [2, 128, 33, 33]          49,152
     BatchNorm2d-229           [2, 128, 33, 33]             256
InvertedResidualBlock-230           [2, 128, 33, 33]               0
          Conv2d-231           [2, 768, 33, 33]         884,736
     BatchNorm2d-232           [2, 768, 33, 33]           1,536
            SiLU-233           [2, 768, 33, 33]               0
        CNNBlock-234           [2, 768, 33, 33]               0
          Conv2d-235           [2, 768, 33, 33]           6,912
     BatchNorm2d-236           [2, 768, 33, 33]           1,536
            SiLU-237           [2, 768, 33, 33]               0
        CNNBlock-238           [2, 768, 33, 33]               0
AdaptiveAvgPool2d-239             [2, 768, 1, 1]               0
          Conv2d-240              [2, 32, 1, 1]          24,608
            SiLU-241              [2, 32, 1, 1]               0
          Conv2d-242             [2, 768, 1, 1]          25,344
         Sigmoid-243             [2, 768, 1, 1]               0
SqueezeExcitation-244           [2, 768, 33, 33]               0
          Conv2d-245           [2, 128, 33, 33]          98,304
     BatchNorm2d-246           [2, 128, 33, 33]             256
InvertedResidualBlock-247           [2, 128, 33, 33]               0
          Conv2d-248           [2, 768, 33, 33]         884,736
     BatchNorm2d-249           [2, 768, 33, 33]           1,536
            SiLU-250           [2, 768, 33, 33]               0
        CNNBlock-251           [2, 768, 33, 33]               0
          Conv2d-252           [2, 768, 33, 33]           6,912
     BatchNorm2d-253           [2, 768, 33, 33]           1,536
            SiLU-254           [2, 768, 33, 33]               0
        CNNBlock-255           [2, 768, 33, 33]               0
AdaptiveAvgPool2d-256             [2, 768, 1, 1]               0
          Conv2d-257              [2, 32, 1, 1]          24,608
            SiLU-258              [2, 32, 1, 1]               0
          Conv2d-259             [2, 768, 1, 1]          25,344
         Sigmoid-260             [2, 768, 1, 1]               0
SqueezeExcitation-261           [2, 768, 33, 33]               0
          Conv2d-262           [2, 128, 33, 33]          98,304
     BatchNorm2d-263           [2, 128, 33, 33]             256
InvertedResidualBlock-264           [2, 128, 33, 33]               0
          Conv2d-265           [2, 768, 33, 33]         884,736
     BatchNorm2d-266           [2, 768, 33, 33]           1,536
            SiLU-267           [2, 768, 33, 33]               0
        CNNBlock-268           [2, 768, 33, 33]               0
          Conv2d-269           [2, 768, 33, 33]           6,912
     BatchNorm2d-270           [2, 768, 33, 33]           1,536
            SiLU-271           [2, 768, 33, 33]               0
        CNNBlock-272           [2, 768, 33, 33]               0
AdaptiveAvgPool2d-273             [2, 768, 1, 1]               0
          Conv2d-274              [2, 32, 1, 1]          24,608
            SiLU-275              [2, 32, 1, 1]               0
          Conv2d-276             [2, 768, 1, 1]          25,344
         Sigmoid-277             [2, 768, 1, 1]               0
SqueezeExcitation-278           [2, 768, 33, 33]               0
          Conv2d-279           [2, 128, 33, 33]          98,304
     BatchNorm2d-280           [2, 128, 33, 33]             256
InvertedResidualBlock-281           [2, 128, 33, 33]               0
          Conv2d-282           [2, 768, 33, 33]         884,736
     BatchNorm2d-283           [2, 768, 33, 33]           1,536
            SiLU-284           [2, 768, 33, 33]               0
        CNNBlock-285           [2, 768, 33, 33]               0
          Conv2d-286           [2, 768, 33, 33]           6,912
     BatchNorm2d-287           [2, 768, 33, 33]           1,536
            SiLU-288           [2, 768, 33, 33]               0
        CNNBlock-289           [2, 768, 33, 33]               0
AdaptiveAvgPool2d-290             [2, 768, 1, 1]               0
          Conv2d-291              [2, 32, 1, 1]          24,608
            SiLU-292              [2, 32, 1, 1]               0
          Conv2d-293             [2, 768, 1, 1]          25,344
         Sigmoid-294             [2, 768, 1, 1]               0
SqueezeExcitation-295           [2, 768, 33, 33]               0
          Conv2d-296           [2, 128, 33, 33]          98,304
     BatchNorm2d-297           [2, 128, 33, 33]             256
InvertedResidualBlock-298           [2, 128, 33, 33]               0
          Conv2d-299           [2, 768, 33, 33]         884,736
     BatchNorm2d-300           [2, 768, 33, 33]           1,536
            SiLU-301           [2, 768, 33, 33]               0
        CNNBlock-302           [2, 768, 33, 33]               0
          Conv2d-303           [2, 768, 33, 33]           6,912
     BatchNorm2d-304           [2, 768, 33, 33]           1,536
            SiLU-305           [2, 768, 33, 33]               0
        CNNBlock-306           [2, 768, 33, 33]               0
AdaptiveAvgPool2d-307             [2, 768, 1, 1]               0
          Conv2d-308              [2, 32, 1, 1]          24,608
            SiLU-309              [2, 32, 1, 1]               0
          Conv2d-310             [2, 768, 1, 1]          25,344
         Sigmoid-311             [2, 768, 1, 1]               0
SqueezeExcitation-312           [2, 768, 33, 33]               0
          Conv2d-313           [2, 128, 33, 33]          98,304
     BatchNorm2d-314           [2, 128, 33, 33]             256
InvertedResidualBlock-315           [2, 128, 33, 33]               0
          Conv2d-316           [2, 768, 33, 33]         884,736
     BatchNorm2d-317           [2, 768, 33, 33]           1,536
            SiLU-318           [2, 768, 33, 33]               0
        CNNBlock-319           [2, 768, 33, 33]               0
          Conv2d-320           [2, 768, 33, 33]           6,912
     BatchNorm2d-321           [2, 768, 33, 33]           1,536
            SiLU-322           [2, 768, 33, 33]               0
        CNNBlock-323           [2, 768, 33, 33]               0
AdaptiveAvgPool2d-324             [2, 768, 1, 1]               0
          Conv2d-325              [2, 32, 1, 1]          24,608
            SiLU-326              [2, 32, 1, 1]               0
          Conv2d-327             [2, 768, 1, 1]          25,344
         Sigmoid-328             [2, 768, 1, 1]               0
SqueezeExcitation-329           [2, 768, 33, 33]               0
          Conv2d-330           [2, 128, 33, 33]          98,304
     BatchNorm2d-331           [2, 128, 33, 33]             256
InvertedResidualBlock-332           [2, 128, 33, 33]               0
          Conv2d-333           [2, 768, 33, 33]         884,736
     BatchNorm2d-334           [2, 768, 33, 33]           1,536
            SiLU-335           [2, 768, 33, 33]               0
        CNNBlock-336           [2, 768, 33, 33]               0
          Conv2d-337           [2, 768, 33, 33]           6,912
     BatchNorm2d-338           [2, 768, 33, 33]           1,536
            SiLU-339           [2, 768, 33, 33]               0
        CNNBlock-340           [2, 768, 33, 33]               0
AdaptiveAvgPool2d-341             [2, 768, 1, 1]               0
          Conv2d-342              [2, 32, 1, 1]          24,608
            SiLU-343              [2, 32, 1, 1]               0
          Conv2d-344             [2, 768, 1, 1]          25,344
         Sigmoid-345             [2, 768, 1, 1]               0
SqueezeExcitation-346           [2, 768, 33, 33]               0
          Conv2d-347           [2, 128, 33, 33]          98,304
     BatchNorm2d-348           [2, 128, 33, 33]             256
InvertedResidualBlock-349           [2, 128, 33, 33]               0
          Conv2d-350           [2, 768, 33, 33]         884,736
     BatchNorm2d-351           [2, 768, 33, 33]           1,536
            SiLU-352           [2, 768, 33, 33]               0
        CNNBlock-353           [2, 768, 33, 33]               0
          Conv2d-354           [2, 768, 33, 33]          19,200
     BatchNorm2d-355           [2, 768, 33, 33]           1,536
            SiLU-356           [2, 768, 33, 33]               0
        CNNBlock-357           [2, 768, 33, 33]               0
AdaptiveAvgPool2d-358             [2, 768, 1, 1]               0
          Conv2d-359              [2, 32, 1, 1]          24,608
            SiLU-360              [2, 32, 1, 1]               0
          Conv2d-361             [2, 768, 1, 1]          25,344
         Sigmoid-362             [2, 768, 1, 1]               0
SqueezeExcitation-363           [2, 768, 33, 33]               0
          Conv2d-364           [2, 180, 33, 33]         138,240
     BatchNorm2d-365           [2, 180, 33, 33]             360
InvertedResidualBlock-366           [2, 180, 33, 33]               0
          Conv2d-367          [2, 1080, 33, 33]       1,749,600
     BatchNorm2d-368          [2, 1080, 33, 33]           2,160
            SiLU-369          [2, 1080, 33, 33]               0
        CNNBlock-370          [2, 1080, 33, 33]               0
          Conv2d-371          [2, 1080, 33, 33]          27,000
     BatchNorm2d-372          [2, 1080, 33, 33]           2,160
            SiLU-373          [2, 1080, 33, 33]               0
        CNNBlock-374          [2, 1080, 33, 33]               0
AdaptiveAvgPool2d-375            [2, 1080, 1, 1]               0
          Conv2d-376              [2, 45, 1, 1]          48,645
            SiLU-377              [2, 45, 1, 1]               0
          Conv2d-378            [2, 1080, 1, 1]          49,680
         Sigmoid-379            [2, 1080, 1, 1]               0
SqueezeExcitation-380          [2, 1080, 33, 33]               0
          Conv2d-381           [2, 180, 33, 33]         194,400
     BatchNorm2d-382           [2, 180, 33, 33]             360
InvertedResidualBlock-383           [2, 180, 33, 33]               0
          Conv2d-384          [2, 1080, 33, 33]       1,749,600
     BatchNorm2d-385          [2, 1080, 33, 33]           2,160
            SiLU-386          [2, 1080, 33, 33]               0
        CNNBlock-387          [2, 1080, 33, 33]               0
          Conv2d-388          [2, 1080, 33, 33]          27,000
     BatchNorm2d-389          [2, 1080, 33, 33]           2,160
            SiLU-390          [2, 1080, 33, 33]               0
        CNNBlock-391          [2, 1080, 33, 33]               0
AdaptiveAvgPool2d-392            [2, 1080, 1, 1]               0
          Conv2d-393              [2, 45, 1, 1]          48,645
            SiLU-394              [2, 45, 1, 1]               0
          Conv2d-395            [2, 1080, 1, 1]          49,680
         Sigmoid-396            [2, 1080, 1, 1]               0
SqueezeExcitation-397          [2, 1080, 33, 33]               0
          Conv2d-398           [2, 180, 33, 33]         194,400
     BatchNorm2d-399           [2, 180, 33, 33]             360
InvertedResidualBlock-400           [2, 180, 33, 33]               0
          Conv2d-401          [2, 1080, 33, 33]       1,749,600
     BatchNorm2d-402          [2, 1080, 33, 33]           2,160
            SiLU-403          [2, 1080, 33, 33]               0
        CNNBlock-404          [2, 1080, 33, 33]               0
          Conv2d-405          [2, 1080, 33, 33]          27,000
     BatchNorm2d-406          [2, 1080, 33, 33]           2,160
            SiLU-407          [2, 1080, 33, 33]               0
        CNNBlock-408          [2, 1080, 33, 33]               0
AdaptiveAvgPool2d-409            [2, 1080, 1, 1]               0
          Conv2d-410              [2, 45, 1, 1]          48,645
            SiLU-411              [2, 45, 1, 1]               0
          Conv2d-412            [2, 1080, 1, 1]          49,680
         Sigmoid-413            [2, 1080, 1, 1]               0
SqueezeExcitation-414          [2, 1080, 33, 33]               0
          Conv2d-415           [2, 180, 33, 33]         194,400
     BatchNorm2d-416           [2, 180, 33, 33]             360
InvertedResidualBlock-417           [2, 180, 33, 33]               0
          Conv2d-418          [2, 1080, 33, 33]       1,749,600
     BatchNorm2d-419          [2, 1080, 33, 33]           2,160
            SiLU-420          [2, 1080, 33, 33]               0
        CNNBlock-421          [2, 1080, 33, 33]               0
          Conv2d-422          [2, 1080, 33, 33]          27,000
     BatchNorm2d-423          [2, 1080, 33, 33]           2,160
            SiLU-424          [2, 1080, 33, 33]               0
        CNNBlock-425          [2, 1080, 33, 33]               0
AdaptiveAvgPool2d-426            [2, 1080, 1, 1]               0
          Conv2d-427              [2, 45, 1, 1]          48,645
            SiLU-428              [2, 45, 1, 1]               0
          Conv2d-429            [2, 1080, 1, 1]          49,680
         Sigmoid-430            [2, 1080, 1, 1]               0
SqueezeExcitation-431          [2, 1080, 33, 33]               0
          Conv2d-432           [2, 180, 33, 33]         194,400
     BatchNorm2d-433           [2, 180, 33, 33]             360
InvertedResidualBlock-434           [2, 180, 33, 33]               0
          Conv2d-435          [2, 1080, 33, 33]       1,749,600
     BatchNorm2d-436          [2, 1080, 33, 33]           2,160
            SiLU-437          [2, 1080, 33, 33]               0
        CNNBlock-438          [2, 1080, 33, 33]               0
          Conv2d-439          [2, 1080, 33, 33]          27,000
     BatchNorm2d-440          [2, 1080, 33, 33]           2,160
            SiLU-441          [2, 1080, 33, 33]               0
        CNNBlock-442          [2, 1080, 33, 33]               0
AdaptiveAvgPool2d-443            [2, 1080, 1, 1]               0
          Conv2d-444              [2, 45, 1, 1]          48,645
            SiLU-445              [2, 45, 1, 1]               0
          Conv2d-446            [2, 1080, 1, 1]          49,680
         Sigmoid-447            [2, 1080, 1, 1]               0
SqueezeExcitation-448          [2, 1080, 33, 33]               0
          Conv2d-449           [2, 180, 33, 33]         194,400
     BatchNorm2d-450           [2, 180, 33, 33]             360
InvertedResidualBlock-451           [2, 180, 33, 33]               0
          Conv2d-452          [2, 1080, 33, 33]       1,749,600
     BatchNorm2d-453          [2, 1080, 33, 33]           2,160
            SiLU-454          [2, 1080, 33, 33]               0
        CNNBlock-455          [2, 1080, 33, 33]               0
          Conv2d-456          [2, 1080, 33, 33]          27,000
     BatchNorm2d-457          [2, 1080, 33, 33]           2,160
            SiLU-458          [2, 1080, 33, 33]               0
        CNNBlock-459          [2, 1080, 33, 33]               0
AdaptiveAvgPool2d-460            [2, 1080, 1, 1]               0
          Conv2d-461              [2, 45, 1, 1]          48,645
            SiLU-462              [2, 45, 1, 1]               0
          Conv2d-463            [2, 1080, 1, 1]          49,680
         Sigmoid-464            [2, 1080, 1, 1]               0
SqueezeExcitation-465          [2, 1080, 33, 33]               0
          Conv2d-466           [2, 180, 33, 33]         194,400
     BatchNorm2d-467           [2, 180, 33, 33]             360
InvertedResidualBlock-468           [2, 180, 33, 33]               0
          Conv2d-469          [2, 1080, 33, 33]       1,749,600
     BatchNorm2d-470          [2, 1080, 33, 33]           2,160
            SiLU-471          [2, 1080, 33, 33]               0
        CNNBlock-472          [2, 1080, 33, 33]               0
          Conv2d-473          [2, 1080, 33, 33]          27,000
     BatchNorm2d-474          [2, 1080, 33, 33]           2,160
            SiLU-475          [2, 1080, 33, 33]               0
        CNNBlock-476          [2, 1080, 33, 33]               0
AdaptiveAvgPool2d-477            [2, 1080, 1, 1]               0
          Conv2d-478              [2, 45, 1, 1]          48,645
            SiLU-479              [2, 45, 1, 1]               0
          Conv2d-480            [2, 1080, 1, 1]          49,680
         Sigmoid-481            [2, 1080, 1, 1]               0
SqueezeExcitation-482          [2, 1080, 33, 33]               0
          Conv2d-483           [2, 180, 33, 33]         194,400
     BatchNorm2d-484           [2, 180, 33, 33]             360
InvertedResidualBlock-485           [2, 180, 33, 33]               0
          Conv2d-486          [2, 1080, 33, 33]       1,749,600
     BatchNorm2d-487          [2, 1080, 33, 33]           2,160
            SiLU-488          [2, 1080, 33, 33]               0
        CNNBlock-489          [2, 1080, 33, 33]               0
          Conv2d-490          [2, 1080, 17, 17]          27,000
     BatchNorm2d-491          [2, 1080, 17, 17]           2,160
            SiLU-492          [2, 1080, 17, 17]               0
        CNNBlock-493          [2, 1080, 17, 17]               0
AdaptiveAvgPool2d-494            [2, 1080, 1, 1]               0
          Conv2d-495              [2, 45, 1, 1]          48,645
            SiLU-496              [2, 45, 1, 1]               0
          Conv2d-497            [2, 1080, 1, 1]          49,680
         Sigmoid-498            [2, 1080, 1, 1]               0
SqueezeExcitation-499          [2, 1080, 17, 17]               0
          Conv2d-500           [2, 312, 17, 17]         336,960
     BatchNorm2d-501           [2, 312, 17, 17]             624
InvertedResidualBlock-502           [2, 312, 17, 17]               0
          Conv2d-503          [2, 1872, 17, 17]       5,256,576
     BatchNorm2d-504          [2, 1872, 17, 17]           3,744
            SiLU-505          [2, 1872, 17, 17]               0
        CNNBlock-506          [2, 1872, 17, 17]               0
          Conv2d-507          [2, 1872, 17, 17]          46,800
     BatchNorm2d-508          [2, 1872, 17, 17]           3,744
            SiLU-509          [2, 1872, 17, 17]               0
        CNNBlock-510          [2, 1872, 17, 17]               0
AdaptiveAvgPool2d-511            [2, 1872, 1, 1]               0
          Conv2d-512              [2, 78, 1, 1]         146,094
            SiLU-513              [2, 78, 1, 1]               0
          Conv2d-514            [2, 1872, 1, 1]         147,888
         Sigmoid-515            [2, 1872, 1, 1]               0
SqueezeExcitation-516          [2, 1872, 17, 17]               0
          Conv2d-517           [2, 312, 17, 17]         584,064
     BatchNorm2d-518           [2, 312, 17, 17]             624
InvertedResidualBlock-519           [2, 312, 17, 17]               0
          Conv2d-520          [2, 1872, 17, 17]       5,256,576
     BatchNorm2d-521          [2, 1872, 17, 17]           3,744
            SiLU-522          [2, 1872, 17, 17]               0
        CNNBlock-523          [2, 1872, 17, 17]               0
          Conv2d-524          [2, 1872, 17, 17]          46,800
     BatchNorm2d-525          [2, 1872, 17, 17]           3,744
            SiLU-526          [2, 1872, 17, 17]               0
        CNNBlock-527          [2, 1872, 17, 17]               0
AdaptiveAvgPool2d-528            [2, 1872, 1, 1]               0
          Conv2d-529              [2, 78, 1, 1]         146,094
            SiLU-530              [2, 78, 1, 1]               0
          Conv2d-531            [2, 1872, 1, 1]         147,888
         Sigmoid-532            [2, 1872, 1, 1]               0
SqueezeExcitation-533          [2, 1872, 17, 17]               0
          Conv2d-534           [2, 312, 17, 17]         584,064
     BatchNorm2d-535           [2, 312, 17, 17]             624
InvertedResidualBlock-536           [2, 312, 17, 17]               0
          Conv2d-537          [2, 1872, 17, 17]       5,256,576
     BatchNorm2d-538          [2, 1872, 17, 17]           3,744
            SiLU-539          [2, 1872, 17, 17]               0
        CNNBlock-540          [2, 1872, 17, 17]               0
          Conv2d-541          [2, 1872, 17, 17]          46,800
     BatchNorm2d-542          [2, 1872, 17, 17]           3,744
            SiLU-543          [2, 1872, 17, 17]               0
        CNNBlock-544          [2, 1872, 17, 17]               0
AdaptiveAvgPool2d-545            [2, 1872, 1, 1]               0
          Conv2d-546              [2, 78, 1, 1]         146,094
            SiLU-547              [2, 78, 1, 1]               0
          Conv2d-548            [2, 1872, 1, 1]         147,888
         Sigmoid-549            [2, 1872, 1, 1]               0
SqueezeExcitation-550          [2, 1872, 17, 17]               0
          Conv2d-551           [2, 312, 17, 17]         584,064
     BatchNorm2d-552           [2, 312, 17, 17]             624
InvertedResidualBlock-553           [2, 312, 17, 17]               0
          Conv2d-554          [2, 1872, 17, 17]       5,256,576
     BatchNorm2d-555          [2, 1872, 17, 17]           3,744
            SiLU-556          [2, 1872, 17, 17]               0
        CNNBlock-557          [2, 1872, 17, 17]               0
          Conv2d-558          [2, 1872, 17, 17]          46,800
     BatchNorm2d-559          [2, 1872, 17, 17]           3,744
            SiLU-560          [2, 1872, 17, 17]               0
        CNNBlock-561          [2, 1872, 17, 17]               0
AdaptiveAvgPool2d-562            [2, 1872, 1, 1]               0
          Conv2d-563              [2, 78, 1, 1]         146,094
            SiLU-564              [2, 78, 1, 1]               0
          Conv2d-565            [2, 1872, 1, 1]         147,888
         Sigmoid-566            [2, 1872, 1, 1]               0
SqueezeExcitation-567          [2, 1872, 17, 17]               0
          Conv2d-568           [2, 312, 17, 17]         584,064
     BatchNorm2d-569           [2, 312, 17, 17]             624
InvertedResidualBlock-570           [2, 312, 17, 17]               0
          Conv2d-571          [2, 1872, 17, 17]       5,256,576
     BatchNorm2d-572          [2, 1872, 17, 17]           3,744
            SiLU-573          [2, 1872, 17, 17]               0
        CNNBlock-574          [2, 1872, 17, 17]               0
          Conv2d-575          [2, 1872, 17, 17]          46,800
     BatchNorm2d-576          [2, 1872, 17, 17]           3,744
            SiLU-577          [2, 1872, 17, 17]               0
        CNNBlock-578          [2, 1872, 17, 17]               0
AdaptiveAvgPool2d-579            [2, 1872, 1, 1]               0
          Conv2d-580              [2, 78, 1, 1]         146,094
            SiLU-581              [2, 78, 1, 1]               0
          Conv2d-582            [2, 1872, 1, 1]         147,888
         Sigmoid-583            [2, 1872, 1, 1]               0
SqueezeExcitation-584          [2, 1872, 17, 17]               0
          Conv2d-585           [2, 312, 17, 17]         584,064
     BatchNorm2d-586           [2, 312, 17, 17]             624
InvertedResidualBlock-587           [2, 312, 17, 17]               0
          Conv2d-588          [2, 1872, 17, 17]       5,256,576
     BatchNorm2d-589          [2, 1872, 17, 17]           3,744
            SiLU-590          [2, 1872, 17, 17]               0
        CNNBlock-591          [2, 1872, 17, 17]               0
          Conv2d-592          [2, 1872, 17, 17]          46,800
     BatchNorm2d-593          [2, 1872, 17, 17]           3,744
            SiLU-594          [2, 1872, 17, 17]               0
        CNNBlock-595          [2, 1872, 17, 17]               0
AdaptiveAvgPool2d-596            [2, 1872, 1, 1]               0
          Conv2d-597              [2, 78, 1, 1]         146,094
            SiLU-598              [2, 78, 1, 1]               0
          Conv2d-599            [2, 1872, 1, 1]         147,888
         Sigmoid-600            [2, 1872, 1, 1]               0
SqueezeExcitation-601          [2, 1872, 17, 17]               0
          Conv2d-602           [2, 312, 17, 17]         584,064
     BatchNorm2d-603           [2, 312, 17, 17]             624
InvertedResidualBlock-604           [2, 312, 17, 17]               0
          Conv2d-605          [2, 1872, 17, 17]       5,256,576
     BatchNorm2d-606          [2, 1872, 17, 17]           3,744
            SiLU-607          [2, 1872, 17, 17]               0
        CNNBlock-608          [2, 1872, 17, 17]               0
          Conv2d-609          [2, 1872, 17, 17]          46,800
     BatchNorm2d-610          [2, 1872, 17, 17]           3,744
            SiLU-611          [2, 1872, 17, 17]               0
        CNNBlock-612          [2, 1872, 17, 17]               0
AdaptiveAvgPool2d-613            [2, 1872, 1, 1]               0
          Conv2d-614              [2, 78, 1, 1]         146,094
            SiLU-615              [2, 78, 1, 1]               0
          Conv2d-616            [2, 1872, 1, 1]         147,888
         Sigmoid-617            [2, 1872, 1, 1]               0
SqueezeExcitation-618          [2, 1872, 17, 17]               0
          Conv2d-619           [2, 312, 17, 17]         584,064
     BatchNorm2d-620           [2, 312, 17, 17]             624
InvertedResidualBlock-621           [2, 312, 17, 17]               0
          Conv2d-622          [2, 1872, 17, 17]       5,256,576
     BatchNorm2d-623          [2, 1872, 17, 17]           3,744
            SiLU-624          [2, 1872, 17, 17]               0
        CNNBlock-625          [2, 1872, 17, 17]               0
          Conv2d-626          [2, 1872, 17, 17]          46,800
     BatchNorm2d-627          [2, 1872, 17, 17]           3,744
            SiLU-628          [2, 1872, 17, 17]               0
        CNNBlock-629          [2, 1872, 17, 17]               0
AdaptiveAvgPool2d-630            [2, 1872, 1, 1]               0
          Conv2d-631              [2, 78, 1, 1]         146,094
            SiLU-632              [2, 78, 1, 1]               0
          Conv2d-633            [2, 1872, 1, 1]         147,888
         Sigmoid-634            [2, 1872, 1, 1]               0
SqueezeExcitation-635          [2, 1872, 17, 17]               0
          Conv2d-636           [2, 312, 17, 17]         584,064
     BatchNorm2d-637           [2, 312, 17, 17]             624
InvertedResidualBlock-638           [2, 312, 17, 17]               0
          Conv2d-639          [2, 1872, 17, 17]       5,256,576
     BatchNorm2d-640          [2, 1872, 17, 17]           3,744
            SiLU-641          [2, 1872, 17, 17]               0
        CNNBlock-642          [2, 1872, 17, 17]               0
          Conv2d-643          [2, 1872, 17, 17]          46,800
     BatchNorm2d-644          [2, 1872, 17, 17]           3,744
            SiLU-645          [2, 1872, 17, 17]               0
        CNNBlock-646          [2, 1872, 17, 17]               0
AdaptiveAvgPool2d-647            [2, 1872, 1, 1]               0
          Conv2d-648              [2, 78, 1, 1]         146,094
            SiLU-649              [2, 78, 1, 1]               0
          Conv2d-650            [2, 1872, 1, 1]         147,888
         Sigmoid-651            [2, 1872, 1, 1]               0
SqueezeExcitation-652          [2, 1872, 17, 17]               0
          Conv2d-653           [2, 312, 17, 17]         584,064
     BatchNorm2d-654           [2, 312, 17, 17]             624
InvertedResidualBlock-655           [2, 312, 17, 17]               0
          Conv2d-656          [2, 1872, 17, 17]       5,256,576
     BatchNorm2d-657          [2, 1872, 17, 17]           3,744
            SiLU-658          [2, 1872, 17, 17]               0
        CNNBlock-659          [2, 1872, 17, 17]               0
          Conv2d-660          [2, 1872, 17, 17]          16,848
     BatchNorm2d-661          [2, 1872, 17, 17]           3,744
            SiLU-662          [2, 1872, 17, 17]               0
        CNNBlock-663          [2, 1872, 17, 17]               0
AdaptiveAvgPool2d-664            [2, 1872, 1, 1]               0
          Conv2d-665              [2, 78, 1, 1]         146,094
            SiLU-666              [2, 78, 1, 1]               0
          Conv2d-667            [2, 1872, 1, 1]         147,888
         Sigmoid-668            [2, 1872, 1, 1]               0
SqueezeExcitation-669          [2, 1872, 17, 17]               0
          Conv2d-670           [2, 516, 17, 17]         965,952
     BatchNorm2d-671           [2, 516, 17, 17]           1,032
InvertedResidualBlock-672           [2, 516, 17, 17]               0
          Conv2d-673          [2, 3096, 17, 17]      14,377,824
     BatchNorm2d-674          [2, 3096, 17, 17]           6,192
            SiLU-675          [2, 3096, 17, 17]               0
        CNNBlock-676          [2, 3096, 17, 17]               0
          Conv2d-677          [2, 3096, 17, 17]          27,864
     BatchNorm2d-678          [2, 3096, 17, 17]           6,192
            SiLU-679          [2, 3096, 17, 17]               0
        CNNBlock-680          [2, 3096, 17, 17]               0
AdaptiveAvgPool2d-681            [2, 3096, 1, 1]               0
          Conv2d-682             [2, 129, 1, 1]         399,513
            SiLU-683             [2, 129, 1, 1]               0
          Conv2d-684            [2, 3096, 1, 1]         402,480
         Sigmoid-685            [2, 3096, 1, 1]               0
SqueezeExcitation-686          [2, 3096, 17, 17]               0
          Conv2d-687           [2, 516, 17, 17]       1,597,536
     BatchNorm2d-688           [2, 516, 17, 17]           1,032
InvertedResidualBlock-689           [2, 516, 17, 17]               0
          Conv2d-690          [2, 3096, 17, 17]      14,377,824
     BatchNorm2d-691          [2, 3096, 17, 17]           6,192
            SiLU-692          [2, 3096, 17, 17]               0
        CNNBlock-693          [2, 3096, 17, 17]               0
          Conv2d-694          [2, 3096, 17, 17]          27,864
     BatchNorm2d-695          [2, 3096, 17, 17]           6,192
            SiLU-696          [2, 3096, 17, 17]               0
        CNNBlock-697          [2, 3096, 17, 17]               0
AdaptiveAvgPool2d-698            [2, 3096, 1, 1]               0
          Conv2d-699             [2, 129, 1, 1]         399,513
            SiLU-700             [2, 129, 1, 1]               0
          Conv2d-701            [2, 3096, 1, 1]         402,480
         Sigmoid-702            [2, 3096, 1, 1]               0
SqueezeExcitation-703          [2, 3096, 17, 17]               0
          Conv2d-704           [2, 516, 17, 17]       1,597,536
     BatchNorm2d-705           [2, 516, 17, 17]           1,032
InvertedResidualBlock-706           [2, 516, 17, 17]               0
          Conv2d-707          [2, 2062, 17, 17]       1,063,992
     BatchNorm2d-708          [2, 2062, 17, 17]           4,124
            SiLU-709          [2, 2062, 17, 17]               0
        CNNBlock-710          [2, 2062, 17, 17]               0
AdaptiveAvgPool2d-711            [2, 2062, 1, 1]               0
         Flatten-712                  [2, 2062]               0
         Dropout-713                  [2, 2062]               0
          Linear-714                     [2, 2]           4,126
    EfficientNet-715                     [2, 2]               0
================================================================
Total params: 124,050,066
Trainable params: 124,050,066
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 6.38
Forward/backward pass size (MB): 9257.01
Params size (MB): 473.21
Estimated Total Size (MB): 9736.60
----------------------------------------------------------------

