EfficientNetB1----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [2, 33, 120, 120]             891
       BatchNorm2d-2          [2, 33, 120, 120]              66
              SiLU-3          [2, 33, 120, 120]               0
          CNNBlock-4          [2, 33, 120, 120]               0
            Conv2d-5          [2, 33, 120, 120]             297
       BatchNorm2d-6          [2, 33, 120, 120]              66
              SiLU-7          [2, 33, 120, 120]               0
          CNNBlock-8          [2, 33, 120, 120]               0
 AdaptiveAvgPool2d-9              [2, 33, 1, 1]               0
           Conv2d-10               [2, 8, 1, 1]             272
             SiLU-11               [2, 8, 1, 1]               0
           Conv2d-12              [2, 33, 1, 1]             297
          Sigmoid-13              [2, 33, 1, 1]               0
SqueezeExcitation-14          [2, 33, 120, 120]               0
           Conv2d-15          [2, 16, 120, 120]             528
      BatchNorm2d-16          [2, 16, 120, 120]              32
InvertedResidualBlock-17          [2, 16, 120, 120]               0
           Conv2d-18          [2, 16, 120, 120]             144
      BatchNorm2d-19          [2, 16, 120, 120]              32
             SiLU-20          [2, 16, 120, 120]               0
         CNNBlock-21          [2, 16, 120, 120]               0
AdaptiveAvgPool2d-22              [2, 16, 1, 1]               0
           Conv2d-23               [2, 4, 1, 1]              68
             SiLU-24               [2, 4, 1, 1]               0
           Conv2d-25              [2, 16, 1, 1]              80
          Sigmoid-26              [2, 16, 1, 1]               0
SqueezeExcitation-27          [2, 16, 120, 120]               0
           Conv2d-28          [2, 16, 120, 120]             256
      BatchNorm2d-29          [2, 16, 120, 120]              32
InvertedResidualBlock-30          [2, 16, 120, 120]               0
           Conv2d-31          [2, 96, 120, 120]          13,824
      BatchNorm2d-32          [2, 96, 120, 120]             192
             SiLU-33          [2, 96, 120, 120]               0
         CNNBlock-34          [2, 96, 120, 120]               0
           Conv2d-35            [2, 96, 60, 60]             864
      BatchNorm2d-36            [2, 96, 60, 60]             192
             SiLU-37            [2, 96, 60, 60]               0
         CNNBlock-38            [2, 96, 60, 60]               0
AdaptiveAvgPool2d-39              [2, 96, 1, 1]               0
           Conv2d-40               [2, 4, 1, 1]             388
             SiLU-41               [2, 4, 1, 1]               0
           Conv2d-42              [2, 96, 1, 1]             480
          Sigmoid-43              [2, 96, 1, 1]               0
SqueezeExcitation-44            [2, 96, 60, 60]               0
           Conv2d-45            [2, 28, 60, 60]           2,688
      BatchNorm2d-46            [2, 28, 60, 60]              56
InvertedResidualBlock-47            [2, 28, 60, 60]               0
           Conv2d-48           [2, 168, 60, 60]          42,336
      BatchNorm2d-49           [2, 168, 60, 60]             336
             SiLU-50           [2, 168, 60, 60]               0
         CNNBlock-51           [2, 168, 60, 60]               0
           Conv2d-52           [2, 168, 60, 60]           1,512
      BatchNorm2d-53           [2, 168, 60, 60]             336
             SiLU-54           [2, 168, 60, 60]               0
         CNNBlock-55           [2, 168, 60, 60]               0
AdaptiveAvgPool2d-56             [2, 168, 1, 1]               0
           Conv2d-57               [2, 7, 1, 1]           1,183
             SiLU-58               [2, 7, 1, 1]               0
           Conv2d-59             [2, 168, 1, 1]           1,344
          Sigmoid-60             [2, 168, 1, 1]               0
SqueezeExcitation-61           [2, 168, 60, 60]               0
           Conv2d-62            [2, 28, 60, 60]           4,704
      BatchNorm2d-63            [2, 28, 60, 60]              56
InvertedResidualBlock-64            [2, 28, 60, 60]               0
           Conv2d-65           [2, 168, 60, 60]          42,336
      BatchNorm2d-66           [2, 168, 60, 60]             336
             SiLU-67           [2, 168, 60, 60]               0
         CNNBlock-68           [2, 168, 60, 60]               0
           Conv2d-69           [2, 168, 60, 60]           1,512
      BatchNorm2d-70           [2, 168, 60, 60]             336
             SiLU-71           [2, 168, 60, 60]               0
         CNNBlock-72           [2, 168, 60, 60]               0
AdaptiveAvgPool2d-73             [2, 168, 1, 1]               0
           Conv2d-74               [2, 7, 1, 1]           1,183
             SiLU-75               [2, 7, 1, 1]               0
           Conv2d-76             [2, 168, 1, 1]           1,344
          Sigmoid-77             [2, 168, 1, 1]               0
SqueezeExcitation-78           [2, 168, 60, 60]               0
           Conv2d-79            [2, 28, 60, 60]           4,704
      BatchNorm2d-80            [2, 28, 60, 60]              56
InvertedResidualBlock-81            [2, 28, 60, 60]               0
           Conv2d-82           [2, 168, 60, 60]          42,336
      BatchNorm2d-83           [2, 168, 60, 60]             336
             SiLU-84           [2, 168, 60, 60]               0
         CNNBlock-85           [2, 168, 60, 60]               0
           Conv2d-86           [2, 168, 30, 30]           4,200
      BatchNorm2d-87           [2, 168, 30, 30]             336
             SiLU-88           [2, 168, 30, 30]               0
         CNNBlock-89           [2, 168, 30, 30]               0
AdaptiveAvgPool2d-90             [2, 168, 1, 1]               0
           Conv2d-91               [2, 7, 1, 1]           1,183
             SiLU-92               [2, 7, 1, 1]               0
           Conv2d-93             [2, 168, 1, 1]           1,344
          Sigmoid-94             [2, 168, 1, 1]               0
SqueezeExcitation-95           [2, 168, 30, 30]               0
           Conv2d-96            [2, 44, 30, 30]           7,392
      BatchNorm2d-97            [2, 44, 30, 30]              88
InvertedResidualBlock-98            [2, 44, 30, 30]               0
           Conv2d-99           [2, 264, 30, 30]         104,544
     BatchNorm2d-100           [2, 264, 30, 30]             528
            SiLU-101           [2, 264, 30, 30]               0
        CNNBlock-102           [2, 264, 30, 30]               0
          Conv2d-103           [2, 264, 30, 30]           6,600
     BatchNorm2d-104           [2, 264, 30, 30]             528
            SiLU-105           [2, 264, 30, 30]               0
        CNNBlock-106           [2, 264, 30, 30]               0
AdaptiveAvgPool2d-107             [2, 264, 1, 1]               0
          Conv2d-108              [2, 11, 1, 1]           2,915
            SiLU-109              [2, 11, 1, 1]               0
          Conv2d-110             [2, 264, 1, 1]           3,168
         Sigmoid-111             [2, 264, 1, 1]               0
SqueezeExcitation-112           [2, 264, 30, 30]               0
          Conv2d-113            [2, 44, 30, 30]          11,616
     BatchNorm2d-114            [2, 44, 30, 30]              88
InvertedResidualBlock-115            [2, 44, 30, 30]               0
          Conv2d-116           [2, 264, 30, 30]         104,544
     BatchNorm2d-117           [2, 264, 30, 30]             528
            SiLU-118           [2, 264, 30, 30]               0
        CNNBlock-119           [2, 264, 30, 30]               0
          Conv2d-120           [2, 264, 30, 30]           6,600
     BatchNorm2d-121           [2, 264, 30, 30]             528
            SiLU-122           [2, 264, 30, 30]               0
        CNNBlock-123           [2, 264, 30, 30]               0
AdaptiveAvgPool2d-124             [2, 264, 1, 1]               0
          Conv2d-125              [2, 11, 1, 1]           2,915
            SiLU-126              [2, 11, 1, 1]               0
          Conv2d-127             [2, 264, 1, 1]           3,168
         Sigmoid-128             [2, 264, 1, 1]               0
SqueezeExcitation-129           [2, 264, 30, 30]               0
          Conv2d-130            [2, 44, 30, 30]          11,616
     BatchNorm2d-131            [2, 44, 30, 30]              88
InvertedResidualBlock-132            [2, 44, 30, 30]               0
          Conv2d-133           [2, 264, 30, 30]         104,544
     BatchNorm2d-134           [2, 264, 30, 30]             528
            SiLU-135           [2, 264, 30, 30]               0
        CNNBlock-136           [2, 264, 30, 30]               0
          Conv2d-137           [2, 264, 15, 15]           2,376
     BatchNorm2d-138           [2, 264, 15, 15]             528
            SiLU-139           [2, 264, 15, 15]               0
        CNNBlock-140           [2, 264, 15, 15]               0
AdaptiveAvgPool2d-141             [2, 264, 1, 1]               0
          Conv2d-142              [2, 11, 1, 1]           2,915
            SiLU-143              [2, 11, 1, 1]               0
          Conv2d-144             [2, 264, 1, 1]           3,168
         Sigmoid-145             [2, 264, 1, 1]               0
SqueezeExcitation-146           [2, 264, 15, 15]               0
          Conv2d-147            [2, 84, 15, 15]          22,176
     BatchNorm2d-148            [2, 84, 15, 15]             168
InvertedResidualBlock-149            [2, 84, 15, 15]               0
          Conv2d-150           [2, 504, 15, 15]         381,024
     BatchNorm2d-151           [2, 504, 15, 15]           1,008
            SiLU-152           [2, 504, 15, 15]               0
        CNNBlock-153           [2, 504, 15, 15]               0
          Conv2d-154           [2, 504, 15, 15]           4,536
     BatchNorm2d-155           [2, 504, 15, 15]           1,008
            SiLU-156           [2, 504, 15, 15]               0
        CNNBlock-157           [2, 504, 15, 15]               0
AdaptiveAvgPool2d-158             [2, 504, 1, 1]               0
          Conv2d-159              [2, 21, 1, 1]          10,605
            SiLU-160              [2, 21, 1, 1]               0
          Conv2d-161             [2, 504, 1, 1]          11,088
         Sigmoid-162             [2, 504, 1, 1]               0
SqueezeExcitation-163           [2, 504, 15, 15]               0
          Conv2d-164            [2, 84, 15, 15]          42,336
     BatchNorm2d-165            [2, 84, 15, 15]             168
InvertedResidualBlock-166            [2, 84, 15, 15]               0
          Conv2d-167           [2, 504, 15, 15]         381,024
     BatchNorm2d-168           [2, 504, 15, 15]           1,008
            SiLU-169           [2, 504, 15, 15]               0
        CNNBlock-170           [2, 504, 15, 15]               0
          Conv2d-171           [2, 504, 15, 15]           4,536
     BatchNorm2d-172           [2, 504, 15, 15]           1,008
            SiLU-173           [2, 504, 15, 15]               0
        CNNBlock-174           [2, 504, 15, 15]               0
AdaptiveAvgPool2d-175             [2, 504, 1, 1]               0
          Conv2d-176              [2, 21, 1, 1]          10,605
            SiLU-177              [2, 21, 1, 1]               0
          Conv2d-178             [2, 504, 1, 1]          11,088
         Sigmoid-179             [2, 504, 1, 1]               0
SqueezeExcitation-180           [2, 504, 15, 15]               0
          Conv2d-181            [2, 84, 15, 15]          42,336
     BatchNorm2d-182            [2, 84, 15, 15]             168
InvertedResidualBlock-183            [2, 84, 15, 15]               0
          Conv2d-184           [2, 504, 15, 15]         381,024
     BatchNorm2d-185           [2, 504, 15, 15]           1,008
            SiLU-186           [2, 504, 15, 15]               0
        CNNBlock-187           [2, 504, 15, 15]               0
          Conv2d-188           [2, 504, 15, 15]           4,536
     BatchNorm2d-189           [2, 504, 15, 15]           1,008
            SiLU-190           [2, 504, 15, 15]               0
        CNNBlock-191           [2, 504, 15, 15]               0
AdaptiveAvgPool2d-192             [2, 504, 1, 1]               0
          Conv2d-193              [2, 21, 1, 1]          10,605
            SiLU-194              [2, 21, 1, 1]               0
          Conv2d-195             [2, 504, 1, 1]          11,088
         Sigmoid-196             [2, 504, 1, 1]               0
SqueezeExcitation-197           [2, 504, 15, 15]               0
          Conv2d-198            [2, 84, 15, 15]          42,336
     BatchNorm2d-199            [2, 84, 15, 15]             168
InvertedResidualBlock-200            [2, 84, 15, 15]               0
          Conv2d-201           [2, 504, 15, 15]         381,024
     BatchNorm2d-202           [2, 504, 15, 15]           1,008
            SiLU-203           [2, 504, 15, 15]               0
        CNNBlock-204           [2, 504, 15, 15]               0
          Conv2d-205           [2, 504, 15, 15]          12,600
     BatchNorm2d-206           [2, 504, 15, 15]           1,008
            SiLU-207           [2, 504, 15, 15]               0
        CNNBlock-208           [2, 504, 15, 15]               0
AdaptiveAvgPool2d-209             [2, 504, 1, 1]               0
          Conv2d-210              [2, 21, 1, 1]          10,605
            SiLU-211              [2, 21, 1, 1]               0
          Conv2d-212             [2, 504, 1, 1]          11,088
         Sigmoid-213             [2, 504, 1, 1]               0
SqueezeExcitation-214           [2, 504, 15, 15]               0
          Conv2d-215           [2, 120, 15, 15]          60,480
     BatchNorm2d-216           [2, 120, 15, 15]             240
InvertedResidualBlock-217           [2, 120, 15, 15]               0
          Conv2d-218           [2, 720, 15, 15]         777,600
     BatchNorm2d-219           [2, 720, 15, 15]           1,440
            SiLU-220           [2, 720, 15, 15]               0
        CNNBlock-221           [2, 720, 15, 15]               0
          Conv2d-222           [2, 720, 15, 15]          18,000
     BatchNorm2d-223           [2, 720, 15, 15]           1,440
            SiLU-224           [2, 720, 15, 15]               0
        CNNBlock-225           [2, 720, 15, 15]               0
AdaptiveAvgPool2d-226             [2, 720, 1, 1]               0
          Conv2d-227              [2, 30, 1, 1]          21,630
            SiLU-228              [2, 30, 1, 1]               0
          Conv2d-229             [2, 720, 1, 1]          22,320
         Sigmoid-230             [2, 720, 1, 1]               0
SqueezeExcitation-231           [2, 720, 15, 15]               0
          Conv2d-232           [2, 120, 15, 15]          86,400
     BatchNorm2d-233           [2, 120, 15, 15]             240
InvertedResidualBlock-234           [2, 120, 15, 15]               0
          Conv2d-235           [2, 720, 15, 15]         777,600
     BatchNorm2d-236           [2, 720, 15, 15]           1,440
            SiLU-237           [2, 720, 15, 15]               0
        CNNBlock-238           [2, 720, 15, 15]               0
          Conv2d-239           [2, 720, 15, 15]          18,000
     BatchNorm2d-240           [2, 720, 15, 15]           1,440
            SiLU-241           [2, 720, 15, 15]               0
        CNNBlock-242           [2, 720, 15, 15]               0
AdaptiveAvgPool2d-243             [2, 720, 1, 1]               0
          Conv2d-244              [2, 30, 1, 1]          21,630
            SiLU-245              [2, 30, 1, 1]               0
          Conv2d-246             [2, 720, 1, 1]          22,320
         Sigmoid-247             [2, 720, 1, 1]               0
SqueezeExcitation-248           [2, 720, 15, 15]               0
          Conv2d-249           [2, 120, 15, 15]          86,400
     BatchNorm2d-250           [2, 120, 15, 15]             240
InvertedResidualBlock-251           [2, 120, 15, 15]               0
          Conv2d-252           [2, 720, 15, 15]         777,600
     BatchNorm2d-253           [2, 720, 15, 15]           1,440
            SiLU-254           [2, 720, 15, 15]               0
        CNNBlock-255           [2, 720, 15, 15]               0
          Conv2d-256           [2, 720, 15, 15]          18,000
     BatchNorm2d-257           [2, 720, 15, 15]           1,440
            SiLU-258           [2, 720, 15, 15]               0
        CNNBlock-259           [2, 720, 15, 15]               0
AdaptiveAvgPool2d-260             [2, 720, 1, 1]               0
          Conv2d-261              [2, 30, 1, 1]          21,630
            SiLU-262              [2, 30, 1, 1]               0
          Conv2d-263             [2, 720, 1, 1]          22,320
         Sigmoid-264             [2, 720, 1, 1]               0
SqueezeExcitation-265           [2, 720, 15, 15]               0
          Conv2d-266           [2, 120, 15, 15]          86,400
     BatchNorm2d-267           [2, 120, 15, 15]             240
InvertedResidualBlock-268           [2, 120, 15, 15]               0
          Conv2d-269           [2, 720, 15, 15]         777,600
     BatchNorm2d-270           [2, 720, 15, 15]           1,440
            SiLU-271           [2, 720, 15, 15]               0
        CNNBlock-272           [2, 720, 15, 15]               0
          Conv2d-273             [2, 720, 8, 8]          18,000
     BatchNorm2d-274             [2, 720, 8, 8]           1,440
            SiLU-275             [2, 720, 8, 8]               0
        CNNBlock-276             [2, 720, 8, 8]               0
AdaptiveAvgPool2d-277             [2, 720, 1, 1]               0
          Conv2d-278              [2, 30, 1, 1]          21,630
            SiLU-279              [2, 30, 1, 1]               0
          Conv2d-280             [2, 720, 1, 1]          22,320
         Sigmoid-281             [2, 720, 1, 1]               0
SqueezeExcitation-282             [2, 720, 8, 8]               0
          Conv2d-283             [2, 204, 8, 8]         146,880
     BatchNorm2d-284             [2, 204, 8, 8]             408
InvertedResidualBlock-285             [2, 204, 8, 8]               0
          Conv2d-286            [2, 1224, 8, 8]       2,247,264
     BatchNorm2d-287            [2, 1224, 8, 8]           2,448
            SiLU-288            [2, 1224, 8, 8]               0
        CNNBlock-289            [2, 1224, 8, 8]               0
          Conv2d-290            [2, 1224, 8, 8]          30,600
     BatchNorm2d-291            [2, 1224, 8, 8]           2,448
            SiLU-292            [2, 1224, 8, 8]               0
        CNNBlock-293            [2, 1224, 8, 8]               0
AdaptiveAvgPool2d-294            [2, 1224, 1, 1]               0
          Conv2d-295              [2, 51, 1, 1]          62,475
            SiLU-296              [2, 51, 1, 1]               0
          Conv2d-297            [2, 1224, 1, 1]          63,648
         Sigmoid-298            [2, 1224, 1, 1]               0
SqueezeExcitation-299            [2, 1224, 8, 8]               0
          Conv2d-300             [2, 204, 8, 8]         249,696
     BatchNorm2d-301             [2, 204, 8, 8]             408
InvertedResidualBlock-302             [2, 204, 8, 8]               0
          Conv2d-303            [2, 1224, 8, 8]       2,247,264
     BatchNorm2d-304            [2, 1224, 8, 8]           2,448
            SiLU-305            [2, 1224, 8, 8]               0
        CNNBlock-306            [2, 1224, 8, 8]               0
          Conv2d-307            [2, 1224, 8, 8]          30,600
     BatchNorm2d-308            [2, 1224, 8, 8]           2,448
            SiLU-309            [2, 1224, 8, 8]               0
        CNNBlock-310            [2, 1224, 8, 8]               0
AdaptiveAvgPool2d-311            [2, 1224, 1, 1]               0
          Conv2d-312              [2, 51, 1, 1]          62,475
            SiLU-313              [2, 51, 1, 1]               0
          Conv2d-314            [2, 1224, 1, 1]          63,648
         Sigmoid-315            [2, 1224, 1, 1]               0
SqueezeExcitation-316            [2, 1224, 8, 8]               0
          Conv2d-317             [2, 204, 8, 8]         249,696
     BatchNorm2d-318             [2, 204, 8, 8]             408
InvertedResidualBlock-319             [2, 204, 8, 8]               0
          Conv2d-320            [2, 1224, 8, 8]       2,247,264
     BatchNorm2d-321            [2, 1224, 8, 8]           2,448
            SiLU-322            [2, 1224, 8, 8]               0
        CNNBlock-323            [2, 1224, 8, 8]               0
          Conv2d-324            [2, 1224, 8, 8]          30,600
     BatchNorm2d-325            [2, 1224, 8, 8]           2,448
            SiLU-326            [2, 1224, 8, 8]               0
        CNNBlock-327            [2, 1224, 8, 8]               0
AdaptiveAvgPool2d-328            [2, 1224, 1, 1]               0
          Conv2d-329              [2, 51, 1, 1]          62,475
            SiLU-330              [2, 51, 1, 1]               0
          Conv2d-331            [2, 1224, 1, 1]          63,648
         Sigmoid-332            [2, 1224, 1, 1]               0
SqueezeExcitation-333            [2, 1224, 8, 8]               0
          Conv2d-334             [2, 204, 8, 8]         249,696
     BatchNorm2d-335             [2, 204, 8, 8]             408
InvertedResidualBlock-336             [2, 204, 8, 8]               0
          Conv2d-337            [2, 1224, 8, 8]       2,247,264
     BatchNorm2d-338            [2, 1224, 8, 8]           2,448
            SiLU-339            [2, 1224, 8, 8]               0
        CNNBlock-340            [2, 1224, 8, 8]               0
          Conv2d-341            [2, 1224, 8, 8]          30,600
     BatchNorm2d-342            [2, 1224, 8, 8]           2,448
            SiLU-343            [2, 1224, 8, 8]               0
        CNNBlock-344            [2, 1224, 8, 8]               0
AdaptiveAvgPool2d-345            [2, 1224, 1, 1]               0
          Conv2d-346              [2, 51, 1, 1]          62,475
            SiLU-347              [2, 51, 1, 1]               0
          Conv2d-348            [2, 1224, 1, 1]          63,648
         Sigmoid-349            [2, 1224, 1, 1]               0
SqueezeExcitation-350            [2, 1224, 8, 8]               0
          Conv2d-351             [2, 204, 8, 8]         249,696
     BatchNorm2d-352             [2, 204, 8, 8]             408
InvertedResidualBlock-353             [2, 204, 8, 8]               0
          Conv2d-354            [2, 1224, 8, 8]       2,247,264
     BatchNorm2d-355            [2, 1224, 8, 8]           2,448
            SiLU-356            [2, 1224, 8, 8]               0
        CNNBlock-357            [2, 1224, 8, 8]               0
          Conv2d-358            [2, 1224, 8, 8]          11,016
     BatchNorm2d-359            [2, 1224, 8, 8]           2,448
            SiLU-360            [2, 1224, 8, 8]               0
        CNNBlock-361            [2, 1224, 8, 8]               0
AdaptiveAvgPool2d-362            [2, 1224, 1, 1]               0
          Conv2d-363              [2, 51, 1, 1]          62,475
            SiLU-364              [2, 51, 1, 1]               0
          Conv2d-365            [2, 1224, 1, 1]          63,648
         Sigmoid-366            [2, 1224, 1, 1]               0
SqueezeExcitation-367            [2, 1224, 8, 8]               0
          Conv2d-368             [2, 336, 8, 8]         411,264
     BatchNorm2d-369             [2, 336, 8, 8]             672
InvertedResidualBlock-370             [2, 336, 8, 8]               0
          Conv2d-371            [2, 2016, 8, 8]       6,096,384
     BatchNorm2d-372            [2, 2016, 8, 8]           4,032
            SiLU-373            [2, 2016, 8, 8]               0
        CNNBlock-374            [2, 2016, 8, 8]               0
          Conv2d-375            [2, 2016, 8, 8]          18,144
     BatchNorm2d-376            [2, 2016, 8, 8]           4,032
            SiLU-377            [2, 2016, 8, 8]               0
        CNNBlock-378            [2, 2016, 8, 8]               0
AdaptiveAvgPool2d-379            [2, 2016, 1, 1]               0
          Conv2d-380              [2, 84, 1, 1]         169,428
            SiLU-381              [2, 84, 1, 1]               0
          Conv2d-382            [2, 2016, 1, 1]         171,360
         Sigmoid-383            [2, 2016, 1, 1]               0
SqueezeExcitation-384            [2, 2016, 8, 8]               0
          Conv2d-385             [2, 336, 8, 8]         677,376
     BatchNorm2d-386             [2, 336, 8, 8]             672
InvertedResidualBlock-387             [2, 336, 8, 8]               0
          Conv2d-388            [2, 1343, 8, 8]         451,248
     BatchNorm2d-389            [2, 1343, 8, 8]           2,686
            SiLU-390            [2, 1343, 8, 8]               0
        CNNBlock-391            [2, 1343, 8, 8]               0
AdaptiveAvgPool2d-392            [2, 1343, 1, 1]               0
         Flatten-393                  [2, 1343]               0
         Dropout-394                  [2, 1343]               0
          Linear-395                     [2, 2]           2,688
    EfficientNet-396                     [2, 2]               0
================================================================
Total params: 27,224,484
Trainable params: 27,224,484
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.32
Forward/backward pass size (MB): 766.11
Params size (MB): 103.85
Estimated Total Size (MB): 871.28
----------------------------------------------------------------

