EfficientNetB4----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [2, 42, 190, 190]           1,134
       BatchNorm2d-2          [2, 42, 190, 190]              84
              SiLU-3          [2, 42, 190, 190]               0
          CNNBlock-4          [2, 42, 190, 190]               0
            Conv2d-5          [2, 42, 190, 190]             378
       BatchNorm2d-6          [2, 42, 190, 190]              84
              SiLU-7          [2, 42, 190, 190]               0
          CNNBlock-8          [2, 42, 190, 190]               0
 AdaptiveAvgPool2d-9              [2, 42, 1, 1]               0
           Conv2d-10              [2, 10, 1, 1]             430
             SiLU-11              [2, 10, 1, 1]               0
           Conv2d-12              [2, 42, 1, 1]             462
          Sigmoid-13              [2, 42, 1, 1]               0
SqueezeExcitation-14          [2, 42, 190, 190]               0
           Conv2d-15          [2, 24, 190, 190]           1,008
      BatchNorm2d-16          [2, 24, 190, 190]              48
InvertedResidualBlock-17          [2, 24, 190, 190]               0
           Conv2d-18          [2, 24, 190, 190]             216
      BatchNorm2d-19          [2, 24, 190, 190]              48
             SiLU-20          [2, 24, 190, 190]               0
         CNNBlock-21          [2, 24, 190, 190]               0
AdaptiveAvgPool2d-22              [2, 24, 1, 1]               0
           Conv2d-23               [2, 6, 1, 1]             150
             SiLU-24               [2, 6, 1, 1]               0
           Conv2d-25              [2, 24, 1, 1]             168
          Sigmoid-26              [2, 24, 1, 1]               0
SqueezeExcitation-27          [2, 24, 190, 190]               0
           Conv2d-28          [2, 24, 190, 190]             576
      BatchNorm2d-29          [2, 24, 190, 190]              48
InvertedResidualBlock-30          [2, 24, 190, 190]               0
           Conv2d-31         [2, 144, 190, 190]          31,104
      BatchNorm2d-32         [2, 144, 190, 190]             288
             SiLU-33         [2, 144, 190, 190]               0
         CNNBlock-34         [2, 144, 190, 190]               0
           Conv2d-35           [2, 144, 95, 95]           1,296
      BatchNorm2d-36           [2, 144, 95, 95]             288
             SiLU-37           [2, 144, 95, 95]               0
         CNNBlock-38           [2, 144, 95, 95]               0
AdaptiveAvgPool2d-39             [2, 144, 1, 1]               0
           Conv2d-40               [2, 6, 1, 1]             870
             SiLU-41               [2, 6, 1, 1]               0
           Conv2d-42             [2, 144, 1, 1]           1,008
          Sigmoid-43             [2, 144, 1, 1]               0
SqueezeExcitation-44           [2, 144, 95, 95]               0
           Conv2d-45            [2, 32, 95, 95]           4,608
      BatchNorm2d-46            [2, 32, 95, 95]              64
InvertedResidualBlock-47            [2, 32, 95, 95]               0
           Conv2d-48           [2, 192, 95, 95]          55,296
      BatchNorm2d-49           [2, 192, 95, 95]             384
             SiLU-50           [2, 192, 95, 95]               0
         CNNBlock-51           [2, 192, 95, 95]               0
           Conv2d-52           [2, 192, 95, 95]           1,728
      BatchNorm2d-53           [2, 192, 95, 95]             384
             SiLU-54           [2, 192, 95, 95]               0
         CNNBlock-55           [2, 192, 95, 95]               0
AdaptiveAvgPool2d-56             [2, 192, 1, 1]               0
           Conv2d-57               [2, 8, 1, 1]           1,544
             SiLU-58               [2, 8, 1, 1]               0
           Conv2d-59             [2, 192, 1, 1]           1,728
          Sigmoid-60             [2, 192, 1, 1]               0
SqueezeExcitation-61           [2, 192, 95, 95]               0
           Conv2d-62            [2, 32, 95, 95]           6,144
      BatchNorm2d-63            [2, 32, 95, 95]              64
InvertedResidualBlock-64            [2, 32, 95, 95]               0
           Conv2d-65           [2, 192, 95, 95]          55,296
      BatchNorm2d-66           [2, 192, 95, 95]             384
             SiLU-67           [2, 192, 95, 95]               0
         CNNBlock-68           [2, 192, 95, 95]               0
           Conv2d-69           [2, 192, 95, 95]           1,728
      BatchNorm2d-70           [2, 192, 95, 95]             384
             SiLU-71           [2, 192, 95, 95]               0
         CNNBlock-72           [2, 192, 95, 95]               0
AdaptiveAvgPool2d-73             [2, 192, 1, 1]               0
           Conv2d-74               [2, 8, 1, 1]           1,544
             SiLU-75               [2, 8, 1, 1]               0
           Conv2d-76             [2, 192, 1, 1]           1,728
          Sigmoid-77             [2, 192, 1, 1]               0
SqueezeExcitation-78           [2, 192, 95, 95]               0
           Conv2d-79            [2, 32, 95, 95]           6,144
      BatchNorm2d-80            [2, 32, 95, 95]              64
InvertedResidualBlock-81            [2, 32, 95, 95]               0
           Conv2d-82           [2, 192, 95, 95]          55,296
      BatchNorm2d-83           [2, 192, 95, 95]             384
             SiLU-84           [2, 192, 95, 95]               0
         CNNBlock-85           [2, 192, 95, 95]               0
           Conv2d-86           [2, 192, 95, 95]           1,728
      BatchNorm2d-87           [2, 192, 95, 95]             384
             SiLU-88           [2, 192, 95, 95]               0
         CNNBlock-89           [2, 192, 95, 95]               0
AdaptiveAvgPool2d-90             [2, 192, 1, 1]               0
           Conv2d-91               [2, 8, 1, 1]           1,544
             SiLU-92               [2, 8, 1, 1]               0
           Conv2d-93             [2, 192, 1, 1]           1,728
          Sigmoid-94             [2, 192, 1, 1]               0
SqueezeExcitation-95           [2, 192, 95, 95]               0
           Conv2d-96            [2, 32, 95, 95]           6,144
      BatchNorm2d-97            [2, 32, 95, 95]              64
InvertedResidualBlock-98            [2, 32, 95, 95]               0
           Conv2d-99           [2, 192, 95, 95]          55,296
     BatchNorm2d-100           [2, 192, 95, 95]             384
            SiLU-101           [2, 192, 95, 95]               0
        CNNBlock-102           [2, 192, 95, 95]               0
          Conv2d-103           [2, 192, 48, 48]           4,800
     BatchNorm2d-104           [2, 192, 48, 48]             384
            SiLU-105           [2, 192, 48, 48]               0
        CNNBlock-106           [2, 192, 48, 48]               0
AdaptiveAvgPool2d-107             [2, 192, 1, 1]               0
          Conv2d-108               [2, 8, 1, 1]           1,544
            SiLU-109               [2, 8, 1, 1]               0
          Conv2d-110             [2, 192, 1, 1]           1,728
         Sigmoid-111             [2, 192, 1, 1]               0
SqueezeExcitation-112           [2, 192, 48, 48]               0
          Conv2d-113            [2, 56, 48, 48]          10,752
     BatchNorm2d-114            [2, 56, 48, 48]             112
InvertedResidualBlock-115            [2, 56, 48, 48]               0
          Conv2d-116           [2, 336, 48, 48]         169,344
     BatchNorm2d-117           [2, 336, 48, 48]             672
            SiLU-118           [2, 336, 48, 48]               0
        CNNBlock-119           [2, 336, 48, 48]               0
          Conv2d-120           [2, 336, 48, 48]           8,400
     BatchNorm2d-121           [2, 336, 48, 48]             672
            SiLU-122           [2, 336, 48, 48]               0
        CNNBlock-123           [2, 336, 48, 48]               0
AdaptiveAvgPool2d-124             [2, 336, 1, 1]               0
          Conv2d-125              [2, 14, 1, 1]           4,718
            SiLU-126              [2, 14, 1, 1]               0
          Conv2d-127             [2, 336, 1, 1]           5,040
         Sigmoid-128             [2, 336, 1, 1]               0
SqueezeExcitation-129           [2, 336, 48, 48]               0
          Conv2d-130            [2, 56, 48, 48]          18,816
     BatchNorm2d-131            [2, 56, 48, 48]             112
InvertedResidualBlock-132            [2, 56, 48, 48]               0
          Conv2d-133           [2, 336, 48, 48]         169,344
     BatchNorm2d-134           [2, 336, 48, 48]             672
            SiLU-135           [2, 336, 48, 48]               0
        CNNBlock-136           [2, 336, 48, 48]               0
          Conv2d-137           [2, 336, 48, 48]           8,400
     BatchNorm2d-138           [2, 336, 48, 48]             672
            SiLU-139           [2, 336, 48, 48]               0
        CNNBlock-140           [2, 336, 48, 48]               0
AdaptiveAvgPool2d-141             [2, 336, 1, 1]               0
          Conv2d-142              [2, 14, 1, 1]           4,718
            SiLU-143              [2, 14, 1, 1]               0
          Conv2d-144             [2, 336, 1, 1]           5,040
         Sigmoid-145             [2, 336, 1, 1]               0
SqueezeExcitation-146           [2, 336, 48, 48]               0
          Conv2d-147            [2, 56, 48, 48]          18,816
     BatchNorm2d-148            [2, 56, 48, 48]             112
InvertedResidualBlock-149            [2, 56, 48, 48]               0
          Conv2d-150           [2, 336, 48, 48]         169,344
     BatchNorm2d-151           [2, 336, 48, 48]             672
            SiLU-152           [2, 336, 48, 48]               0
        CNNBlock-153           [2, 336, 48, 48]               0
          Conv2d-154           [2, 336, 48, 48]           8,400
     BatchNorm2d-155           [2, 336, 48, 48]             672
            SiLU-156           [2, 336, 48, 48]               0
        CNNBlock-157           [2, 336, 48, 48]               0
AdaptiveAvgPool2d-158             [2, 336, 1, 1]               0
          Conv2d-159              [2, 14, 1, 1]           4,718
            SiLU-160              [2, 14, 1, 1]               0
          Conv2d-161             [2, 336, 1, 1]           5,040
         Sigmoid-162             [2, 336, 1, 1]               0
SqueezeExcitation-163           [2, 336, 48, 48]               0
          Conv2d-164            [2, 56, 48, 48]          18,816
     BatchNorm2d-165            [2, 56, 48, 48]             112
InvertedResidualBlock-166            [2, 56, 48, 48]               0
          Conv2d-167           [2, 336, 48, 48]         169,344
     BatchNorm2d-168           [2, 336, 48, 48]             672
            SiLU-169           [2, 336, 48, 48]               0
        CNNBlock-170           [2, 336, 48, 48]               0
          Conv2d-171           [2, 336, 24, 24]           3,024
     BatchNorm2d-172           [2, 336, 24, 24]             672
            SiLU-173           [2, 336, 24, 24]               0
        CNNBlock-174           [2, 336, 24, 24]               0
AdaptiveAvgPool2d-175             [2, 336, 1, 1]               0
          Conv2d-176              [2, 14, 1, 1]           4,718
            SiLU-177              [2, 14, 1, 1]               0
          Conv2d-178             [2, 336, 1, 1]           5,040
         Sigmoid-179             [2, 336, 1, 1]               0
SqueezeExcitation-180           [2, 336, 24, 24]               0
          Conv2d-181           [2, 108, 24, 24]          36,288
     BatchNorm2d-182           [2, 108, 24, 24]             216
InvertedResidualBlock-183           [2, 108, 24, 24]               0
          Conv2d-184           [2, 648, 24, 24]         629,856
     BatchNorm2d-185           [2, 648, 24, 24]           1,296
            SiLU-186           [2, 648, 24, 24]               0
        CNNBlock-187           [2, 648, 24, 24]               0
          Conv2d-188           [2, 648, 24, 24]           5,832
     BatchNorm2d-189           [2, 648, 24, 24]           1,296
            SiLU-190           [2, 648, 24, 24]               0
        CNNBlock-191           [2, 648, 24, 24]               0
AdaptiveAvgPool2d-192             [2, 648, 1, 1]               0
          Conv2d-193              [2, 27, 1, 1]          17,523
            SiLU-194              [2, 27, 1, 1]               0
          Conv2d-195             [2, 648, 1, 1]          18,144
         Sigmoid-196             [2, 648, 1, 1]               0
SqueezeExcitation-197           [2, 648, 24, 24]               0
          Conv2d-198           [2, 108, 24, 24]          69,984
     BatchNorm2d-199           [2, 108, 24, 24]             216
InvertedResidualBlock-200           [2, 108, 24, 24]               0
          Conv2d-201           [2, 648, 24, 24]         629,856
     BatchNorm2d-202           [2, 648, 24, 24]           1,296
            SiLU-203           [2, 648, 24, 24]               0
        CNNBlock-204           [2, 648, 24, 24]               0
          Conv2d-205           [2, 648, 24, 24]           5,832
     BatchNorm2d-206           [2, 648, 24, 24]           1,296
            SiLU-207           [2, 648, 24, 24]               0
        CNNBlock-208           [2, 648, 24, 24]               0
AdaptiveAvgPool2d-209             [2, 648, 1, 1]               0
          Conv2d-210              [2, 27, 1, 1]          17,523
            SiLU-211              [2, 27, 1, 1]               0
          Conv2d-212             [2, 648, 1, 1]          18,144
         Sigmoid-213             [2, 648, 1, 1]               0
SqueezeExcitation-214           [2, 648, 24, 24]               0
          Conv2d-215           [2, 108, 24, 24]          69,984
     BatchNorm2d-216           [2, 108, 24, 24]             216
InvertedResidualBlock-217           [2, 108, 24, 24]               0
          Conv2d-218           [2, 648, 24, 24]         629,856
     BatchNorm2d-219           [2, 648, 24, 24]           1,296
            SiLU-220           [2, 648, 24, 24]               0
        CNNBlock-221           [2, 648, 24, 24]               0
          Conv2d-222           [2, 648, 24, 24]           5,832
     BatchNorm2d-223           [2, 648, 24, 24]           1,296
            SiLU-224           [2, 648, 24, 24]               0
        CNNBlock-225           [2, 648, 24, 24]               0
AdaptiveAvgPool2d-226             [2, 648, 1, 1]               0
          Conv2d-227              [2, 27, 1, 1]          17,523
            SiLU-228              [2, 27, 1, 1]               0
          Conv2d-229             [2, 648, 1, 1]          18,144
         Sigmoid-230             [2, 648, 1, 1]               0
SqueezeExcitation-231           [2, 648, 24, 24]               0
          Conv2d-232           [2, 108, 24, 24]          69,984
     BatchNorm2d-233           [2, 108, 24, 24]             216
InvertedResidualBlock-234           [2, 108, 24, 24]               0
          Conv2d-235           [2, 648, 24, 24]         629,856
     BatchNorm2d-236           [2, 648, 24, 24]           1,296
            SiLU-237           [2, 648, 24, 24]               0
        CNNBlock-238           [2, 648, 24, 24]               0
          Conv2d-239           [2, 648, 24, 24]           5,832
     BatchNorm2d-240           [2, 648, 24, 24]           1,296
            SiLU-241           [2, 648, 24, 24]               0
        CNNBlock-242           [2, 648, 24, 24]               0
AdaptiveAvgPool2d-243             [2, 648, 1, 1]               0
          Conv2d-244              [2, 27, 1, 1]          17,523
            SiLU-245              [2, 27, 1, 1]               0
          Conv2d-246             [2, 648, 1, 1]          18,144
         Sigmoid-247             [2, 648, 1, 1]               0
SqueezeExcitation-248           [2, 648, 24, 24]               0
          Conv2d-249           [2, 108, 24, 24]          69,984
     BatchNorm2d-250           [2, 108, 24, 24]             216
InvertedResidualBlock-251           [2, 108, 24, 24]               0
          Conv2d-252           [2, 648, 24, 24]         629,856
     BatchNorm2d-253           [2, 648, 24, 24]           1,296
            SiLU-254           [2, 648, 24, 24]               0
        CNNBlock-255           [2, 648, 24, 24]               0
          Conv2d-256           [2, 648, 24, 24]           5,832
     BatchNorm2d-257           [2, 648, 24, 24]           1,296
            SiLU-258           [2, 648, 24, 24]               0
        CNNBlock-259           [2, 648, 24, 24]               0
AdaptiveAvgPool2d-260             [2, 648, 1, 1]               0
          Conv2d-261              [2, 27, 1, 1]          17,523
            SiLU-262              [2, 27, 1, 1]               0
          Conv2d-263             [2, 648, 1, 1]          18,144
         Sigmoid-264             [2, 648, 1, 1]               0
SqueezeExcitation-265           [2, 648, 24, 24]               0
          Conv2d-266           [2, 108, 24, 24]          69,984
     BatchNorm2d-267           [2, 108, 24, 24]             216
InvertedResidualBlock-268           [2, 108, 24, 24]               0
          Conv2d-269           [2, 648, 24, 24]         629,856
     BatchNorm2d-270           [2, 648, 24, 24]           1,296
            SiLU-271           [2, 648, 24, 24]               0
        CNNBlock-272           [2, 648, 24, 24]               0
          Conv2d-273           [2, 648, 24, 24]          16,200
     BatchNorm2d-274           [2, 648, 24, 24]           1,296
            SiLU-275           [2, 648, 24, 24]               0
        CNNBlock-276           [2, 648, 24, 24]               0
AdaptiveAvgPool2d-277             [2, 648, 1, 1]               0
          Conv2d-278              [2, 27, 1, 1]          17,523
            SiLU-279              [2, 27, 1, 1]               0
          Conv2d-280             [2, 648, 1, 1]          18,144
         Sigmoid-281             [2, 648, 1, 1]               0
SqueezeExcitation-282           [2, 648, 24, 24]               0
          Conv2d-283           [2, 152, 24, 24]          98,496
     BatchNorm2d-284           [2, 152, 24, 24]             304
InvertedResidualBlock-285           [2, 152, 24, 24]               0
          Conv2d-286           [2, 912, 24, 24]       1,247,616
     BatchNorm2d-287           [2, 912, 24, 24]           1,824
            SiLU-288           [2, 912, 24, 24]               0
        CNNBlock-289           [2, 912, 24, 24]               0
          Conv2d-290           [2, 912, 24, 24]          22,800
     BatchNorm2d-291           [2, 912, 24, 24]           1,824
            SiLU-292           [2, 912, 24, 24]               0
        CNNBlock-293           [2, 912, 24, 24]               0
AdaptiveAvgPool2d-294             [2, 912, 1, 1]               0
          Conv2d-295              [2, 38, 1, 1]          34,694
            SiLU-296              [2, 38, 1, 1]               0
          Conv2d-297             [2, 912, 1, 1]          35,568
         Sigmoid-298             [2, 912, 1, 1]               0
SqueezeExcitation-299           [2, 912, 24, 24]               0
          Conv2d-300           [2, 152, 24, 24]         138,624
     BatchNorm2d-301           [2, 152, 24, 24]             304
InvertedResidualBlock-302           [2, 152, 24, 24]               0
          Conv2d-303           [2, 912, 24, 24]       1,247,616
     BatchNorm2d-304           [2, 912, 24, 24]           1,824
            SiLU-305           [2, 912, 24, 24]               0
        CNNBlock-306           [2, 912, 24, 24]               0
          Conv2d-307           [2, 912, 24, 24]          22,800
     BatchNorm2d-308           [2, 912, 24, 24]           1,824
            SiLU-309           [2, 912, 24, 24]               0
        CNNBlock-310           [2, 912, 24, 24]               0
AdaptiveAvgPool2d-311             [2, 912, 1, 1]               0
          Conv2d-312              [2, 38, 1, 1]          34,694
            SiLU-313              [2, 38, 1, 1]               0
          Conv2d-314             [2, 912, 1, 1]          35,568
         Sigmoid-315             [2, 912, 1, 1]               0
SqueezeExcitation-316           [2, 912, 24, 24]               0
          Conv2d-317           [2, 152, 24, 24]         138,624
     BatchNorm2d-318           [2, 152, 24, 24]             304
InvertedResidualBlock-319           [2, 152, 24, 24]               0
          Conv2d-320           [2, 912, 24, 24]       1,247,616
     BatchNorm2d-321           [2, 912, 24, 24]           1,824
            SiLU-322           [2, 912, 24, 24]               0
        CNNBlock-323           [2, 912, 24, 24]               0
          Conv2d-324           [2, 912, 24, 24]          22,800
     BatchNorm2d-325           [2, 912, 24, 24]           1,824
            SiLU-326           [2, 912, 24, 24]               0
        CNNBlock-327           [2, 912, 24, 24]               0
AdaptiveAvgPool2d-328             [2, 912, 1, 1]               0
          Conv2d-329              [2, 38, 1, 1]          34,694
            SiLU-330              [2, 38, 1, 1]               0
          Conv2d-331             [2, 912, 1, 1]          35,568
         Sigmoid-332             [2, 912, 1, 1]               0
SqueezeExcitation-333           [2, 912, 24, 24]               0
          Conv2d-334           [2, 152, 24, 24]         138,624
     BatchNorm2d-335           [2, 152, 24, 24]             304
InvertedResidualBlock-336           [2, 152, 24, 24]               0
          Conv2d-337           [2, 912, 24, 24]       1,247,616
     BatchNorm2d-338           [2, 912, 24, 24]           1,824
            SiLU-339           [2, 912, 24, 24]               0
        CNNBlock-340           [2, 912, 24, 24]               0
          Conv2d-341           [2, 912, 24, 24]          22,800
     BatchNorm2d-342           [2, 912, 24, 24]           1,824
            SiLU-343           [2, 912, 24, 24]               0
        CNNBlock-344           [2, 912, 24, 24]               0
AdaptiveAvgPool2d-345             [2, 912, 1, 1]               0
          Conv2d-346              [2, 38, 1, 1]          34,694
            SiLU-347              [2, 38, 1, 1]               0
          Conv2d-348             [2, 912, 1, 1]          35,568
         Sigmoid-349             [2, 912, 1, 1]               0
SqueezeExcitation-350           [2, 912, 24, 24]               0
          Conv2d-351           [2, 152, 24, 24]         138,624
     BatchNorm2d-352           [2, 152, 24, 24]             304
InvertedResidualBlock-353           [2, 152, 24, 24]               0
          Conv2d-354           [2, 912, 24, 24]       1,247,616
     BatchNorm2d-355           [2, 912, 24, 24]           1,824
            SiLU-356           [2, 912, 24, 24]               0
        CNNBlock-357           [2, 912, 24, 24]               0
          Conv2d-358           [2, 912, 24, 24]          22,800
     BatchNorm2d-359           [2, 912, 24, 24]           1,824
            SiLU-360           [2, 912, 24, 24]               0
        CNNBlock-361           [2, 912, 24, 24]               0
AdaptiveAvgPool2d-362             [2, 912, 1, 1]               0
          Conv2d-363              [2, 38, 1, 1]          34,694
            SiLU-364              [2, 38, 1, 1]               0
          Conv2d-365             [2, 912, 1, 1]          35,568
         Sigmoid-366             [2, 912, 1, 1]               0
SqueezeExcitation-367           [2, 912, 24, 24]               0
          Conv2d-368           [2, 152, 24, 24]         138,624
     BatchNorm2d-369           [2, 152, 24, 24]             304
InvertedResidualBlock-370           [2, 152, 24, 24]               0
          Conv2d-371           [2, 912, 24, 24]       1,247,616
     BatchNorm2d-372           [2, 912, 24, 24]           1,824
            SiLU-373           [2, 912, 24, 24]               0
        CNNBlock-374           [2, 912, 24, 24]               0
          Conv2d-375           [2, 912, 12, 12]          22,800
     BatchNorm2d-376           [2, 912, 12, 12]           1,824
            SiLU-377           [2, 912, 12, 12]               0
        CNNBlock-378           [2, 912, 12, 12]               0
AdaptiveAvgPool2d-379             [2, 912, 1, 1]               0
          Conv2d-380              [2, 38, 1, 1]          34,694
            SiLU-381              [2, 38, 1, 1]               0
          Conv2d-382             [2, 912, 1, 1]          35,568
         Sigmoid-383             [2, 912, 1, 1]               0
SqueezeExcitation-384           [2, 912, 12, 12]               0
          Conv2d-385           [2, 256, 12, 12]         233,472
     BatchNorm2d-386           [2, 256, 12, 12]             512
InvertedResidualBlock-387           [2, 256, 12, 12]               0
          Conv2d-388          [2, 1536, 12, 12]       3,538,944
     BatchNorm2d-389          [2, 1536, 12, 12]           3,072
            SiLU-390          [2, 1536, 12, 12]               0
        CNNBlock-391          [2, 1536, 12, 12]               0
          Conv2d-392          [2, 1536, 12, 12]          38,400
     BatchNorm2d-393          [2, 1536, 12, 12]           3,072
            SiLU-394          [2, 1536, 12, 12]               0
        CNNBlock-395          [2, 1536, 12, 12]               0
AdaptiveAvgPool2d-396            [2, 1536, 1, 1]               0
          Conv2d-397              [2, 64, 1, 1]          98,368
            SiLU-398              [2, 64, 1, 1]               0
          Conv2d-399            [2, 1536, 1, 1]          99,840
         Sigmoid-400            [2, 1536, 1, 1]               0
SqueezeExcitation-401          [2, 1536, 12, 12]               0
          Conv2d-402           [2, 256, 12, 12]         393,216
     BatchNorm2d-403           [2, 256, 12, 12]             512
InvertedResidualBlock-404           [2, 256, 12, 12]               0
          Conv2d-405          [2, 1536, 12, 12]       3,538,944
     BatchNorm2d-406          [2, 1536, 12, 12]           3,072
            SiLU-407          [2, 1536, 12, 12]               0
        CNNBlock-408          [2, 1536, 12, 12]               0
          Conv2d-409          [2, 1536, 12, 12]          38,400
     BatchNorm2d-410          [2, 1536, 12, 12]           3,072
            SiLU-411          [2, 1536, 12, 12]               0
        CNNBlock-412          [2, 1536, 12, 12]               0
AdaptiveAvgPool2d-413            [2, 1536, 1, 1]               0
          Conv2d-414              [2, 64, 1, 1]          98,368
            SiLU-415              [2, 64, 1, 1]               0
          Conv2d-416            [2, 1536, 1, 1]          99,840
         Sigmoid-417            [2, 1536, 1, 1]               0
SqueezeExcitation-418          [2, 1536, 12, 12]               0
          Conv2d-419           [2, 256, 12, 12]         393,216
     BatchNorm2d-420           [2, 256, 12, 12]             512
InvertedResidualBlock-421           [2, 256, 12, 12]               0
          Conv2d-422          [2, 1536, 12, 12]       3,538,944
     BatchNorm2d-423          [2, 1536, 12, 12]           3,072
            SiLU-424          [2, 1536, 12, 12]               0
        CNNBlock-425          [2, 1536, 12, 12]               0
          Conv2d-426          [2, 1536, 12, 12]          38,400
     BatchNorm2d-427          [2, 1536, 12, 12]           3,072
            SiLU-428          [2, 1536, 12, 12]               0
        CNNBlock-429          [2, 1536, 12, 12]               0
AdaptiveAvgPool2d-430            [2, 1536, 1, 1]               0
          Conv2d-431              [2, 64, 1, 1]          98,368
            SiLU-432              [2, 64, 1, 1]               0
          Conv2d-433            [2, 1536, 1, 1]          99,840
         Sigmoid-434            [2, 1536, 1, 1]               0
SqueezeExcitation-435          [2, 1536, 12, 12]               0
          Conv2d-436           [2, 256, 12, 12]         393,216
     BatchNorm2d-437           [2, 256, 12, 12]             512
InvertedResidualBlock-438           [2, 256, 12, 12]               0
          Conv2d-439          [2, 1536, 12, 12]       3,538,944
     BatchNorm2d-440          [2, 1536, 12, 12]           3,072
            SiLU-441          [2, 1536, 12, 12]               0
        CNNBlock-442          [2, 1536, 12, 12]               0
          Conv2d-443          [2, 1536, 12, 12]          38,400
     BatchNorm2d-444          [2, 1536, 12, 12]           3,072
            SiLU-445          [2, 1536, 12, 12]               0
        CNNBlock-446          [2, 1536, 12, 12]               0
AdaptiveAvgPool2d-447            [2, 1536, 1, 1]               0
          Conv2d-448              [2, 64, 1, 1]          98,368
            SiLU-449              [2, 64, 1, 1]               0
          Conv2d-450            [2, 1536, 1, 1]          99,840
         Sigmoid-451            [2, 1536, 1, 1]               0
SqueezeExcitation-452          [2, 1536, 12, 12]               0
          Conv2d-453           [2, 256, 12, 12]         393,216
     BatchNorm2d-454           [2, 256, 12, 12]             512
InvertedResidualBlock-455           [2, 256, 12, 12]               0
          Conv2d-456          [2, 1536, 12, 12]       3,538,944
     BatchNorm2d-457          [2, 1536, 12, 12]           3,072
            SiLU-458          [2, 1536, 12, 12]               0
        CNNBlock-459          [2, 1536, 12, 12]               0
          Conv2d-460          [2, 1536, 12, 12]          38,400
     BatchNorm2d-461          [2, 1536, 12, 12]           3,072
            SiLU-462          [2, 1536, 12, 12]               0
        CNNBlock-463          [2, 1536, 12, 12]               0
AdaptiveAvgPool2d-464            [2, 1536, 1, 1]               0
          Conv2d-465              [2, 64, 1, 1]          98,368
            SiLU-466              [2, 64, 1, 1]               0
          Conv2d-467            [2, 1536, 1, 1]          99,840
         Sigmoid-468            [2, 1536, 1, 1]               0
SqueezeExcitation-469          [2, 1536, 12, 12]               0
          Conv2d-470           [2, 256, 12, 12]         393,216
     BatchNorm2d-471           [2, 256, 12, 12]             512
InvertedResidualBlock-472           [2, 256, 12, 12]               0
          Conv2d-473          [2, 1536, 12, 12]       3,538,944
     BatchNorm2d-474          [2, 1536, 12, 12]           3,072
            SiLU-475          [2, 1536, 12, 12]               0
        CNNBlock-476          [2, 1536, 12, 12]               0
          Conv2d-477          [2, 1536, 12, 12]          38,400
     BatchNorm2d-478          [2, 1536, 12, 12]           3,072
            SiLU-479          [2, 1536, 12, 12]               0
        CNNBlock-480          [2, 1536, 12, 12]               0
AdaptiveAvgPool2d-481            [2, 1536, 1, 1]               0
          Conv2d-482              [2, 64, 1, 1]          98,368
            SiLU-483              [2, 64, 1, 1]               0
          Conv2d-484            [2, 1536, 1, 1]          99,840
         Sigmoid-485            [2, 1536, 1, 1]               0
SqueezeExcitation-486          [2, 1536, 12, 12]               0
          Conv2d-487           [2, 256, 12, 12]         393,216
     BatchNorm2d-488           [2, 256, 12, 12]             512
InvertedResidualBlock-489           [2, 256, 12, 12]               0
          Conv2d-490          [2, 1536, 12, 12]       3,538,944
     BatchNorm2d-491          [2, 1536, 12, 12]           3,072
            SiLU-492          [2, 1536, 12, 12]               0
        CNNBlock-493          [2, 1536, 12, 12]               0
          Conv2d-494          [2, 1536, 12, 12]          13,824
     BatchNorm2d-495          [2, 1536, 12, 12]           3,072
            SiLU-496          [2, 1536, 12, 12]               0
        CNNBlock-497          [2, 1536, 12, 12]               0
AdaptiveAvgPool2d-498            [2, 1536, 1, 1]               0
          Conv2d-499              [2, 64, 1, 1]          98,368
            SiLU-500              [2, 64, 1, 1]               0
          Conv2d-501            [2, 1536, 1, 1]          99,840
         Sigmoid-502            [2, 1536, 1, 1]               0
SqueezeExcitation-503          [2, 1536, 12, 12]               0
          Conv2d-504           [2, 428, 12, 12]         657,408
     BatchNorm2d-505           [2, 428, 12, 12]             856
InvertedResidualBlock-506           [2, 428, 12, 12]               0
          Conv2d-507          [2, 2568, 12, 12]       9,891,936
     BatchNorm2d-508          [2, 2568, 12, 12]           5,136
            SiLU-509          [2, 2568, 12, 12]               0
        CNNBlock-510          [2, 2568, 12, 12]               0
          Conv2d-511          [2, 2568, 12, 12]          23,112
     BatchNorm2d-512          [2, 2568, 12, 12]           5,136
            SiLU-513          [2, 2568, 12, 12]               0
        CNNBlock-514          [2, 2568, 12, 12]               0
AdaptiveAvgPool2d-515            [2, 2568, 1, 1]               0
          Conv2d-516             [2, 107, 1, 1]         274,883
            SiLU-517             [2, 107, 1, 1]               0
          Conv2d-518            [2, 2568, 1, 1]         277,344
         Sigmoid-519            [2, 2568, 1, 1]               0
SqueezeExcitation-520          [2, 2568, 12, 12]               0
          Conv2d-521           [2, 428, 12, 12]       1,099,104
     BatchNorm2d-522           [2, 428, 12, 12]             856
InvertedResidualBlock-523           [2, 428, 12, 12]               0
          Conv2d-524          [2, 1704, 12, 12]         729,312
     BatchNorm2d-525          [2, 1704, 12, 12]           3,408
            SiLU-526          [2, 1704, 12, 12]               0
        CNNBlock-527          [2, 1704, 12, 12]               0
AdaptiveAvgPool2d-528            [2, 1704, 1, 1]               0
         Flatten-529                  [2, 1704]               0
         Dropout-530                  [2, 1704]               0
          Linear-531                     [2, 2]           3,410
    EfficientNet-532                     [2, 2]               0
================================================================
Total params: 56,444,467
Trainable params: 56,444,467
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.31
Forward/backward pass size (MB): 3129.50
Params size (MB): 215.32
Estimated Total Size (MB): 3348.12
----------------------------------------------------------------

