EfficientNetB3----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [2, 38, 150, 150]           1,026
       BatchNorm2d-2          [2, 38, 150, 150]              76
              SiLU-3          [2, 38, 150, 150]               0
          CNNBlock-4          [2, 38, 150, 150]               0
            Conv2d-5          [2, 38, 150, 150]             342
       BatchNorm2d-6          [2, 38, 150, 150]              76
              SiLU-7          [2, 38, 150, 150]               0
          CNNBlock-8          [2, 38, 150, 150]               0
 AdaptiveAvgPool2d-9              [2, 38, 1, 1]               0
           Conv2d-10               [2, 9, 1, 1]             351
             SiLU-11               [2, 9, 1, 1]               0
           Conv2d-12              [2, 38, 1, 1]             380
          Sigmoid-13              [2, 38, 1, 1]               0
SqueezeExcitation-14          [2, 38, 150, 150]               0
           Conv2d-15          [2, 20, 150, 150]             760
      BatchNorm2d-16          [2, 20, 150, 150]              40
InvertedResidualBlock-17          [2, 20, 150, 150]               0
           Conv2d-18          [2, 20, 150, 150]             180
      BatchNorm2d-19          [2, 20, 150, 150]              40
             SiLU-20          [2, 20, 150, 150]               0
         CNNBlock-21          [2, 20, 150, 150]               0
AdaptiveAvgPool2d-22              [2, 20, 1, 1]               0
           Conv2d-23               [2, 5, 1, 1]             105
             SiLU-24               [2, 5, 1, 1]               0
           Conv2d-25              [2, 20, 1, 1]             120
          Sigmoid-26              [2, 20, 1, 1]               0
SqueezeExcitation-27          [2, 20, 150, 150]               0
           Conv2d-28          [2, 20, 150, 150]             400
      BatchNorm2d-29          [2, 20, 150, 150]              40
InvertedResidualBlock-30          [2, 20, 150, 150]               0
           Conv2d-31         [2, 120, 150, 150]          21,600
      BatchNorm2d-32         [2, 120, 150, 150]             240
             SiLU-33         [2, 120, 150, 150]               0
         CNNBlock-34         [2, 120, 150, 150]               0
           Conv2d-35           [2, 120, 75, 75]           1,080
      BatchNorm2d-36           [2, 120, 75, 75]             240
             SiLU-37           [2, 120, 75, 75]               0
         CNNBlock-38           [2, 120, 75, 75]               0
AdaptiveAvgPool2d-39             [2, 120, 1, 1]               0
           Conv2d-40               [2, 5, 1, 1]             605
             SiLU-41               [2, 5, 1, 1]               0
           Conv2d-42             [2, 120, 1, 1]             720
          Sigmoid-43             [2, 120, 1, 1]               0
SqueezeExcitation-44           [2, 120, 75, 75]               0
           Conv2d-45            [2, 32, 75, 75]           3,840
      BatchNorm2d-46            [2, 32, 75, 75]              64
InvertedResidualBlock-47            [2, 32, 75, 75]               0
           Conv2d-48           [2, 192, 75, 75]          55,296
      BatchNorm2d-49           [2, 192, 75, 75]             384
             SiLU-50           [2, 192, 75, 75]               0
         CNNBlock-51           [2, 192, 75, 75]               0
           Conv2d-52           [2, 192, 75, 75]           1,728
      BatchNorm2d-53           [2, 192, 75, 75]             384
             SiLU-54           [2, 192, 75, 75]               0
         CNNBlock-55           [2, 192, 75, 75]               0
AdaptiveAvgPool2d-56             [2, 192, 1, 1]               0
           Conv2d-57               [2, 8, 1, 1]           1,544
             SiLU-58               [2, 8, 1, 1]               0
           Conv2d-59             [2, 192, 1, 1]           1,728
          Sigmoid-60             [2, 192, 1, 1]               0
SqueezeExcitation-61           [2, 192, 75, 75]               0
           Conv2d-62            [2, 32, 75, 75]           6,144
      BatchNorm2d-63            [2, 32, 75, 75]              64
InvertedResidualBlock-64            [2, 32, 75, 75]               0
           Conv2d-65           [2, 192, 75, 75]          55,296
      BatchNorm2d-66           [2, 192, 75, 75]             384
             SiLU-67           [2, 192, 75, 75]               0
         CNNBlock-68           [2, 192, 75, 75]               0
           Conv2d-69           [2, 192, 75, 75]           1,728
      BatchNorm2d-70           [2, 192, 75, 75]             384
             SiLU-71           [2, 192, 75, 75]               0
         CNNBlock-72           [2, 192, 75, 75]               0
AdaptiveAvgPool2d-73             [2, 192, 1, 1]               0
           Conv2d-74               [2, 8, 1, 1]           1,544
             SiLU-75               [2, 8, 1, 1]               0
           Conv2d-76             [2, 192, 1, 1]           1,728
          Sigmoid-77             [2, 192, 1, 1]               0
SqueezeExcitation-78           [2, 192, 75, 75]               0
           Conv2d-79            [2, 32, 75, 75]           6,144
      BatchNorm2d-80            [2, 32, 75, 75]              64
InvertedResidualBlock-81            [2, 32, 75, 75]               0
           Conv2d-82           [2, 192, 75, 75]          55,296
      BatchNorm2d-83           [2, 192, 75, 75]             384
             SiLU-84           [2, 192, 75, 75]               0
         CNNBlock-85           [2, 192, 75, 75]               0
           Conv2d-86           [2, 192, 38, 38]           4,800
      BatchNorm2d-87           [2, 192, 38, 38]             384
             SiLU-88           [2, 192, 38, 38]               0
         CNNBlock-89           [2, 192, 38, 38]               0
AdaptiveAvgPool2d-90             [2, 192, 1, 1]               0
           Conv2d-91               [2, 8, 1, 1]           1,544
             SiLU-92               [2, 8, 1, 1]               0
           Conv2d-93             [2, 192, 1, 1]           1,728
          Sigmoid-94             [2, 192, 1, 1]               0
SqueezeExcitation-95           [2, 192, 38, 38]               0
           Conv2d-96            [2, 48, 38, 38]           9,216
      BatchNorm2d-97            [2, 48, 38, 38]              96
InvertedResidualBlock-98            [2, 48, 38, 38]               0
           Conv2d-99           [2, 288, 38, 38]         124,416
     BatchNorm2d-100           [2, 288, 38, 38]             576
            SiLU-101           [2, 288, 38, 38]               0
        CNNBlock-102           [2, 288, 38, 38]               0
          Conv2d-103           [2, 288, 38, 38]           7,200
     BatchNorm2d-104           [2, 288, 38, 38]             576
            SiLU-105           [2, 288, 38, 38]               0
        CNNBlock-106           [2, 288, 38, 38]               0
AdaptiveAvgPool2d-107             [2, 288, 1, 1]               0
          Conv2d-108              [2, 12, 1, 1]           3,468
            SiLU-109              [2, 12, 1, 1]               0
          Conv2d-110             [2, 288, 1, 1]           3,744
         Sigmoid-111             [2, 288, 1, 1]               0
SqueezeExcitation-112           [2, 288, 38, 38]               0
          Conv2d-113            [2, 48, 38, 38]          13,824
     BatchNorm2d-114            [2, 48, 38, 38]              96
InvertedResidualBlock-115            [2, 48, 38, 38]               0
          Conv2d-116           [2, 288, 38, 38]         124,416
     BatchNorm2d-117           [2, 288, 38, 38]             576
            SiLU-118           [2, 288, 38, 38]               0
        CNNBlock-119           [2, 288, 38, 38]               0
          Conv2d-120           [2, 288, 38, 38]           7,200
     BatchNorm2d-121           [2, 288, 38, 38]             576
            SiLU-122           [2, 288, 38, 38]               0
        CNNBlock-123           [2, 288, 38, 38]               0
AdaptiveAvgPool2d-124             [2, 288, 1, 1]               0
          Conv2d-125              [2, 12, 1, 1]           3,468
            SiLU-126              [2, 12, 1, 1]               0
          Conv2d-127             [2, 288, 1, 1]           3,744
         Sigmoid-128             [2, 288, 1, 1]               0
SqueezeExcitation-129           [2, 288, 38, 38]               0
          Conv2d-130            [2, 48, 38, 38]          13,824
     BatchNorm2d-131            [2, 48, 38, 38]              96
InvertedResidualBlock-132            [2, 48, 38, 38]               0
          Conv2d-133           [2, 288, 38, 38]         124,416
     BatchNorm2d-134           [2, 288, 38, 38]             576
            SiLU-135           [2, 288, 38, 38]               0
        CNNBlock-136           [2, 288, 38, 38]               0
          Conv2d-137           [2, 288, 19, 19]           2,592
     BatchNorm2d-138           [2, 288, 19, 19]             576
            SiLU-139           [2, 288, 19, 19]               0
        CNNBlock-140           [2, 288, 19, 19]               0
AdaptiveAvgPool2d-141             [2, 288, 1, 1]               0
          Conv2d-142              [2, 12, 1, 1]           3,468
            SiLU-143              [2, 12, 1, 1]               0
          Conv2d-144             [2, 288, 1, 1]           3,744
         Sigmoid-145             [2, 288, 1, 1]               0
SqueezeExcitation-146           [2, 288, 19, 19]               0
          Conv2d-147            [2, 96, 19, 19]          27,648
     BatchNorm2d-148            [2, 96, 19, 19]             192
InvertedResidualBlock-149            [2, 96, 19, 19]               0
          Conv2d-150           [2, 576, 19, 19]         497,664
     BatchNorm2d-151           [2, 576, 19, 19]           1,152
            SiLU-152           [2, 576, 19, 19]               0
        CNNBlock-153           [2, 576, 19, 19]               0
          Conv2d-154           [2, 576, 19, 19]           5,184
     BatchNorm2d-155           [2, 576, 19, 19]           1,152
            SiLU-156           [2, 576, 19, 19]               0
        CNNBlock-157           [2, 576, 19, 19]               0
AdaptiveAvgPool2d-158             [2, 576, 1, 1]               0
          Conv2d-159              [2, 24, 1, 1]          13,848
            SiLU-160              [2, 24, 1, 1]               0
          Conv2d-161             [2, 576, 1, 1]          14,400
         Sigmoid-162             [2, 576, 1, 1]               0
SqueezeExcitation-163           [2, 576, 19, 19]               0
          Conv2d-164            [2, 96, 19, 19]          55,296
     BatchNorm2d-165            [2, 96, 19, 19]             192
InvertedResidualBlock-166            [2, 96, 19, 19]               0
          Conv2d-167           [2, 576, 19, 19]         497,664
     BatchNorm2d-168           [2, 576, 19, 19]           1,152
            SiLU-169           [2, 576, 19, 19]               0
        CNNBlock-170           [2, 576, 19, 19]               0
          Conv2d-171           [2, 576, 19, 19]           5,184
     BatchNorm2d-172           [2, 576, 19, 19]           1,152
            SiLU-173           [2, 576, 19, 19]               0
        CNNBlock-174           [2, 576, 19, 19]               0
AdaptiveAvgPool2d-175             [2, 576, 1, 1]               0
          Conv2d-176              [2, 24, 1, 1]          13,848
            SiLU-177              [2, 24, 1, 1]               0
          Conv2d-178             [2, 576, 1, 1]          14,400
         Sigmoid-179             [2, 576, 1, 1]               0
SqueezeExcitation-180           [2, 576, 19, 19]               0
          Conv2d-181            [2, 96, 19, 19]          55,296
     BatchNorm2d-182            [2, 96, 19, 19]             192
InvertedResidualBlock-183            [2, 96, 19, 19]               0
          Conv2d-184           [2, 576, 19, 19]         497,664
     BatchNorm2d-185           [2, 576, 19, 19]           1,152
            SiLU-186           [2, 576, 19, 19]               0
        CNNBlock-187           [2, 576, 19, 19]               0
          Conv2d-188           [2, 576, 19, 19]           5,184
     BatchNorm2d-189           [2, 576, 19, 19]           1,152
            SiLU-190           [2, 576, 19, 19]               0
        CNNBlock-191           [2, 576, 19, 19]               0
AdaptiveAvgPool2d-192             [2, 576, 1, 1]               0
          Conv2d-193              [2, 24, 1, 1]          13,848
            SiLU-194              [2, 24, 1, 1]               0
          Conv2d-195             [2, 576, 1, 1]          14,400
         Sigmoid-196             [2, 576, 1, 1]               0
SqueezeExcitation-197           [2, 576, 19, 19]               0
          Conv2d-198            [2, 96, 19, 19]          55,296
     BatchNorm2d-199            [2, 96, 19, 19]             192
InvertedResidualBlock-200            [2, 96, 19, 19]               0
          Conv2d-201           [2, 576, 19, 19]         497,664
     BatchNorm2d-202           [2, 576, 19, 19]           1,152
            SiLU-203           [2, 576, 19, 19]               0
        CNNBlock-204           [2, 576, 19, 19]               0
          Conv2d-205           [2, 576, 19, 19]           5,184
     BatchNorm2d-206           [2, 576, 19, 19]           1,152
            SiLU-207           [2, 576, 19, 19]               0
        CNNBlock-208           [2, 576, 19, 19]               0
AdaptiveAvgPool2d-209             [2, 576, 1, 1]               0
          Conv2d-210              [2, 24, 1, 1]          13,848
            SiLU-211              [2, 24, 1, 1]               0
          Conv2d-212             [2, 576, 1, 1]          14,400
         Sigmoid-213             [2, 576, 1, 1]               0
SqueezeExcitation-214           [2, 576, 19, 19]               0
          Conv2d-215            [2, 96, 19, 19]          55,296
     BatchNorm2d-216            [2, 96, 19, 19]             192
InvertedResidualBlock-217            [2, 96, 19, 19]               0
          Conv2d-218           [2, 576, 19, 19]         497,664
     BatchNorm2d-219           [2, 576, 19, 19]           1,152
            SiLU-220           [2, 576, 19, 19]               0
        CNNBlock-221           [2, 576, 19, 19]               0
          Conv2d-222           [2, 576, 19, 19]          14,400
     BatchNorm2d-223           [2, 576, 19, 19]           1,152
            SiLU-224           [2, 576, 19, 19]               0
        CNNBlock-225           [2, 576, 19, 19]               0
AdaptiveAvgPool2d-226             [2, 576, 1, 1]               0
          Conv2d-227              [2, 24, 1, 1]          13,848
            SiLU-228              [2, 24, 1, 1]               0
          Conv2d-229             [2, 576, 1, 1]          14,400
         Sigmoid-230             [2, 576, 1, 1]               0
SqueezeExcitation-231           [2, 576, 19, 19]               0
          Conv2d-232           [2, 136, 19, 19]          78,336
     BatchNorm2d-233           [2, 136, 19, 19]             272
InvertedResidualBlock-234           [2, 136, 19, 19]               0
          Conv2d-235           [2, 816, 19, 19]         998,784
     BatchNorm2d-236           [2, 816, 19, 19]           1,632
            SiLU-237           [2, 816, 19, 19]               0
        CNNBlock-238           [2, 816, 19, 19]               0
          Conv2d-239           [2, 816, 19, 19]          20,400
     BatchNorm2d-240           [2, 816, 19, 19]           1,632
            SiLU-241           [2, 816, 19, 19]               0
        CNNBlock-242           [2, 816, 19, 19]               0
AdaptiveAvgPool2d-243             [2, 816, 1, 1]               0
          Conv2d-244              [2, 34, 1, 1]          27,778
            SiLU-245              [2, 34, 1, 1]               0
          Conv2d-246             [2, 816, 1, 1]          28,560
         Sigmoid-247             [2, 816, 1, 1]               0
SqueezeExcitation-248           [2, 816, 19, 19]               0
          Conv2d-249           [2, 136, 19, 19]         110,976
     BatchNorm2d-250           [2, 136, 19, 19]             272
InvertedResidualBlock-251           [2, 136, 19, 19]               0
          Conv2d-252           [2, 816, 19, 19]         998,784
     BatchNorm2d-253           [2, 816, 19, 19]           1,632
            SiLU-254           [2, 816, 19, 19]               0
        CNNBlock-255           [2, 816, 19, 19]               0
          Conv2d-256           [2, 816, 19, 19]          20,400
     BatchNorm2d-257           [2, 816, 19, 19]           1,632
            SiLU-258           [2, 816, 19, 19]               0
        CNNBlock-259           [2, 816, 19, 19]               0
AdaptiveAvgPool2d-260             [2, 816, 1, 1]               0
          Conv2d-261              [2, 34, 1, 1]          27,778
            SiLU-262              [2, 34, 1, 1]               0
          Conv2d-263             [2, 816, 1, 1]          28,560
         Sigmoid-264             [2, 816, 1, 1]               0
SqueezeExcitation-265           [2, 816, 19, 19]               0
          Conv2d-266           [2, 136, 19, 19]         110,976
     BatchNorm2d-267           [2, 136, 19, 19]             272
InvertedResidualBlock-268           [2, 136, 19, 19]               0
          Conv2d-269           [2, 816, 19, 19]         998,784
     BatchNorm2d-270           [2, 816, 19, 19]           1,632
            SiLU-271           [2, 816, 19, 19]               0
        CNNBlock-272           [2, 816, 19, 19]               0
          Conv2d-273           [2, 816, 19, 19]          20,400
     BatchNorm2d-274           [2, 816, 19, 19]           1,632
            SiLU-275           [2, 816, 19, 19]               0
        CNNBlock-276           [2, 816, 19, 19]               0
AdaptiveAvgPool2d-277             [2, 816, 1, 1]               0
          Conv2d-278              [2, 34, 1, 1]          27,778
            SiLU-279              [2, 34, 1, 1]               0
          Conv2d-280             [2, 816, 1, 1]          28,560
         Sigmoid-281             [2, 816, 1, 1]               0
SqueezeExcitation-282           [2, 816, 19, 19]               0
          Conv2d-283           [2, 136, 19, 19]         110,976
     BatchNorm2d-284           [2, 136, 19, 19]             272
InvertedResidualBlock-285           [2, 136, 19, 19]               0
          Conv2d-286           [2, 816, 19, 19]         998,784
     BatchNorm2d-287           [2, 816, 19, 19]           1,632
            SiLU-288           [2, 816, 19, 19]               0
        CNNBlock-289           [2, 816, 19, 19]               0
          Conv2d-290           [2, 816, 19, 19]          20,400
     BatchNorm2d-291           [2, 816, 19, 19]           1,632
            SiLU-292           [2, 816, 19, 19]               0
        CNNBlock-293           [2, 816, 19, 19]               0
AdaptiveAvgPool2d-294             [2, 816, 1, 1]               0
          Conv2d-295              [2, 34, 1, 1]          27,778
            SiLU-296              [2, 34, 1, 1]               0
          Conv2d-297             [2, 816, 1, 1]          28,560
         Sigmoid-298             [2, 816, 1, 1]               0
SqueezeExcitation-299           [2, 816, 19, 19]               0
          Conv2d-300           [2, 136, 19, 19]         110,976
     BatchNorm2d-301           [2, 136, 19, 19]             272
InvertedResidualBlock-302           [2, 136, 19, 19]               0
          Conv2d-303           [2, 816, 19, 19]         998,784
     BatchNorm2d-304           [2, 816, 19, 19]           1,632
            SiLU-305           [2, 816, 19, 19]               0
        CNNBlock-306           [2, 816, 19, 19]               0
          Conv2d-307           [2, 816, 10, 10]          20,400
     BatchNorm2d-308           [2, 816, 10, 10]           1,632
            SiLU-309           [2, 816, 10, 10]               0
        CNNBlock-310           [2, 816, 10, 10]               0
AdaptiveAvgPool2d-311             [2, 816, 1, 1]               0
          Conv2d-312              [2, 34, 1, 1]          27,778
            SiLU-313              [2, 34, 1, 1]               0
          Conv2d-314             [2, 816, 1, 1]          28,560
         Sigmoid-315             [2, 816, 1, 1]               0
SqueezeExcitation-316           [2, 816, 10, 10]               0
          Conv2d-317           [2, 232, 10, 10]         189,312
     BatchNorm2d-318           [2, 232, 10, 10]             464
InvertedResidualBlock-319           [2, 232, 10, 10]               0
          Conv2d-320          [2, 1392, 10, 10]       2,906,496
     BatchNorm2d-321          [2, 1392, 10, 10]           2,784
            SiLU-322          [2, 1392, 10, 10]               0
        CNNBlock-323          [2, 1392, 10, 10]               0
          Conv2d-324          [2, 1392, 10, 10]          34,800
     BatchNorm2d-325          [2, 1392, 10, 10]           2,784
            SiLU-326          [2, 1392, 10, 10]               0
        CNNBlock-327          [2, 1392, 10, 10]               0
AdaptiveAvgPool2d-328            [2, 1392, 1, 1]               0
          Conv2d-329              [2, 58, 1, 1]          80,794
            SiLU-330              [2, 58, 1, 1]               0
          Conv2d-331            [2, 1392, 1, 1]          82,128
         Sigmoid-332            [2, 1392, 1, 1]               0
SqueezeExcitation-333          [2, 1392, 10, 10]               0
          Conv2d-334           [2, 232, 10, 10]         322,944
     BatchNorm2d-335           [2, 232, 10, 10]             464
InvertedResidualBlock-336           [2, 232, 10, 10]               0
          Conv2d-337          [2, 1392, 10, 10]       2,906,496
     BatchNorm2d-338          [2, 1392, 10, 10]           2,784
            SiLU-339          [2, 1392, 10, 10]               0
        CNNBlock-340          [2, 1392, 10, 10]               0
          Conv2d-341          [2, 1392, 10, 10]          34,800
     BatchNorm2d-342          [2, 1392, 10, 10]           2,784
            SiLU-343          [2, 1392, 10, 10]               0
        CNNBlock-344          [2, 1392, 10, 10]               0
AdaptiveAvgPool2d-345            [2, 1392, 1, 1]               0
          Conv2d-346              [2, 58, 1, 1]          80,794
            SiLU-347              [2, 58, 1, 1]               0
          Conv2d-348            [2, 1392, 1, 1]          82,128
         Sigmoid-349            [2, 1392, 1, 1]               0
SqueezeExcitation-350          [2, 1392, 10, 10]               0
          Conv2d-351           [2, 232, 10, 10]         322,944
     BatchNorm2d-352           [2, 232, 10, 10]             464
InvertedResidualBlock-353           [2, 232, 10, 10]               0
          Conv2d-354          [2, 1392, 10, 10]       2,906,496
     BatchNorm2d-355          [2, 1392, 10, 10]           2,784
            SiLU-356          [2, 1392, 10, 10]               0
        CNNBlock-357          [2, 1392, 10, 10]               0
          Conv2d-358          [2, 1392, 10, 10]          34,800
     BatchNorm2d-359          [2, 1392, 10, 10]           2,784
            SiLU-360          [2, 1392, 10, 10]               0
        CNNBlock-361          [2, 1392, 10, 10]               0
AdaptiveAvgPool2d-362            [2, 1392, 1, 1]               0
          Conv2d-363              [2, 58, 1, 1]          80,794
            SiLU-364              [2, 58, 1, 1]               0
          Conv2d-365            [2, 1392, 1, 1]          82,128
         Sigmoid-366            [2, 1392, 1, 1]               0
SqueezeExcitation-367          [2, 1392, 10, 10]               0
          Conv2d-368           [2, 232, 10, 10]         322,944
     BatchNorm2d-369           [2, 232, 10, 10]             464
InvertedResidualBlock-370           [2, 232, 10, 10]               0
          Conv2d-371          [2, 1392, 10, 10]       2,906,496
     BatchNorm2d-372          [2, 1392, 10, 10]           2,784
            SiLU-373          [2, 1392, 10, 10]               0
        CNNBlock-374          [2, 1392, 10, 10]               0
          Conv2d-375          [2, 1392, 10, 10]          34,800
     BatchNorm2d-376          [2, 1392, 10, 10]           2,784
            SiLU-377          [2, 1392, 10, 10]               0
        CNNBlock-378          [2, 1392, 10, 10]               0
AdaptiveAvgPool2d-379            [2, 1392, 1, 1]               0
          Conv2d-380              [2, 58, 1, 1]          80,794
            SiLU-381              [2, 58, 1, 1]               0
          Conv2d-382            [2, 1392, 1, 1]          82,128
         Sigmoid-383            [2, 1392, 1, 1]               0
SqueezeExcitation-384          [2, 1392, 10, 10]               0
          Conv2d-385           [2, 232, 10, 10]         322,944
     BatchNorm2d-386           [2, 232, 10, 10]             464
InvertedResidualBlock-387           [2, 232, 10, 10]               0
          Conv2d-388          [2, 1392, 10, 10]       2,906,496
     BatchNorm2d-389          [2, 1392, 10, 10]           2,784
            SiLU-390          [2, 1392, 10, 10]               0
        CNNBlock-391          [2, 1392, 10, 10]               0
          Conv2d-392          [2, 1392, 10, 10]          34,800
     BatchNorm2d-393          [2, 1392, 10, 10]           2,784
            SiLU-394          [2, 1392, 10, 10]               0
        CNNBlock-395          [2, 1392, 10, 10]               0
AdaptiveAvgPool2d-396            [2, 1392, 1, 1]               0
          Conv2d-397              [2, 58, 1, 1]          80,794
            SiLU-398              [2, 58, 1, 1]               0
          Conv2d-399            [2, 1392, 1, 1]          82,128
         Sigmoid-400            [2, 1392, 1, 1]               0
SqueezeExcitation-401          [2, 1392, 10, 10]               0
          Conv2d-402           [2, 232, 10, 10]         322,944
     BatchNorm2d-403           [2, 232, 10, 10]             464
InvertedResidualBlock-404           [2, 232, 10, 10]               0
          Conv2d-405          [2, 1392, 10, 10]       2,906,496
     BatchNorm2d-406          [2, 1392, 10, 10]           2,784
            SiLU-407          [2, 1392, 10, 10]               0
        CNNBlock-408          [2, 1392, 10, 10]               0
          Conv2d-409          [2, 1392, 10, 10]          12,528
     BatchNorm2d-410          [2, 1392, 10, 10]           2,784
            SiLU-411          [2, 1392, 10, 10]               0
        CNNBlock-412          [2, 1392, 10, 10]               0
AdaptiveAvgPool2d-413            [2, 1392, 1, 1]               0
          Conv2d-414              [2, 58, 1, 1]          80,794
            SiLU-415              [2, 58, 1, 1]               0
          Conv2d-416            [2, 1392, 1, 1]          82,128
         Sigmoid-417            [2, 1392, 1, 1]               0
SqueezeExcitation-418          [2, 1392, 10, 10]               0
          Conv2d-419           [2, 388, 10, 10]         540,096
     BatchNorm2d-420           [2, 388, 10, 10]             776
InvertedResidualBlock-421           [2, 388, 10, 10]               0
          Conv2d-422          [2, 2328, 10, 10]       8,129,376
     BatchNorm2d-423          [2, 2328, 10, 10]           4,656
            SiLU-424          [2, 2328, 10, 10]               0
        CNNBlock-425          [2, 2328, 10, 10]               0
          Conv2d-426          [2, 2328, 10, 10]          20,952
     BatchNorm2d-427          [2, 2328, 10, 10]           4,656
            SiLU-428          [2, 2328, 10, 10]               0
        CNNBlock-429          [2, 2328, 10, 10]               0
AdaptiveAvgPool2d-430            [2, 2328, 1, 1]               0
          Conv2d-431              [2, 97, 1, 1]         225,913
            SiLU-432              [2, 97, 1, 1]               0
          Conv2d-433            [2, 2328, 1, 1]         228,144
         Sigmoid-434            [2, 2328, 1, 1]               0
SqueezeExcitation-435          [2, 2328, 10, 10]               0
          Conv2d-436           [2, 388, 10, 10]         903,264
     BatchNorm2d-437           [2, 388, 10, 10]             776
InvertedResidualBlock-438           [2, 388, 10, 10]               0
          Conv2d-439          [2, 1549, 10, 10]         601,012
     BatchNorm2d-440          [2, 1549, 10, 10]           3,098
            SiLU-441          [2, 1549, 10, 10]               0
        CNNBlock-442          [2, 1549, 10, 10]               0
AdaptiveAvgPool2d-443            [2, 1549, 1, 1]               0
         Flatten-444                  [2, 1549]               0
         Dropout-445                  [2, 1549]               0
          Linear-446                     [2, 2]           3,100
    EfficientNet-447                     [2, 2]               0
================================================================
Total params: 40,636,106
Trainable params: 40,636,106
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 2.06
Forward/backward pass size (MB): 1489.71
Params size (MB): 155.01
Estimated Total Size (MB): 1646.78
----------------------------------------------------------------

