EfficientNetB0----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [2, 32, 112, 112]             864
       BatchNorm2d-2          [2, 32, 112, 112]              64
              SiLU-3          [2, 32, 112, 112]               0
          CNNBlock-4          [2, 32, 112, 112]               0
            Conv2d-5          [2, 32, 112, 112]             288
       BatchNorm2d-6          [2, 32, 112, 112]              64
              SiLU-7          [2, 32, 112, 112]               0
          CNNBlock-8          [2, 32, 112, 112]               0
 AdaptiveAvgPool2d-9              [2, 32, 1, 1]               0
           Conv2d-10               [2, 8, 1, 1]             264
             SiLU-11               [2, 8, 1, 1]               0
           Conv2d-12              [2, 32, 1, 1]             288
          Sigmoid-13              [2, 32, 1, 1]               0
SqueezeExcitation-14          [2, 32, 112, 112]               0
           Conv2d-15          [2, 16, 112, 112]             512
      BatchNorm2d-16          [2, 16, 112, 112]              32
InvertedResidualBlock-17          [2, 16, 112, 112]               0
           Conv2d-18          [2, 96, 112, 112]          13,824
      BatchNorm2d-19          [2, 96, 112, 112]             192
             SiLU-20          [2, 96, 112, 112]               0
         CNNBlock-21          [2, 96, 112, 112]               0
           Conv2d-22            [2, 96, 56, 56]             864
      BatchNorm2d-23            [2, 96, 56, 56]             192
             SiLU-24            [2, 96, 56, 56]               0
         CNNBlock-25            [2, 96, 56, 56]               0
AdaptiveAvgPool2d-26              [2, 96, 1, 1]               0
           Conv2d-27               [2, 4, 1, 1]             388
             SiLU-28               [2, 4, 1, 1]               0
           Conv2d-29              [2, 96, 1, 1]             480
          Sigmoid-30              [2, 96, 1, 1]               0
SqueezeExcitation-31            [2, 96, 56, 56]               0
           Conv2d-32            [2, 24, 56, 56]           2,304
      BatchNorm2d-33            [2, 24, 56, 56]              48
InvertedResidualBlock-34            [2, 24, 56, 56]               0
           Conv2d-35           [2, 144, 56, 56]          31,104
      BatchNorm2d-36           [2, 144, 56, 56]             288
             SiLU-37           [2, 144, 56, 56]               0
         CNNBlock-38           [2, 144, 56, 56]               0
           Conv2d-39           [2, 144, 56, 56]           1,296
      BatchNorm2d-40           [2, 144, 56, 56]             288
             SiLU-41           [2, 144, 56, 56]               0
         CNNBlock-42           [2, 144, 56, 56]               0
AdaptiveAvgPool2d-43             [2, 144, 1, 1]               0
           Conv2d-44               [2, 6, 1, 1]             870
             SiLU-45               [2, 6, 1, 1]               0
           Conv2d-46             [2, 144, 1, 1]           1,008
          Sigmoid-47             [2, 144, 1, 1]               0
SqueezeExcitation-48           [2, 144, 56, 56]               0
           Conv2d-49            [2, 24, 56, 56]           3,456
      BatchNorm2d-50            [2, 24, 56, 56]              48
InvertedResidualBlock-51            [2, 24, 56, 56]               0
           Conv2d-52           [2, 144, 56, 56]          31,104
      BatchNorm2d-53           [2, 144, 56, 56]             288
             SiLU-54           [2, 144, 56, 56]               0
         CNNBlock-55           [2, 144, 56, 56]               0
           Conv2d-56           [2, 144, 28, 28]           3,600
      BatchNorm2d-57           [2, 144, 28, 28]             288
             SiLU-58           [2, 144, 28, 28]               0
         CNNBlock-59           [2, 144, 28, 28]               0
AdaptiveAvgPool2d-60             [2, 144, 1, 1]               0
           Conv2d-61               [2, 6, 1, 1]             870
             SiLU-62               [2, 6, 1, 1]               0
           Conv2d-63             [2, 144, 1, 1]           1,008
          Sigmoid-64             [2, 144, 1, 1]               0
SqueezeExcitation-65           [2, 144, 28, 28]               0
           Conv2d-66            [2, 40, 28, 28]           5,760
      BatchNorm2d-67            [2, 40, 28, 28]              80
InvertedResidualBlock-68            [2, 40, 28, 28]               0
           Conv2d-69           [2, 240, 28, 28]          86,400
      BatchNorm2d-70           [2, 240, 28, 28]             480
             SiLU-71           [2, 240, 28, 28]               0
         CNNBlock-72           [2, 240, 28, 28]               0
           Conv2d-73           [2, 240, 28, 28]           6,000
      BatchNorm2d-74           [2, 240, 28, 28]             480
             SiLU-75           [2, 240, 28, 28]               0
         CNNBlock-76           [2, 240, 28, 28]               0
AdaptiveAvgPool2d-77             [2, 240, 1, 1]               0
           Conv2d-78              [2, 10, 1, 1]           2,410
             SiLU-79              [2, 10, 1, 1]               0
           Conv2d-80             [2, 240, 1, 1]           2,640
          Sigmoid-81             [2, 240, 1, 1]               0
SqueezeExcitation-82           [2, 240, 28, 28]               0
           Conv2d-83            [2, 40, 28, 28]           9,600
      BatchNorm2d-84            [2, 40, 28, 28]              80
InvertedResidualBlock-85            [2, 40, 28, 28]               0
           Conv2d-86           [2, 240, 28, 28]          86,400
      BatchNorm2d-87           [2, 240, 28, 28]             480
             SiLU-88           [2, 240, 28, 28]               0
         CNNBlock-89           [2, 240, 28, 28]               0
           Conv2d-90           [2, 240, 14, 14]           2,160
      BatchNorm2d-91           [2, 240, 14, 14]             480
             SiLU-92           [2, 240, 14, 14]               0
         CNNBlock-93           [2, 240, 14, 14]               0
AdaptiveAvgPool2d-94             [2, 240, 1, 1]               0
           Conv2d-95              [2, 10, 1, 1]           2,410
             SiLU-96              [2, 10, 1, 1]               0
           Conv2d-97             [2, 240, 1, 1]           2,640
          Sigmoid-98             [2, 240, 1, 1]               0
SqueezeExcitation-99           [2, 240, 14, 14]               0
          Conv2d-100            [2, 80, 14, 14]          19,200
     BatchNorm2d-101            [2, 80, 14, 14]             160
InvertedResidualBlock-102            [2, 80, 14, 14]               0
          Conv2d-103           [2, 480, 14, 14]         345,600
     BatchNorm2d-104           [2, 480, 14, 14]             960
            SiLU-105           [2, 480, 14, 14]               0
        CNNBlock-106           [2, 480, 14, 14]               0
          Conv2d-107           [2, 480, 14, 14]           4,320
     BatchNorm2d-108           [2, 480, 14, 14]             960
            SiLU-109           [2, 480, 14, 14]               0
        CNNBlock-110           [2, 480, 14, 14]               0
AdaptiveAvgPool2d-111             [2, 480, 1, 1]               0
          Conv2d-112              [2, 20, 1, 1]           9,620
            SiLU-113              [2, 20, 1, 1]               0
          Conv2d-114             [2, 480, 1, 1]          10,080
         Sigmoid-115             [2, 480, 1, 1]               0
SqueezeExcitation-116           [2, 480, 14, 14]               0
          Conv2d-117            [2, 80, 14, 14]          38,400
     BatchNorm2d-118            [2, 80, 14, 14]             160
InvertedResidualBlock-119            [2, 80, 14, 14]               0
          Conv2d-120           [2, 480, 14, 14]         345,600
     BatchNorm2d-121           [2, 480, 14, 14]             960
            SiLU-122           [2, 480, 14, 14]               0
        CNNBlock-123           [2, 480, 14, 14]               0
          Conv2d-124           [2, 480, 14, 14]           4,320
     BatchNorm2d-125           [2, 480, 14, 14]             960
            SiLU-126           [2, 480, 14, 14]               0
        CNNBlock-127           [2, 480, 14, 14]               0
AdaptiveAvgPool2d-128             [2, 480, 1, 1]               0
          Conv2d-129              [2, 20, 1, 1]           9,620
            SiLU-130              [2, 20, 1, 1]               0
          Conv2d-131             [2, 480, 1, 1]          10,080
         Sigmoid-132             [2, 480, 1, 1]               0
SqueezeExcitation-133           [2, 480, 14, 14]               0
          Conv2d-134            [2, 80, 14, 14]          38,400
     BatchNorm2d-135            [2, 80, 14, 14]             160
InvertedResidualBlock-136            [2, 80, 14, 14]               0
          Conv2d-137           [2, 480, 14, 14]         345,600
     BatchNorm2d-138           [2, 480, 14, 14]             960
            SiLU-139           [2, 480, 14, 14]               0
        CNNBlock-140           [2, 480, 14, 14]               0
          Conv2d-141           [2, 480, 14, 14]          12,000
     BatchNorm2d-142           [2, 480, 14, 14]             960
            SiLU-143           [2, 480, 14, 14]               0
        CNNBlock-144           [2, 480, 14, 14]               0
AdaptiveAvgPool2d-145             [2, 480, 1, 1]               0
          Conv2d-146              [2, 20, 1, 1]           9,620
            SiLU-147              [2, 20, 1, 1]               0
          Conv2d-148             [2, 480, 1, 1]          10,080
         Sigmoid-149             [2, 480, 1, 1]               0
SqueezeExcitation-150           [2, 480, 14, 14]               0
          Conv2d-151           [2, 112, 14, 14]          53,760
     BatchNorm2d-152           [2, 112, 14, 14]             224
InvertedResidualBlock-153           [2, 112, 14, 14]               0
          Conv2d-154           [2, 672, 14, 14]         677,376
     BatchNorm2d-155           [2, 672, 14, 14]           1,344
            SiLU-156           [2, 672, 14, 14]               0
        CNNBlock-157           [2, 672, 14, 14]               0
          Conv2d-158           [2, 672, 14, 14]          16,800
     BatchNorm2d-159           [2, 672, 14, 14]           1,344
            SiLU-160           [2, 672, 14, 14]               0
        CNNBlock-161           [2, 672, 14, 14]               0
AdaptiveAvgPool2d-162             [2, 672, 1, 1]               0
          Conv2d-163              [2, 28, 1, 1]          18,844
            SiLU-164              [2, 28, 1, 1]               0
          Conv2d-165             [2, 672, 1, 1]          19,488
         Sigmoid-166             [2, 672, 1, 1]               0
SqueezeExcitation-167           [2, 672, 14, 14]               0
          Conv2d-168           [2, 112, 14, 14]          75,264
     BatchNorm2d-169           [2, 112, 14, 14]             224
InvertedResidualBlock-170           [2, 112, 14, 14]               0
          Conv2d-171           [2, 672, 14, 14]         677,376
     BatchNorm2d-172           [2, 672, 14, 14]           1,344
            SiLU-173           [2, 672, 14, 14]               0
        CNNBlock-174           [2, 672, 14, 14]               0
          Conv2d-175           [2, 672, 14, 14]          16,800
     BatchNorm2d-176           [2, 672, 14, 14]           1,344
            SiLU-177           [2, 672, 14, 14]               0
        CNNBlock-178           [2, 672, 14, 14]               0
AdaptiveAvgPool2d-179             [2, 672, 1, 1]               0
          Conv2d-180              [2, 28, 1, 1]          18,844
            SiLU-181              [2, 28, 1, 1]               0
          Conv2d-182             [2, 672, 1, 1]          19,488
         Sigmoid-183             [2, 672, 1, 1]               0
SqueezeExcitation-184           [2, 672, 14, 14]               0
          Conv2d-185           [2, 112, 14, 14]          75,264
     BatchNorm2d-186           [2, 112, 14, 14]             224
InvertedResidualBlock-187           [2, 112, 14, 14]               0
          Conv2d-188           [2, 672, 14, 14]         677,376
     BatchNorm2d-189           [2, 672, 14, 14]           1,344
            SiLU-190           [2, 672, 14, 14]               0
        CNNBlock-191           [2, 672, 14, 14]               0
          Conv2d-192             [2, 672, 7, 7]          16,800
     BatchNorm2d-193             [2, 672, 7, 7]           1,344
            SiLU-194             [2, 672, 7, 7]               0
        CNNBlock-195             [2, 672, 7, 7]               0
AdaptiveAvgPool2d-196             [2, 672, 1, 1]               0
          Conv2d-197              [2, 28, 1, 1]          18,844
            SiLU-198              [2, 28, 1, 1]               0
          Conv2d-199             [2, 672, 1, 1]          19,488
         Sigmoid-200             [2, 672, 1, 1]               0
SqueezeExcitation-201             [2, 672, 7, 7]               0
          Conv2d-202             [2, 192, 7, 7]         129,024
     BatchNorm2d-203             [2, 192, 7, 7]             384
InvertedResidualBlock-204             [2, 192, 7, 7]               0
          Conv2d-205            [2, 1152, 7, 7]       1,990,656
     BatchNorm2d-206            [2, 1152, 7, 7]           2,304
            SiLU-207            [2, 1152, 7, 7]               0
        CNNBlock-208            [2, 1152, 7, 7]               0
          Conv2d-209            [2, 1152, 7, 7]          28,800
     BatchNorm2d-210            [2, 1152, 7, 7]           2,304
            SiLU-211            [2, 1152, 7, 7]               0
        CNNBlock-212            [2, 1152, 7, 7]               0
AdaptiveAvgPool2d-213            [2, 1152, 1, 1]               0
          Conv2d-214              [2, 48, 1, 1]          55,344
            SiLU-215              [2, 48, 1, 1]               0
          Conv2d-216            [2, 1152, 1, 1]          56,448
         Sigmoid-217            [2, 1152, 1, 1]               0
SqueezeExcitation-218            [2, 1152, 7, 7]               0
          Conv2d-219             [2, 192, 7, 7]         221,184
     BatchNorm2d-220             [2, 192, 7, 7]             384
InvertedResidualBlock-221             [2, 192, 7, 7]               0
          Conv2d-222            [2, 1152, 7, 7]       1,990,656
     BatchNorm2d-223            [2, 1152, 7, 7]           2,304
            SiLU-224            [2, 1152, 7, 7]               0
        CNNBlock-225            [2, 1152, 7, 7]               0
          Conv2d-226            [2, 1152, 7, 7]          28,800
     BatchNorm2d-227            [2, 1152, 7, 7]           2,304
            SiLU-228            [2, 1152, 7, 7]               0
        CNNBlock-229            [2, 1152, 7, 7]               0
AdaptiveAvgPool2d-230            [2, 1152, 1, 1]               0
          Conv2d-231              [2, 48, 1, 1]          55,344
            SiLU-232              [2, 48, 1, 1]               0
          Conv2d-233            [2, 1152, 1, 1]          56,448
         Sigmoid-234            [2, 1152, 1, 1]               0
SqueezeExcitation-235            [2, 1152, 7, 7]               0
          Conv2d-236             [2, 192, 7, 7]         221,184
     BatchNorm2d-237             [2, 192, 7, 7]             384
InvertedResidualBlock-238             [2, 192, 7, 7]               0
          Conv2d-239            [2, 1152, 7, 7]       1,990,656
     BatchNorm2d-240            [2, 1152, 7, 7]           2,304
            SiLU-241            [2, 1152, 7, 7]               0
        CNNBlock-242            [2, 1152, 7, 7]               0
          Conv2d-243            [2, 1152, 7, 7]          28,800
     BatchNorm2d-244            [2, 1152, 7, 7]           2,304
            SiLU-245            [2, 1152, 7, 7]               0
        CNNBlock-246            [2, 1152, 7, 7]               0
AdaptiveAvgPool2d-247            [2, 1152, 1, 1]               0
          Conv2d-248              [2, 48, 1, 1]          55,344
            SiLU-249              [2, 48, 1, 1]               0
          Conv2d-250            [2, 1152, 1, 1]          56,448
         Sigmoid-251            [2, 1152, 1, 1]               0
SqueezeExcitation-252            [2, 1152, 7, 7]               0
          Conv2d-253             [2, 192, 7, 7]         221,184
     BatchNorm2d-254             [2, 192, 7, 7]             384
InvertedResidualBlock-255             [2, 192, 7, 7]               0
          Conv2d-256            [2, 1152, 7, 7]       1,990,656
     BatchNorm2d-257            [2, 1152, 7, 7]           2,304
            SiLU-258            [2, 1152, 7, 7]               0
        CNNBlock-259            [2, 1152, 7, 7]               0
          Conv2d-260            [2, 1152, 7, 7]          10,368
     BatchNorm2d-261            [2, 1152, 7, 7]           2,304
            SiLU-262            [2, 1152, 7, 7]               0
        CNNBlock-263            [2, 1152, 7, 7]               0
AdaptiveAvgPool2d-264            [2, 1152, 1, 1]               0
          Conv2d-265              [2, 48, 1, 1]          55,344
            SiLU-266              [2, 48, 1, 1]               0
          Conv2d-267            [2, 1152, 1, 1]          56,448
         Sigmoid-268            [2, 1152, 1, 1]               0
SqueezeExcitation-269            [2, 1152, 7, 7]               0
          Conv2d-270             [2, 320, 7, 7]         368,640
     BatchNorm2d-271             [2, 320, 7, 7]             640
InvertedResidualBlock-272             [2, 320, 7, 7]               0
          Conv2d-273            [2, 1280, 7, 7]         409,600
     BatchNorm2d-274            [2, 1280, 7, 7]           2,560
            SiLU-275            [2, 1280, 7, 7]               0
        CNNBlock-276            [2, 1280, 7, 7]               0
AdaptiveAvgPool2d-277            [2, 1280, 1, 1]               0
         Flatten-278                  [2, 1280]               0
         Dropout-279                  [2, 1280]               0
          Linear-280                     [2, 2]           2,562
    EfficientNet-281                     [2, 2]               0
================================================================
Total params: 14,037,118
Trainable params: 14,037,118
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.15
Forward/backward pass size (MB): 438.06
Params size (MB): 53.55
Estimated Total Size (MB): 492.75
----------------------------------------------------------------

