EfficientNetB5----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [2, 46, 229, 229]           1,242
       BatchNorm2d-2          [2, 46, 229, 229]              92
              SiLU-3          [2, 46, 229, 229]               0
          CNNBlock-4          [2, 46, 229, 229]               0
            Conv2d-5          [2, 46, 229, 229]             414
       BatchNorm2d-6          [2, 46, 229, 229]              92
              SiLU-7          [2, 46, 229, 229]               0
          CNNBlock-8          [2, 46, 229, 229]               0
 AdaptiveAvgPool2d-9              [2, 46, 1, 1]               0
           Conv2d-10              [2, 11, 1, 1]             517
             SiLU-11              [2, 11, 1, 1]               0
           Conv2d-12              [2, 46, 1, 1]             552
          Sigmoid-13              [2, 46, 1, 1]               0
SqueezeExcitation-14          [2, 46, 229, 229]               0
           Conv2d-15          [2, 24, 229, 229]           1,104
      BatchNorm2d-16          [2, 24, 229, 229]              48
InvertedResidualBlock-17          [2, 24, 229, 229]               0
           Conv2d-18          [2, 24, 229, 229]             216
      BatchNorm2d-19          [2, 24, 229, 229]              48
             SiLU-20          [2, 24, 229, 229]               0
         CNNBlock-21          [2, 24, 229, 229]               0
AdaptiveAvgPool2d-22              [2, 24, 1, 1]               0
           Conv2d-23               [2, 6, 1, 1]             150
             SiLU-24               [2, 6, 1, 1]               0
           Conv2d-25              [2, 24, 1, 1]             168
          Sigmoid-26              [2, 24, 1, 1]               0
SqueezeExcitation-27          [2, 24, 229, 229]               0
           Conv2d-28          [2, 24, 229, 229]             576
      BatchNorm2d-29          [2, 24, 229, 229]              48
InvertedResidualBlock-30          [2, 24, 229, 229]               0
           Conv2d-31          [2, 24, 229, 229]             216
      BatchNorm2d-32          [2, 24, 229, 229]              48
             SiLU-33          [2, 24, 229, 229]               0
         CNNBlock-34          [2, 24, 229, 229]               0
AdaptiveAvgPool2d-35              [2, 24, 1, 1]               0
           Conv2d-36               [2, 6, 1, 1]             150
             SiLU-37               [2, 6, 1, 1]               0
           Conv2d-38              [2, 24, 1, 1]             168
          Sigmoid-39              [2, 24, 1, 1]               0
SqueezeExcitation-40          [2, 24, 229, 229]               0
           Conv2d-41          [2, 24, 229, 229]             576
      BatchNorm2d-42          [2, 24, 229, 229]              48
InvertedResidualBlock-43          [2, 24, 229, 229]               0
           Conv2d-44         [2, 144, 229, 229]          31,104
      BatchNorm2d-45         [2, 144, 229, 229]             288
             SiLU-46         [2, 144, 229, 229]               0
         CNNBlock-47         [2, 144, 229, 229]               0
           Conv2d-48         [2, 144, 115, 115]           1,296
      BatchNorm2d-49         [2, 144, 115, 115]             288
             SiLU-50         [2, 144, 115, 115]               0
         CNNBlock-51         [2, 144, 115, 115]               0
AdaptiveAvgPool2d-52             [2, 144, 1, 1]               0
           Conv2d-53               [2, 6, 1, 1]             870
             SiLU-54               [2, 6, 1, 1]               0
           Conv2d-55             [2, 144, 1, 1]           1,008
          Sigmoid-56             [2, 144, 1, 1]               0
SqueezeExcitation-57         [2, 144, 115, 115]               0
           Conv2d-58          [2, 36, 115, 115]           5,184
      BatchNorm2d-59          [2, 36, 115, 115]              72
InvertedResidualBlock-60          [2, 36, 115, 115]               0
           Conv2d-61         [2, 216, 115, 115]          69,984
      BatchNorm2d-62         [2, 216, 115, 115]             432
             SiLU-63         [2, 216, 115, 115]               0
         CNNBlock-64         [2, 216, 115, 115]               0
           Conv2d-65         [2, 216, 115, 115]           1,944
      BatchNorm2d-66         [2, 216, 115, 115]             432
             SiLU-67         [2, 216, 115, 115]               0
         CNNBlock-68         [2, 216, 115, 115]               0
AdaptiveAvgPool2d-69             [2, 216, 1, 1]               0
           Conv2d-70               [2, 9, 1, 1]           1,953
             SiLU-71               [2, 9, 1, 1]               0
           Conv2d-72             [2, 216, 1, 1]           2,160
          Sigmoid-73             [2, 216, 1, 1]               0
SqueezeExcitation-74         [2, 216, 115, 115]               0
           Conv2d-75          [2, 36, 115, 115]           7,776
      BatchNorm2d-76          [2, 36, 115, 115]              72
InvertedResidualBlock-77          [2, 36, 115, 115]               0
           Conv2d-78         [2, 216, 115, 115]          69,984
      BatchNorm2d-79         [2, 216, 115, 115]             432
             SiLU-80         [2, 216, 115, 115]               0
         CNNBlock-81         [2, 216, 115, 115]               0
           Conv2d-82         [2, 216, 115, 115]           1,944
      BatchNorm2d-83         [2, 216, 115, 115]             432
             SiLU-84         [2, 216, 115, 115]               0
         CNNBlock-85         [2, 216, 115, 115]               0
AdaptiveAvgPool2d-86             [2, 216, 1, 1]               0
           Conv2d-87               [2, 9, 1, 1]           1,953
             SiLU-88               [2, 9, 1, 1]               0
           Conv2d-89             [2, 216, 1, 1]           2,160
          Sigmoid-90             [2, 216, 1, 1]               0
SqueezeExcitation-91         [2, 216, 115, 115]               0
           Conv2d-92          [2, 36, 115, 115]           7,776
      BatchNorm2d-93          [2, 36, 115, 115]              72
InvertedResidualBlock-94          [2, 36, 115, 115]               0
           Conv2d-95         [2, 216, 115, 115]          69,984
      BatchNorm2d-96         [2, 216, 115, 115]             432
             SiLU-97         [2, 216, 115, 115]               0
         CNNBlock-98         [2, 216, 115, 115]               0
           Conv2d-99         [2, 216, 115, 115]           1,944
     BatchNorm2d-100         [2, 216, 115, 115]             432
            SiLU-101         [2, 216, 115, 115]               0
        CNNBlock-102         [2, 216, 115, 115]               0
AdaptiveAvgPool2d-103             [2, 216, 1, 1]               0
          Conv2d-104               [2, 9, 1, 1]           1,953
            SiLU-105               [2, 9, 1, 1]               0
          Conv2d-106             [2, 216, 1, 1]           2,160
         Sigmoid-107             [2, 216, 1, 1]               0
SqueezeExcitation-108         [2, 216, 115, 115]               0
          Conv2d-109          [2, 36, 115, 115]           7,776
     BatchNorm2d-110          [2, 36, 115, 115]              72
InvertedResidualBlock-111          [2, 36, 115, 115]               0
          Conv2d-112         [2, 216, 115, 115]          69,984
     BatchNorm2d-113         [2, 216, 115, 115]             432
            SiLU-114         [2, 216, 115, 115]               0
        CNNBlock-115         [2, 216, 115, 115]               0
          Conv2d-116         [2, 216, 115, 115]           1,944
     BatchNorm2d-117         [2, 216, 115, 115]             432
            SiLU-118         [2, 216, 115, 115]               0
        CNNBlock-119         [2, 216, 115, 115]               0
AdaptiveAvgPool2d-120             [2, 216, 1, 1]               0
          Conv2d-121               [2, 9, 1, 1]           1,953
            SiLU-122               [2, 9, 1, 1]               0
          Conv2d-123             [2, 216, 1, 1]           2,160
         Sigmoid-124             [2, 216, 1, 1]               0
SqueezeExcitation-125         [2, 216, 115, 115]               0
          Conv2d-126          [2, 36, 115, 115]           7,776
     BatchNorm2d-127          [2, 36, 115, 115]              72
InvertedResidualBlock-128          [2, 36, 115, 115]               0
          Conv2d-129         [2, 216, 115, 115]          69,984
     BatchNorm2d-130         [2, 216, 115, 115]             432
            SiLU-131         [2, 216, 115, 115]               0
        CNNBlock-132         [2, 216, 115, 115]               0
          Conv2d-133           [2, 216, 58, 58]           5,400
     BatchNorm2d-134           [2, 216, 58, 58]             432
            SiLU-135           [2, 216, 58, 58]               0
        CNNBlock-136           [2, 216, 58, 58]               0
AdaptiveAvgPool2d-137             [2, 216, 1, 1]               0
          Conv2d-138               [2, 9, 1, 1]           1,953
            SiLU-139               [2, 9, 1, 1]               0
          Conv2d-140             [2, 216, 1, 1]           2,160
         Sigmoid-141             [2, 216, 1, 1]               0
SqueezeExcitation-142           [2, 216, 58, 58]               0
          Conv2d-143            [2, 60, 58, 58]          12,960
     BatchNorm2d-144            [2, 60, 58, 58]             120
InvertedResidualBlock-145            [2, 60, 58, 58]               0
          Conv2d-146           [2, 360, 58, 58]         194,400
     BatchNorm2d-147           [2, 360, 58, 58]             720
            SiLU-148           [2, 360, 58, 58]               0
        CNNBlock-149           [2, 360, 58, 58]               0
          Conv2d-150           [2, 360, 58, 58]           9,000
     BatchNorm2d-151           [2, 360, 58, 58]             720
            SiLU-152           [2, 360, 58, 58]               0
        CNNBlock-153           [2, 360, 58, 58]               0
AdaptiveAvgPool2d-154             [2, 360, 1, 1]               0
          Conv2d-155              [2, 15, 1, 1]           5,415
            SiLU-156              [2, 15, 1, 1]               0
          Conv2d-157             [2, 360, 1, 1]           5,760
         Sigmoid-158             [2, 360, 1, 1]               0
SqueezeExcitation-159           [2, 360, 58, 58]               0
          Conv2d-160            [2, 60, 58, 58]          21,600
     BatchNorm2d-161            [2, 60, 58, 58]             120
InvertedResidualBlock-162            [2, 60, 58, 58]               0
          Conv2d-163           [2, 360, 58, 58]         194,400
     BatchNorm2d-164           [2, 360, 58, 58]             720
            SiLU-165           [2, 360, 58, 58]               0
        CNNBlock-166           [2, 360, 58, 58]               0
          Conv2d-167           [2, 360, 58, 58]           9,000
     BatchNorm2d-168           [2, 360, 58, 58]             720
            SiLU-169           [2, 360, 58, 58]               0
        CNNBlock-170           [2, 360, 58, 58]               0
AdaptiveAvgPool2d-171             [2, 360, 1, 1]               0
          Conv2d-172              [2, 15, 1, 1]           5,415
            SiLU-173              [2, 15, 1, 1]               0
          Conv2d-174             [2, 360, 1, 1]           5,760
         Sigmoid-175             [2, 360, 1, 1]               0
SqueezeExcitation-176           [2, 360, 58, 58]               0
          Conv2d-177            [2, 60, 58, 58]          21,600
     BatchNorm2d-178            [2, 60, 58, 58]             120
InvertedResidualBlock-179            [2, 60, 58, 58]               0
          Conv2d-180           [2, 360, 58, 58]         194,400
     BatchNorm2d-181           [2, 360, 58, 58]             720
            SiLU-182           [2, 360, 58, 58]               0
        CNNBlock-183           [2, 360, 58, 58]               0
          Conv2d-184           [2, 360, 58, 58]           9,000
     BatchNorm2d-185           [2, 360, 58, 58]             720
            SiLU-186           [2, 360, 58, 58]               0
        CNNBlock-187           [2, 360, 58, 58]               0
AdaptiveAvgPool2d-188             [2, 360, 1, 1]               0
          Conv2d-189              [2, 15, 1, 1]           5,415
            SiLU-190              [2, 15, 1, 1]               0
          Conv2d-191             [2, 360, 1, 1]           5,760
         Sigmoid-192             [2, 360, 1, 1]               0
SqueezeExcitation-193           [2, 360, 58, 58]               0
          Conv2d-194            [2, 60, 58, 58]          21,600
     BatchNorm2d-195            [2, 60, 58, 58]             120
InvertedResidualBlock-196            [2, 60, 58, 58]               0
          Conv2d-197           [2, 360, 58, 58]         194,400
     BatchNorm2d-198           [2, 360, 58, 58]             720
            SiLU-199           [2, 360, 58, 58]               0
        CNNBlock-200           [2, 360, 58, 58]               0
          Conv2d-201           [2, 360, 58, 58]           9,000
     BatchNorm2d-202           [2, 360, 58, 58]             720
            SiLU-203           [2, 360, 58, 58]               0
        CNNBlock-204           [2, 360, 58, 58]               0
AdaptiveAvgPool2d-205             [2, 360, 1, 1]               0
          Conv2d-206              [2, 15, 1, 1]           5,415
            SiLU-207              [2, 15, 1, 1]               0
          Conv2d-208             [2, 360, 1, 1]           5,760
         Sigmoid-209             [2, 360, 1, 1]               0
SqueezeExcitation-210           [2, 360, 58, 58]               0
          Conv2d-211            [2, 60, 58, 58]          21,600
     BatchNorm2d-212            [2, 60, 58, 58]             120
InvertedResidualBlock-213            [2, 60, 58, 58]               0
          Conv2d-214           [2, 360, 58, 58]         194,400
     BatchNorm2d-215           [2, 360, 58, 58]             720
            SiLU-216           [2, 360, 58, 58]               0
        CNNBlock-217           [2, 360, 58, 58]               0
          Conv2d-218           [2, 360, 29, 29]           3,240
     BatchNorm2d-219           [2, 360, 29, 29]             720
            SiLU-220           [2, 360, 29, 29]               0
        CNNBlock-221           [2, 360, 29, 29]               0
AdaptiveAvgPool2d-222             [2, 360, 1, 1]               0
          Conv2d-223              [2, 15, 1, 1]           5,415
            SiLU-224              [2, 15, 1, 1]               0
          Conv2d-225             [2, 360, 1, 1]           5,760
         Sigmoid-226             [2, 360, 1, 1]               0
SqueezeExcitation-227           [2, 360, 29, 29]               0
          Conv2d-228           [2, 120, 29, 29]          43,200
     BatchNorm2d-229           [2, 120, 29, 29]             240
InvertedResidualBlock-230           [2, 120, 29, 29]               0
          Conv2d-231           [2, 720, 29, 29]         777,600
     BatchNorm2d-232           [2, 720, 29, 29]           1,440
            SiLU-233           [2, 720, 29, 29]               0
        CNNBlock-234           [2, 720, 29, 29]               0
          Conv2d-235           [2, 720, 29, 29]           6,480
     BatchNorm2d-236           [2, 720, 29, 29]           1,440
            SiLU-237           [2, 720, 29, 29]               0
        CNNBlock-238           [2, 720, 29, 29]               0
AdaptiveAvgPool2d-239             [2, 720, 1, 1]               0
          Conv2d-240              [2, 30, 1, 1]          21,630
            SiLU-241              [2, 30, 1, 1]               0
          Conv2d-242             [2, 720, 1, 1]          22,320
         Sigmoid-243             [2, 720, 1, 1]               0
SqueezeExcitation-244           [2, 720, 29, 29]               0
          Conv2d-245           [2, 120, 29, 29]          86,400
     BatchNorm2d-246           [2, 120, 29, 29]             240
InvertedResidualBlock-247           [2, 120, 29, 29]               0
          Conv2d-248           [2, 720, 29, 29]         777,600
     BatchNorm2d-249           [2, 720, 29, 29]           1,440
            SiLU-250           [2, 720, 29, 29]               0
        CNNBlock-251           [2, 720, 29, 29]               0
          Conv2d-252           [2, 720, 29, 29]           6,480
     BatchNorm2d-253           [2, 720, 29, 29]           1,440
            SiLU-254           [2, 720, 29, 29]               0
        CNNBlock-255           [2, 720, 29, 29]               0
AdaptiveAvgPool2d-256             [2, 720, 1, 1]               0
          Conv2d-257              [2, 30, 1, 1]          21,630
            SiLU-258              [2, 30, 1, 1]               0
          Conv2d-259             [2, 720, 1, 1]          22,320
         Sigmoid-260             [2, 720, 1, 1]               0
SqueezeExcitation-261           [2, 720, 29, 29]               0
          Conv2d-262           [2, 120, 29, 29]          86,400
     BatchNorm2d-263           [2, 120, 29, 29]             240
InvertedResidualBlock-264           [2, 120, 29, 29]               0
          Conv2d-265           [2, 720, 29, 29]         777,600
     BatchNorm2d-266           [2, 720, 29, 29]           1,440
            SiLU-267           [2, 720, 29, 29]               0
        CNNBlock-268           [2, 720, 29, 29]               0
          Conv2d-269           [2, 720, 29, 29]           6,480
     BatchNorm2d-270           [2, 720, 29, 29]           1,440
            SiLU-271           [2, 720, 29, 29]               0
        CNNBlock-272           [2, 720, 29, 29]               0
AdaptiveAvgPool2d-273             [2, 720, 1, 1]               0
          Conv2d-274              [2, 30, 1, 1]          21,630
            SiLU-275              [2, 30, 1, 1]               0
          Conv2d-276             [2, 720, 1, 1]          22,320
         Sigmoid-277             [2, 720, 1, 1]               0
SqueezeExcitation-278           [2, 720, 29, 29]               0
          Conv2d-279           [2, 120, 29, 29]          86,400
     BatchNorm2d-280           [2, 120, 29, 29]             240
InvertedResidualBlock-281           [2, 120, 29, 29]               0
          Conv2d-282           [2, 720, 29, 29]         777,600
     BatchNorm2d-283           [2, 720, 29, 29]           1,440
            SiLU-284           [2, 720, 29, 29]               0
        CNNBlock-285           [2, 720, 29, 29]               0
          Conv2d-286           [2, 720, 29, 29]           6,480
     BatchNorm2d-287           [2, 720, 29, 29]           1,440
            SiLU-288           [2, 720, 29, 29]               0
        CNNBlock-289           [2, 720, 29, 29]               0
AdaptiveAvgPool2d-290             [2, 720, 1, 1]               0
          Conv2d-291              [2, 30, 1, 1]          21,630
            SiLU-292              [2, 30, 1, 1]               0
          Conv2d-293             [2, 720, 1, 1]          22,320
         Sigmoid-294             [2, 720, 1, 1]               0
SqueezeExcitation-295           [2, 720, 29, 29]               0
          Conv2d-296           [2, 120, 29, 29]          86,400
     BatchNorm2d-297           [2, 120, 29, 29]             240
InvertedResidualBlock-298           [2, 120, 29, 29]               0
          Conv2d-299           [2, 720, 29, 29]         777,600
     BatchNorm2d-300           [2, 720, 29, 29]           1,440
            SiLU-301           [2, 720, 29, 29]               0
        CNNBlock-302           [2, 720, 29, 29]               0
          Conv2d-303           [2, 720, 29, 29]           6,480
     BatchNorm2d-304           [2, 720, 29, 29]           1,440
            SiLU-305           [2, 720, 29, 29]               0
        CNNBlock-306           [2, 720, 29, 29]               0
AdaptiveAvgPool2d-307             [2, 720, 1, 1]               0
          Conv2d-308              [2, 30, 1, 1]          21,630
            SiLU-309              [2, 30, 1, 1]               0
          Conv2d-310             [2, 720, 1, 1]          22,320
         Sigmoid-311             [2, 720, 1, 1]               0
SqueezeExcitation-312           [2, 720, 29, 29]               0
          Conv2d-313           [2, 120, 29, 29]          86,400
     BatchNorm2d-314           [2, 120, 29, 29]             240
InvertedResidualBlock-315           [2, 120, 29, 29]               0
          Conv2d-316           [2, 720, 29, 29]         777,600
     BatchNorm2d-317           [2, 720, 29, 29]           1,440
            SiLU-318           [2, 720, 29, 29]               0
        CNNBlock-319           [2, 720, 29, 29]               0
          Conv2d-320           [2, 720, 29, 29]           6,480
     BatchNorm2d-321           [2, 720, 29, 29]           1,440
            SiLU-322           [2, 720, 29, 29]               0
        CNNBlock-323           [2, 720, 29, 29]               0
AdaptiveAvgPool2d-324             [2, 720, 1, 1]               0
          Conv2d-325              [2, 30, 1, 1]          21,630
            SiLU-326              [2, 30, 1, 1]               0
          Conv2d-327             [2, 720, 1, 1]          22,320
         Sigmoid-328             [2, 720, 1, 1]               0
SqueezeExcitation-329           [2, 720, 29, 29]               0
          Conv2d-330           [2, 120, 29, 29]          86,400
     BatchNorm2d-331           [2, 120, 29, 29]             240
InvertedResidualBlock-332           [2, 120, 29, 29]               0
          Conv2d-333           [2, 720, 29, 29]         777,600
     BatchNorm2d-334           [2, 720, 29, 29]           1,440
            SiLU-335           [2, 720, 29, 29]               0
        CNNBlock-336           [2, 720, 29, 29]               0
          Conv2d-337           [2, 720, 29, 29]          18,000
     BatchNorm2d-338           [2, 720, 29, 29]           1,440
            SiLU-339           [2, 720, 29, 29]               0
        CNNBlock-340           [2, 720, 29, 29]               0
AdaptiveAvgPool2d-341             [2, 720, 1, 1]               0
          Conv2d-342              [2, 30, 1, 1]          21,630
            SiLU-343              [2, 30, 1, 1]               0
          Conv2d-344             [2, 720, 1, 1]          22,320
         Sigmoid-345             [2, 720, 1, 1]               0
SqueezeExcitation-346           [2, 720, 29, 29]               0
          Conv2d-347           [2, 164, 29, 29]         118,080
     BatchNorm2d-348           [2, 164, 29, 29]             328
InvertedResidualBlock-349           [2, 164, 29, 29]               0
          Conv2d-350           [2, 984, 29, 29]       1,452,384
     BatchNorm2d-351           [2, 984, 29, 29]           1,968
            SiLU-352           [2, 984, 29, 29]               0
        CNNBlock-353           [2, 984, 29, 29]               0
          Conv2d-354           [2, 984, 29, 29]          24,600
     BatchNorm2d-355           [2, 984, 29, 29]           1,968
            SiLU-356           [2, 984, 29, 29]               0
        CNNBlock-357           [2, 984, 29, 29]               0
AdaptiveAvgPool2d-358             [2, 984, 1, 1]               0
          Conv2d-359              [2, 41, 1, 1]          40,385
            SiLU-360              [2, 41, 1, 1]               0
          Conv2d-361             [2, 984, 1, 1]          41,328
         Sigmoid-362             [2, 984, 1, 1]               0
SqueezeExcitation-363           [2, 984, 29, 29]               0
          Conv2d-364           [2, 164, 29, 29]         161,376
     BatchNorm2d-365           [2, 164, 29, 29]             328
InvertedResidualBlock-366           [2, 164, 29, 29]               0
          Conv2d-367           [2, 984, 29, 29]       1,452,384
     BatchNorm2d-368           [2, 984, 29, 29]           1,968
            SiLU-369           [2, 984, 29, 29]               0
        CNNBlock-370           [2, 984, 29, 29]               0
          Conv2d-371           [2, 984, 29, 29]          24,600
     BatchNorm2d-372           [2, 984, 29, 29]           1,968
            SiLU-373           [2, 984, 29, 29]               0
        CNNBlock-374           [2, 984, 29, 29]               0
AdaptiveAvgPool2d-375             [2, 984, 1, 1]               0
          Conv2d-376              [2, 41, 1, 1]          40,385
            SiLU-377              [2, 41, 1, 1]               0
          Conv2d-378             [2, 984, 1, 1]          41,328
         Sigmoid-379             [2, 984, 1, 1]               0
SqueezeExcitation-380           [2, 984, 29, 29]               0
          Conv2d-381           [2, 164, 29, 29]         161,376
     BatchNorm2d-382           [2, 164, 29, 29]             328
InvertedResidualBlock-383           [2, 164, 29, 29]               0
          Conv2d-384           [2, 984, 29, 29]       1,452,384
     BatchNorm2d-385           [2, 984, 29, 29]           1,968
            SiLU-386           [2, 984, 29, 29]               0
        CNNBlock-387           [2, 984, 29, 29]               0
          Conv2d-388           [2, 984, 29, 29]          24,600
     BatchNorm2d-389           [2, 984, 29, 29]           1,968
            SiLU-390           [2, 984, 29, 29]               0
        CNNBlock-391           [2, 984, 29, 29]               0
AdaptiveAvgPool2d-392             [2, 984, 1, 1]               0
          Conv2d-393              [2, 41, 1, 1]          40,385
            SiLU-394              [2, 41, 1, 1]               0
          Conv2d-395             [2, 984, 1, 1]          41,328
         Sigmoid-396             [2, 984, 1, 1]               0
SqueezeExcitation-397           [2, 984, 29, 29]               0
          Conv2d-398           [2, 164, 29, 29]         161,376
     BatchNorm2d-399           [2, 164, 29, 29]             328
InvertedResidualBlock-400           [2, 164, 29, 29]               0
          Conv2d-401           [2, 984, 29, 29]       1,452,384
     BatchNorm2d-402           [2, 984, 29, 29]           1,968
            SiLU-403           [2, 984, 29, 29]               0
        CNNBlock-404           [2, 984, 29, 29]               0
          Conv2d-405           [2, 984, 29, 29]          24,600
     BatchNorm2d-406           [2, 984, 29, 29]           1,968
            SiLU-407           [2, 984, 29, 29]               0
        CNNBlock-408           [2, 984, 29, 29]               0
AdaptiveAvgPool2d-409             [2, 984, 1, 1]               0
          Conv2d-410              [2, 41, 1, 1]          40,385
            SiLU-411              [2, 41, 1, 1]               0
          Conv2d-412             [2, 984, 1, 1]          41,328
         Sigmoid-413             [2, 984, 1, 1]               0
SqueezeExcitation-414           [2, 984, 29, 29]               0
          Conv2d-415           [2, 164, 29, 29]         161,376
     BatchNorm2d-416           [2, 164, 29, 29]             328
InvertedResidualBlock-417           [2, 164, 29, 29]               0
          Conv2d-418           [2, 984, 29, 29]       1,452,384
     BatchNorm2d-419           [2, 984, 29, 29]           1,968
            SiLU-420           [2, 984, 29, 29]               0
        CNNBlock-421           [2, 984, 29, 29]               0
          Conv2d-422           [2, 984, 29, 29]          24,600
     BatchNorm2d-423           [2, 984, 29, 29]           1,968
            SiLU-424           [2, 984, 29, 29]               0
        CNNBlock-425           [2, 984, 29, 29]               0
AdaptiveAvgPool2d-426             [2, 984, 1, 1]               0
          Conv2d-427              [2, 41, 1, 1]          40,385
            SiLU-428              [2, 41, 1, 1]               0
          Conv2d-429             [2, 984, 1, 1]          41,328
         Sigmoid-430             [2, 984, 1, 1]               0
SqueezeExcitation-431           [2, 984, 29, 29]               0
          Conv2d-432           [2, 164, 29, 29]         161,376
     BatchNorm2d-433           [2, 164, 29, 29]             328
InvertedResidualBlock-434           [2, 164, 29, 29]               0
          Conv2d-435           [2, 984, 29, 29]       1,452,384
     BatchNorm2d-436           [2, 984, 29, 29]           1,968
            SiLU-437           [2, 984, 29, 29]               0
        CNNBlock-438           [2, 984, 29, 29]               0
          Conv2d-439           [2, 984, 29, 29]          24,600
     BatchNorm2d-440           [2, 984, 29, 29]           1,968
            SiLU-441           [2, 984, 29, 29]               0
        CNNBlock-442           [2, 984, 29, 29]               0
AdaptiveAvgPool2d-443             [2, 984, 1, 1]               0
          Conv2d-444              [2, 41, 1, 1]          40,385
            SiLU-445              [2, 41, 1, 1]               0
          Conv2d-446             [2, 984, 1, 1]          41,328
         Sigmoid-447             [2, 984, 1, 1]               0
SqueezeExcitation-448           [2, 984, 29, 29]               0
          Conv2d-449           [2, 164, 29, 29]         161,376
     BatchNorm2d-450           [2, 164, 29, 29]             328
InvertedResidualBlock-451           [2, 164, 29, 29]               0
          Conv2d-452           [2, 984, 29, 29]       1,452,384
     BatchNorm2d-453           [2, 984, 29, 29]           1,968
            SiLU-454           [2, 984, 29, 29]               0
        CNNBlock-455           [2, 984, 29, 29]               0
          Conv2d-456           [2, 984, 15, 15]          24,600
     BatchNorm2d-457           [2, 984, 15, 15]           1,968
            SiLU-458           [2, 984, 15, 15]               0
        CNNBlock-459           [2, 984, 15, 15]               0
AdaptiveAvgPool2d-460             [2, 984, 1, 1]               0
          Conv2d-461              [2, 41, 1, 1]          40,385
            SiLU-462              [2, 41, 1, 1]               0
          Conv2d-463             [2, 984, 1, 1]          41,328
         Sigmoid-464             [2, 984, 1, 1]               0
SqueezeExcitation-465           [2, 984, 15, 15]               0
          Conv2d-466           [2, 284, 15, 15]         279,456
     BatchNorm2d-467           [2, 284, 15, 15]             568
InvertedResidualBlock-468           [2, 284, 15, 15]               0
          Conv2d-469          [2, 1704, 15, 15]       4,355,424
     BatchNorm2d-470          [2, 1704, 15, 15]           3,408
            SiLU-471          [2, 1704, 15, 15]               0
        CNNBlock-472          [2, 1704, 15, 15]               0
          Conv2d-473          [2, 1704, 15, 15]          42,600
     BatchNorm2d-474          [2, 1704, 15, 15]           3,408
            SiLU-475          [2, 1704, 15, 15]               0
        CNNBlock-476          [2, 1704, 15, 15]               0
AdaptiveAvgPool2d-477            [2, 1704, 1, 1]               0
          Conv2d-478              [2, 71, 1, 1]         121,055
            SiLU-479              [2, 71, 1, 1]               0
          Conv2d-480            [2, 1704, 1, 1]         122,688
         Sigmoid-481            [2, 1704, 1, 1]               0
SqueezeExcitation-482          [2, 1704, 15, 15]               0
          Conv2d-483           [2, 284, 15, 15]         483,936
     BatchNorm2d-484           [2, 284, 15, 15]             568
InvertedResidualBlock-485           [2, 284, 15, 15]               0
          Conv2d-486          [2, 1704, 15, 15]       4,355,424
     BatchNorm2d-487          [2, 1704, 15, 15]           3,408
            SiLU-488          [2, 1704, 15, 15]               0
        CNNBlock-489          [2, 1704, 15, 15]               0
          Conv2d-490          [2, 1704, 15, 15]          42,600
     BatchNorm2d-491          [2, 1704, 15, 15]           3,408
            SiLU-492          [2, 1704, 15, 15]               0
        CNNBlock-493          [2, 1704, 15, 15]               0
AdaptiveAvgPool2d-494            [2, 1704, 1, 1]               0
          Conv2d-495              [2, 71, 1, 1]         121,055
            SiLU-496              [2, 71, 1, 1]               0
          Conv2d-497            [2, 1704, 1, 1]         122,688
         Sigmoid-498            [2, 1704, 1, 1]               0
SqueezeExcitation-499          [2, 1704, 15, 15]               0
          Conv2d-500           [2, 284, 15, 15]         483,936
     BatchNorm2d-501           [2, 284, 15, 15]             568
InvertedResidualBlock-502           [2, 284, 15, 15]               0
          Conv2d-503          [2, 1704, 15, 15]       4,355,424
     BatchNorm2d-504          [2, 1704, 15, 15]           3,408
            SiLU-505          [2, 1704, 15, 15]               0
        CNNBlock-506          [2, 1704, 15, 15]               0
          Conv2d-507          [2, 1704, 15, 15]          42,600
     BatchNorm2d-508          [2, 1704, 15, 15]           3,408
            SiLU-509          [2, 1704, 15, 15]               0
        CNNBlock-510          [2, 1704, 15, 15]               0
AdaptiveAvgPool2d-511            [2, 1704, 1, 1]               0
          Conv2d-512              [2, 71, 1, 1]         121,055
            SiLU-513              [2, 71, 1, 1]               0
          Conv2d-514            [2, 1704, 1, 1]         122,688
         Sigmoid-515            [2, 1704, 1, 1]               0
SqueezeExcitation-516          [2, 1704, 15, 15]               0
          Conv2d-517           [2, 284, 15, 15]         483,936
     BatchNorm2d-518           [2, 284, 15, 15]             568
InvertedResidualBlock-519           [2, 284, 15, 15]               0
          Conv2d-520          [2, 1704, 15, 15]       4,355,424
     BatchNorm2d-521          [2, 1704, 15, 15]           3,408
            SiLU-522          [2, 1704, 15, 15]               0
        CNNBlock-523          [2, 1704, 15, 15]               0
          Conv2d-524          [2, 1704, 15, 15]          42,600
     BatchNorm2d-525          [2, 1704, 15, 15]           3,408
            SiLU-526          [2, 1704, 15, 15]               0
        CNNBlock-527          [2, 1704, 15, 15]               0
AdaptiveAvgPool2d-528            [2, 1704, 1, 1]               0
          Conv2d-529              [2, 71, 1, 1]         121,055
            SiLU-530              [2, 71, 1, 1]               0
          Conv2d-531            [2, 1704, 1, 1]         122,688
         Sigmoid-532            [2, 1704, 1, 1]               0
SqueezeExcitation-533          [2, 1704, 15, 15]               0
          Conv2d-534           [2, 284, 15, 15]         483,936
     BatchNorm2d-535           [2, 284, 15, 15]             568
InvertedResidualBlock-536           [2, 284, 15, 15]               0
          Conv2d-537          [2, 1704, 15, 15]       4,355,424
     BatchNorm2d-538          [2, 1704, 15, 15]           3,408
            SiLU-539          [2, 1704, 15, 15]               0
        CNNBlock-540          [2, 1704, 15, 15]               0
          Conv2d-541          [2, 1704, 15, 15]          42,600
     BatchNorm2d-542          [2, 1704, 15, 15]           3,408
            SiLU-543          [2, 1704, 15, 15]               0
        CNNBlock-544          [2, 1704, 15, 15]               0
AdaptiveAvgPool2d-545            [2, 1704, 1, 1]               0
          Conv2d-546              [2, 71, 1, 1]         121,055
            SiLU-547              [2, 71, 1, 1]               0
          Conv2d-548            [2, 1704, 1, 1]         122,688
         Sigmoid-549            [2, 1704, 1, 1]               0
SqueezeExcitation-550          [2, 1704, 15, 15]               0
          Conv2d-551           [2, 284, 15, 15]         483,936
     BatchNorm2d-552           [2, 284, 15, 15]             568
InvertedResidualBlock-553           [2, 284, 15, 15]               0
          Conv2d-554          [2, 1704, 15, 15]       4,355,424
     BatchNorm2d-555          [2, 1704, 15, 15]           3,408
            SiLU-556          [2, 1704, 15, 15]               0
        CNNBlock-557          [2, 1704, 15, 15]               0
          Conv2d-558          [2, 1704, 15, 15]          42,600
     BatchNorm2d-559          [2, 1704, 15, 15]           3,408
            SiLU-560          [2, 1704, 15, 15]               0
        CNNBlock-561          [2, 1704, 15, 15]               0
AdaptiveAvgPool2d-562            [2, 1704, 1, 1]               0
          Conv2d-563              [2, 71, 1, 1]         121,055
            SiLU-564              [2, 71, 1, 1]               0
          Conv2d-565            [2, 1704, 1, 1]         122,688
         Sigmoid-566            [2, 1704, 1, 1]               0
SqueezeExcitation-567          [2, 1704, 15, 15]               0
          Conv2d-568           [2, 284, 15, 15]         483,936
     BatchNorm2d-569           [2, 284, 15, 15]             568
InvertedResidualBlock-570           [2, 284, 15, 15]               0
          Conv2d-571          [2, 1704, 15, 15]       4,355,424
     BatchNorm2d-572          [2, 1704, 15, 15]           3,408
            SiLU-573          [2, 1704, 15, 15]               0
        CNNBlock-574          [2, 1704, 15, 15]               0
          Conv2d-575          [2, 1704, 15, 15]          42,600
     BatchNorm2d-576          [2, 1704, 15, 15]           3,408
            SiLU-577          [2, 1704, 15, 15]               0
        CNNBlock-578          [2, 1704, 15, 15]               0
AdaptiveAvgPool2d-579            [2, 1704, 1, 1]               0
          Conv2d-580              [2, 71, 1, 1]         121,055
            SiLU-581              [2, 71, 1, 1]               0
          Conv2d-582            [2, 1704, 1, 1]         122,688
         Sigmoid-583            [2, 1704, 1, 1]               0
SqueezeExcitation-584          [2, 1704, 15, 15]               0
          Conv2d-585           [2, 284, 15, 15]         483,936
     BatchNorm2d-586           [2, 284, 15, 15]             568
InvertedResidualBlock-587           [2, 284, 15, 15]               0
          Conv2d-588          [2, 1704, 15, 15]       4,355,424
     BatchNorm2d-589          [2, 1704, 15, 15]           3,408
            SiLU-590          [2, 1704, 15, 15]               0
        CNNBlock-591          [2, 1704, 15, 15]               0
          Conv2d-592          [2, 1704, 15, 15]          42,600
     BatchNorm2d-593          [2, 1704, 15, 15]           3,408
            SiLU-594          [2, 1704, 15, 15]               0
        CNNBlock-595          [2, 1704, 15, 15]               0
AdaptiveAvgPool2d-596            [2, 1704, 1, 1]               0
          Conv2d-597              [2, 71, 1, 1]         121,055
            SiLU-598              [2, 71, 1, 1]               0
          Conv2d-599            [2, 1704, 1, 1]         122,688
         Sigmoid-600            [2, 1704, 1, 1]               0
SqueezeExcitation-601          [2, 1704, 15, 15]               0
          Conv2d-602           [2, 284, 15, 15]         483,936
     BatchNorm2d-603           [2, 284, 15, 15]             568
InvertedResidualBlock-604           [2, 284, 15, 15]               0
          Conv2d-605          [2, 1704, 15, 15]       4,355,424
     BatchNorm2d-606          [2, 1704, 15, 15]           3,408
            SiLU-607          [2, 1704, 15, 15]               0
        CNNBlock-608          [2, 1704, 15, 15]               0
          Conv2d-609          [2, 1704, 15, 15]          15,336
     BatchNorm2d-610          [2, 1704, 15, 15]           3,408
            SiLU-611          [2, 1704, 15, 15]               0
        CNNBlock-612          [2, 1704, 15, 15]               0
AdaptiveAvgPool2d-613            [2, 1704, 1, 1]               0
          Conv2d-614              [2, 71, 1, 1]         121,055
            SiLU-615              [2, 71, 1, 1]               0
          Conv2d-616            [2, 1704, 1, 1]         122,688
         Sigmoid-617            [2, 1704, 1, 1]               0
SqueezeExcitation-618          [2, 1704, 15, 15]               0
          Conv2d-619           [2, 468, 15, 15]         797,472
     BatchNorm2d-620           [2, 468, 15, 15]             936
InvertedResidualBlock-621           [2, 468, 15, 15]               0
          Conv2d-622          [2, 2808, 15, 15]      11,827,296
     BatchNorm2d-623          [2, 2808, 15, 15]           5,616
            SiLU-624          [2, 2808, 15, 15]               0
        CNNBlock-625          [2, 2808, 15, 15]               0
          Conv2d-626          [2, 2808, 15, 15]          25,272
     BatchNorm2d-627          [2, 2808, 15, 15]           5,616
            SiLU-628          [2, 2808, 15, 15]               0
        CNNBlock-629          [2, 2808, 15, 15]               0
AdaptiveAvgPool2d-630            [2, 2808, 1, 1]               0
          Conv2d-631             [2, 117, 1, 1]         328,653
            SiLU-632             [2, 117, 1, 1]               0
          Conv2d-633            [2, 2808, 1, 1]         331,344
         Sigmoid-634            [2, 2808, 1, 1]               0
SqueezeExcitation-635          [2, 2808, 15, 15]               0
          Conv2d-636           [2, 468, 15, 15]       1,314,144
     BatchNorm2d-637           [2, 468, 15, 15]             936
InvertedResidualBlock-638           [2, 468, 15, 15]               0
          Conv2d-639          [2, 2808, 15, 15]      11,827,296
     BatchNorm2d-640          [2, 2808, 15, 15]           5,616
            SiLU-641          [2, 2808, 15, 15]               0
        CNNBlock-642          [2, 2808, 15, 15]               0
          Conv2d-643          [2, 2808, 15, 15]          25,272
     BatchNorm2d-644          [2, 2808, 15, 15]           5,616
            SiLU-645          [2, 2808, 15, 15]               0
        CNNBlock-646          [2, 2808, 15, 15]               0
AdaptiveAvgPool2d-647            [2, 2808, 1, 1]               0
          Conv2d-648             [2, 117, 1, 1]         328,653
            SiLU-649             [2, 117, 1, 1]               0
          Conv2d-650            [2, 2808, 1, 1]         331,344
         Sigmoid-651            [2, 2808, 1, 1]               0
SqueezeExcitation-652          [2, 2808, 15, 15]               0
          Conv2d-653           [2, 468, 15, 15]       1,314,144
     BatchNorm2d-654           [2, 468, 15, 15]             936
InvertedResidualBlock-655           [2, 468, 15, 15]               0
          Conv2d-656          [2, 1875, 15, 15]         877,500
     BatchNorm2d-657          [2, 1875, 15, 15]           3,750
            SiLU-658          [2, 1875, 15, 15]               0
        CNNBlock-659          [2, 1875, 15, 15]               0
AdaptiveAvgPool2d-660            [2, 1875, 1, 1]               0
         Flatten-661                  [2, 1875]               0
         Dropout-662                  [2, 1875]               0
          Linear-663                     [2, 2]           3,752
    EfficientNet-664                     [2, 2]               0
================================================================
Total params: 95,385,667
Trainable params: 95,385,667
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 4.78
Forward/backward pass size (MB): 6142.37
Params size (MB): 363.87
Estimated Total Size (MB): 6511.02
----------------------------------------------------------------

