VGG16----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [2, 64, 244, 244]           1,792
       BatchNorm2d-2          [2, 64, 244, 244]             128
              ReLU-3          [2, 64, 244, 244]               0
            Conv2d-4          [2, 64, 244, 244]          36,928
       BatchNorm2d-5          [2, 64, 244, 244]             128
              ReLU-6          [2, 64, 244, 244]               0
         MaxPool2d-7          [2, 64, 122, 122]               0
            Conv2d-8         [2, 128, 122, 122]          73,856
       BatchNorm2d-9         [2, 128, 122, 122]             256
             ReLU-10         [2, 128, 122, 122]               0
           Conv2d-11         [2, 128, 122, 122]         147,584
      BatchNorm2d-12         [2, 128, 122, 122]             256
             ReLU-13         [2, 128, 122, 122]               0
        MaxPool2d-14           [2, 128, 61, 61]               0
           Conv2d-15           [2, 256, 61, 61]         295,168
      BatchNorm2d-16           [2, 256, 61, 61]             512
             ReLU-17           [2, 256, 61, 61]               0
           Conv2d-18           [2, 256, 61, 61]         590,080
      BatchNorm2d-19           [2, 256, 61, 61]             512
             ReLU-20           [2, 256, 61, 61]               0
           Conv2d-21           [2, 256, 61, 61]         590,080
      BatchNorm2d-22           [2, 256, 61, 61]             512
             ReLU-23           [2, 256, 61, 61]               0
        MaxPool2d-24           [2, 256, 30, 30]               0
           Conv2d-25           [2, 512, 30, 30]       1,180,160
      BatchNorm2d-26           [2, 512, 30, 30]           1,024
             ReLU-27           [2, 512, 30, 30]               0
           Conv2d-28           [2, 512, 30, 30]       2,359,808
      BatchNorm2d-29           [2, 512, 30, 30]           1,024
             ReLU-30           [2, 512, 30, 30]               0
           Conv2d-31           [2, 512, 30, 30]       2,359,808
      BatchNorm2d-32           [2, 512, 30, 30]           1,024
             ReLU-33           [2, 512, 30, 30]               0
        MaxPool2d-34           [2, 512, 15, 15]               0
           Conv2d-35           [2, 512, 15, 15]       2,359,808
      BatchNorm2d-36           [2, 512, 15, 15]           1,024
             ReLU-37           [2, 512, 15, 15]               0
           Conv2d-38           [2, 512, 15, 15]       2,359,808
      BatchNorm2d-39           [2, 512, 15, 15]           1,024
             ReLU-40           [2, 512, 15, 15]               0
           Conv2d-41           [2, 512, 15, 15]       2,359,808
      BatchNorm2d-42           [2, 512, 15, 15]           1,024
             ReLU-43           [2, 512, 15, 15]               0
        MaxPool2d-44             [2, 512, 7, 7]               0
          Flatten-45                 [2, 25088]               0
           Linear-46                  [2, 4096]     102,764,544
             ReLU-47                  [2, 4096]               0
          Dropout-48                  [2, 4096]               0
           Linear-49                  [2, 4096]      16,781,312
             ReLU-50                  [2, 4096]               0
          Dropout-51                  [2, 4096]               0
           Linear-52                     [2, 2]           8,194
          VGG_net-53                     [2, 2]               0
================================================================
Total params: 134,277,186
Trainable params: 134,277,186
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.36
Forward/backward pass size (MB): 761.40
Params size (MB): 512.23
Estimated Total Size (MB): 1274.99
----------------------------------------------------------------

