VGG11----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [2, 64, 244, 244]           1,792
       BatchNorm2d-2          [2, 64, 244, 244]             128
              ReLU-3          [2, 64, 244, 244]               0
         MaxPool2d-4          [2, 64, 122, 122]               0
            Conv2d-5         [2, 128, 122, 122]          73,856
       BatchNorm2d-6         [2, 128, 122, 122]             256
              ReLU-7         [2, 128, 122, 122]               0
         MaxPool2d-8           [2, 128, 61, 61]               0
            Conv2d-9           [2, 256, 61, 61]         295,168
      BatchNorm2d-10           [2, 256, 61, 61]             512
             ReLU-11           [2, 256, 61, 61]               0
           Conv2d-12           [2, 256, 61, 61]         590,080
      BatchNorm2d-13           [2, 256, 61, 61]             512
             ReLU-14           [2, 256, 61, 61]               0
        MaxPool2d-15           [2, 256, 30, 30]               0
           Conv2d-16           [2, 512, 30, 30]       1,180,160
      BatchNorm2d-17           [2, 512, 30, 30]           1,024
             ReLU-18           [2, 512, 30, 30]               0
           Conv2d-19           [2, 512, 30, 30]       2,359,808
      BatchNorm2d-20           [2, 512, 30, 30]           1,024
             ReLU-21           [2, 512, 30, 30]               0
        MaxPool2d-22           [2, 512, 15, 15]               0
           Conv2d-23           [2, 512, 15, 15]       2,359,808
      BatchNorm2d-24           [2, 512, 15, 15]           1,024
             ReLU-25           [2, 512, 15, 15]               0
           Conv2d-26           [2, 512, 15, 15]       2,359,808
      BatchNorm2d-27           [2, 512, 15, 15]           1,024
             ReLU-28           [2, 512, 15, 15]               0
        MaxPool2d-29             [2, 512, 7, 7]               0
          Flatten-30                 [2, 25088]               0
           Linear-31                  [2, 4096]     102,764,544
             ReLU-32                  [2, 4096]               0
          Dropout-33                  [2, 4096]               0
           Linear-34                  [2, 4096]      16,781,312
             ReLU-35                  [2, 4096]               0
          Dropout-36                  [2, 4096]               0
           Linear-37                     [2, 2]           8,194
          VGG_net-38                     [2, 2]               0
================================================================
Total params: 128,780,034
Trainable params: 128,780,034
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.36
Forward/backward pass size (MB): 429.79
Params size (MB): 491.26
Estimated Total Size (MB): 922.41
----------------------------------------------------------------

