EfficientNetB4----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [32, 42, 190, 190]           1,134
       BatchNorm2d-2         [32, 42, 190, 190]              84
              SiLU-3         [32, 42, 190, 190]               0
          CNNBlock-4         [32, 42, 190, 190]               0
            Conv2d-5         [32, 42, 190, 190]             378
       BatchNorm2d-6         [32, 42, 190, 190]              84
              SiLU-7         [32, 42, 190, 190]               0
          CNNBlock-8         [32, 42, 190, 190]               0
 AdaptiveAvgPool2d-9             [32, 42, 1, 1]               0
           Conv2d-10             [32, 10, 1, 1]             430
             SiLU-11             [32, 10, 1, 1]               0
           Conv2d-12             [32, 42, 1, 1]             462
          Sigmoid-13             [32, 42, 1, 1]               0
SqueezeExcitation-14         [32, 42, 190, 190]               0
           Conv2d-15         [32, 24, 190, 190]           1,008
      BatchNorm2d-16         [32, 24, 190, 190]              48
InvertedResidualBlock-17         [32, 24, 190, 190]               0
           Conv2d-18         [32, 24, 190, 190]             216
      BatchNorm2d-19         [32, 24, 190, 190]              48
             SiLU-20         [32, 24, 190, 190]               0
         CNNBlock-21         [32, 24, 190, 190]               0
AdaptiveAvgPool2d-22             [32, 24, 1, 1]               0
           Conv2d-23              [32, 6, 1, 1]             150
             SiLU-24              [32, 6, 1, 1]               0
           Conv2d-25             [32, 24, 1, 1]             168
          Sigmoid-26             [32, 24, 1, 1]               0
SqueezeExcitation-27         [32, 24, 190, 190]               0
           Conv2d-28         [32, 24, 190, 190]             576
      BatchNorm2d-29         [32, 24, 190, 190]              48
InvertedResidualBlock-30         [32, 24, 190, 190]               0
           Conv2d-31        [32, 144, 190, 190]          31,104
      BatchNorm2d-32        [32, 144, 190, 190]             288
             SiLU-33        [32, 144, 190, 190]               0
         CNNBlock-34        [32, 144, 190, 190]               0
           Conv2d-35          [32, 144, 95, 95]           1,296
      BatchNorm2d-36          [32, 144, 95, 95]             288
             SiLU-37          [32, 144, 95, 95]               0
         CNNBlock-38          [32, 144, 95, 95]               0
AdaptiveAvgPool2d-39            [32, 144, 1, 1]               0
           Conv2d-40              [32, 6, 1, 1]             870
             SiLU-41              [32, 6, 1, 1]               0
           Conv2d-42            [32, 144, 1, 1]           1,008
          Sigmoid-43            [32, 144, 1, 1]               0
SqueezeExcitation-44          [32, 144, 95, 95]               0
           Conv2d-45           [32, 32, 95, 95]           4,608
      BatchNorm2d-46           [32, 32, 95, 95]              64
InvertedResidualBlock-47           [32, 32, 95, 95]               0
           Conv2d-48          [32, 192, 95, 95]          55,296
      BatchNorm2d-49          [32, 192, 95, 95]             384
             SiLU-50          [32, 192, 95, 95]               0
         CNNBlock-51          [32, 192, 95, 95]               0
           Conv2d-52          [32, 192, 95, 95]           1,728
      BatchNorm2d-53          [32, 192, 95, 95]             384
             SiLU-54          [32, 192, 95, 95]               0
         CNNBlock-55          [32, 192, 95, 95]               0
AdaptiveAvgPool2d-56            [32, 192, 1, 1]               0
           Conv2d-57              [32, 8, 1, 1]           1,544
             SiLU-58              [32, 8, 1, 1]               0
           Conv2d-59            [32, 192, 1, 1]           1,728
          Sigmoid-60            [32, 192, 1, 1]               0
SqueezeExcitation-61          [32, 192, 95, 95]               0
           Conv2d-62           [32, 32, 95, 95]           6,144
      BatchNorm2d-63           [32, 32, 95, 95]              64
InvertedResidualBlock-64           [32, 32, 95, 95]               0
           Conv2d-65          [32, 192, 95, 95]          55,296
      BatchNorm2d-66          [32, 192, 95, 95]             384
             SiLU-67          [32, 192, 95, 95]               0
         CNNBlock-68          [32, 192, 95, 95]               0
           Conv2d-69          [32, 192, 95, 95]           1,728
      BatchNorm2d-70          [32, 192, 95, 95]             384
             SiLU-71          [32, 192, 95, 95]               0
         CNNBlock-72          [32, 192, 95, 95]               0
AdaptiveAvgPool2d-73            [32, 192, 1, 1]               0
           Conv2d-74              [32, 8, 1, 1]           1,544
             SiLU-75              [32, 8, 1, 1]               0
           Conv2d-76            [32, 192, 1, 1]           1,728
          Sigmoid-77            [32, 192, 1, 1]               0
SqueezeExcitation-78          [32, 192, 95, 95]               0
           Conv2d-79           [32, 32, 95, 95]           6,144
      BatchNorm2d-80           [32, 32, 95, 95]              64
InvertedResidualBlock-81           [32, 32, 95, 95]               0
           Conv2d-82          [32, 192, 95, 95]          55,296
      BatchNorm2d-83          [32, 192, 95, 95]             384
             SiLU-84          [32, 192, 95, 95]               0
         CNNBlock-85          [32, 192, 95, 95]               0
           Conv2d-86          [32, 192, 95, 95]           1,728
      BatchNorm2d-87          [32, 192, 95, 95]             384
             SiLU-88          [32, 192, 95, 95]               0
         CNNBlock-89          [32, 192, 95, 95]               0
AdaptiveAvgPool2d-90            [32, 192, 1, 1]               0
           Conv2d-91              [32, 8, 1, 1]           1,544
             SiLU-92              [32, 8, 1, 1]               0
           Conv2d-93            [32, 192, 1, 1]           1,728
          Sigmoid-94            [32, 192, 1, 1]               0
SqueezeExcitation-95          [32, 192, 95, 95]               0
           Conv2d-96           [32, 32, 95, 95]           6,144
      BatchNorm2d-97           [32, 32, 95, 95]              64
InvertedResidualBlock-98           [32, 32, 95, 95]               0
           Conv2d-99          [32, 192, 95, 95]          55,296
     BatchNorm2d-100          [32, 192, 95, 95]             384
            SiLU-101          [32, 192, 95, 95]               0
        CNNBlock-102          [32, 192, 95, 95]               0
          Conv2d-103          [32, 192, 48, 48]           4,800
     BatchNorm2d-104          [32, 192, 48, 48]             384
            SiLU-105          [32, 192, 48, 48]               0
        CNNBlock-106          [32, 192, 48, 48]               0
AdaptiveAvgPool2d-107            [32, 192, 1, 1]               0
          Conv2d-108              [32, 8, 1, 1]           1,544
            SiLU-109              [32, 8, 1, 1]               0
          Conv2d-110            [32, 192, 1, 1]           1,728
         Sigmoid-111            [32, 192, 1, 1]               0
SqueezeExcitation-112          [32, 192, 48, 48]               0
          Conv2d-113           [32, 56, 48, 48]          10,752
     BatchNorm2d-114           [32, 56, 48, 48]             112
InvertedResidualBlock-115           [32, 56, 48, 48]               0
          Conv2d-116          [32, 336, 48, 48]         169,344
     BatchNorm2d-117          [32, 336, 48, 48]             672
            SiLU-118          [32, 336, 48, 48]               0
        CNNBlock-119          [32, 336, 48, 48]               0
          Conv2d-120          [32, 336, 48, 48]           8,400
     BatchNorm2d-121          [32, 336, 48, 48]             672
            SiLU-122          [32, 336, 48, 48]               0
        CNNBlock-123          [32, 336, 48, 48]               0
AdaptiveAvgPool2d-124            [32, 336, 1, 1]               0
          Conv2d-125             [32, 14, 1, 1]           4,718
            SiLU-126             [32, 14, 1, 1]               0
          Conv2d-127            [32, 336, 1, 1]           5,040
         Sigmoid-128            [32, 336, 1, 1]               0
SqueezeExcitation-129          [32, 336, 48, 48]               0
          Conv2d-130           [32, 56, 48, 48]          18,816
     BatchNorm2d-131           [32, 56, 48, 48]             112
InvertedResidualBlock-132           [32, 56, 48, 48]               0
          Conv2d-133          [32, 336, 48, 48]         169,344
     BatchNorm2d-134          [32, 336, 48, 48]             672
            SiLU-135          [32, 336, 48, 48]               0
        CNNBlock-136          [32, 336, 48, 48]               0
          Conv2d-137          [32, 336, 48, 48]           8,400
     BatchNorm2d-138          [32, 336, 48, 48]             672
            SiLU-139          [32, 336, 48, 48]               0
        CNNBlock-140          [32, 336, 48, 48]               0
AdaptiveAvgPool2d-141            [32, 336, 1, 1]               0
          Conv2d-142             [32, 14, 1, 1]           4,718
            SiLU-143             [32, 14, 1, 1]               0
          Conv2d-144            [32, 336, 1, 1]           5,040
         Sigmoid-145            [32, 336, 1, 1]               0
SqueezeExcitation-146          [32, 336, 48, 48]               0
          Conv2d-147           [32, 56, 48, 48]          18,816
     BatchNorm2d-148           [32, 56, 48, 48]             112
InvertedResidualBlock-149           [32, 56, 48, 48]               0
          Conv2d-150          [32, 336, 48, 48]         169,344
     BatchNorm2d-151          [32, 336, 48, 48]             672
            SiLU-152          [32, 336, 48, 48]               0
        CNNBlock-153          [32, 336, 48, 48]               0
          Conv2d-154          [32, 336, 48, 48]           8,400
     BatchNorm2d-155          [32, 336, 48, 48]             672
            SiLU-156          [32, 336, 48, 48]               0
        CNNBlock-157          [32, 336, 48, 48]               0
AdaptiveAvgPool2d-158            [32, 336, 1, 1]               0
          Conv2d-159             [32, 14, 1, 1]           4,718
            SiLU-160             [32, 14, 1, 1]               0
          Conv2d-161            [32, 336, 1, 1]           5,040
         Sigmoid-162            [32, 336, 1, 1]               0
SqueezeExcitation-163          [32, 336, 48, 48]               0
          Conv2d-164           [32, 56, 48, 48]          18,816
     BatchNorm2d-165           [32, 56, 48, 48]             112
InvertedResidualBlock-166           [32, 56, 48, 48]               0
          Conv2d-167          [32, 336, 48, 48]         169,344
     BatchNorm2d-168          [32, 336, 48, 48]             672
            SiLU-169          [32, 336, 48, 48]               0
        CNNBlock-170          [32, 336, 48, 48]               0
          Conv2d-171          [32, 336, 24, 24]           3,024
     BatchNorm2d-172          [32, 336, 24, 24]             672
            SiLU-173          [32, 336, 24, 24]               0
        CNNBlock-174          [32, 336, 24, 24]               0
AdaptiveAvgPool2d-175            [32, 336, 1, 1]               0
          Conv2d-176             [32, 14, 1, 1]           4,718
            SiLU-177             [32, 14, 1, 1]               0
          Conv2d-178            [32, 336, 1, 1]           5,040
         Sigmoid-179            [32, 336, 1, 1]               0
SqueezeExcitation-180          [32, 336, 24, 24]               0
          Conv2d-181          [32, 108, 24, 24]          36,288
     BatchNorm2d-182          [32, 108, 24, 24]             216
InvertedResidualBlock-183          [32, 108, 24, 24]               0
          Conv2d-184          [32, 648, 24, 24]         629,856
     BatchNorm2d-185          [32, 648, 24, 24]           1,296
            SiLU-186          [32, 648, 24, 24]               0
        CNNBlock-187          [32, 648, 24, 24]               0
          Conv2d-188          [32, 648, 24, 24]           5,832
     BatchNorm2d-189          [32, 648, 24, 24]           1,296
            SiLU-190          [32, 648, 24, 24]               0
        CNNBlock-191          [32, 648, 24, 24]               0
AdaptiveAvgPool2d-192            [32, 648, 1, 1]               0
          Conv2d-193             [32, 27, 1, 1]          17,523
            SiLU-194             [32, 27, 1, 1]               0
          Conv2d-195            [32, 648, 1, 1]          18,144
         Sigmoid-196            [32, 648, 1, 1]               0
SqueezeExcitation-197          [32, 648, 24, 24]               0
          Conv2d-198          [32, 108, 24, 24]          69,984
     BatchNorm2d-199          [32, 108, 24, 24]             216
InvertedResidualBlock-200          [32, 108, 24, 24]               0
          Conv2d-201          [32, 648, 24, 24]         629,856
     BatchNorm2d-202          [32, 648, 24, 24]           1,296
            SiLU-203          [32, 648, 24, 24]               0
        CNNBlock-204          [32, 648, 24, 24]               0
          Conv2d-205          [32, 648, 24, 24]           5,832
     BatchNorm2d-206          [32, 648, 24, 24]           1,296
            SiLU-207          [32, 648, 24, 24]               0
        CNNBlock-208          [32, 648, 24, 24]               0
AdaptiveAvgPool2d-209            [32, 648, 1, 1]               0
          Conv2d-210             [32, 27, 1, 1]          17,523
            SiLU-211             [32, 27, 1, 1]               0
          Conv2d-212            [32, 648, 1, 1]          18,144
         Sigmoid-213            [32, 648, 1, 1]               0
SqueezeExcitation-214          [32, 648, 24, 24]               0
          Conv2d-215          [32, 108, 24, 24]          69,984
     BatchNorm2d-216          [32, 108, 24, 24]             216
InvertedResidualBlock-217          [32, 108, 24, 24]               0
          Conv2d-218          [32, 648, 24, 24]         629,856
     BatchNorm2d-219          [32, 648, 24, 24]           1,296
            SiLU-220          [32, 648, 24, 24]               0
        CNNBlock-221          [32, 648, 24, 24]               0
          Conv2d-222          [32, 648, 24, 24]           5,832
     BatchNorm2d-223          [32, 648, 24, 24]           1,296
            SiLU-224          [32, 648, 24, 24]               0
        CNNBlock-225          [32, 648, 24, 24]               0
AdaptiveAvgPool2d-226            [32, 648, 1, 1]               0
          Conv2d-227             [32, 27, 1, 1]          17,523
            SiLU-228             [32, 27, 1, 1]               0
          Conv2d-229            [32, 648, 1, 1]          18,144
         Sigmoid-230            [32, 648, 1, 1]               0
SqueezeExcitation-231          [32, 648, 24, 24]               0
          Conv2d-232          [32, 108, 24, 24]          69,984
     BatchNorm2d-233          [32, 108, 24, 24]             216
InvertedResidualBlock-234          [32, 108, 24, 24]               0
          Conv2d-235          [32, 648, 24, 24]         629,856
     BatchNorm2d-236          [32, 648, 24, 24]           1,296
            SiLU-237          [32, 648, 24, 24]               0
        CNNBlock-238          [32, 648, 24, 24]               0
          Conv2d-239          [32, 648, 24, 24]           5,832
     BatchNorm2d-240          [32, 648, 24, 24]           1,296
            SiLU-241          [32, 648, 24, 24]               0
        CNNBlock-242          [32, 648, 24, 24]               0
AdaptiveAvgPool2d-243            [32, 648, 1, 1]               0
          Conv2d-244             [32, 27, 1, 1]          17,523
            SiLU-245             [32, 27, 1, 1]               0
          Conv2d-246            [32, 648, 1, 1]          18,144
         Sigmoid-247            [32, 648, 1, 1]               0
SqueezeExcitation-248          [32, 648, 24, 24]               0
          Conv2d-249          [32, 108, 24, 24]          69,984
     BatchNorm2d-250          [32, 108, 24, 24]             216
InvertedResidualBlock-251          [32, 108, 24, 24]               0
          Conv2d-252          [32, 648, 24, 24]         629,856
     BatchNorm2d-253          [32, 648, 24, 24]           1,296
            SiLU-254          [32, 648, 24, 24]               0
        CNNBlock-255          [32, 648, 24, 24]               0
          Conv2d-256          [32, 648, 24, 24]           5,832
     BatchNorm2d-257          [32, 648, 24, 24]           1,296
            SiLU-258          [32, 648, 24, 24]               0
        CNNBlock-259          [32, 648, 24, 24]               0
AdaptiveAvgPool2d-260            [32, 648, 1, 1]               0
          Conv2d-261             [32, 27, 1, 1]          17,523
            SiLU-262             [32, 27, 1, 1]               0
          Conv2d-263            [32, 648, 1, 1]          18,144
         Sigmoid-264            [32, 648, 1, 1]               0
SqueezeExcitation-265          [32, 648, 24, 24]               0
          Conv2d-266          [32, 108, 24, 24]          69,984
     BatchNorm2d-267          [32, 108, 24, 24]             216
InvertedResidualBlock-268          [32, 108, 24, 24]               0
          Conv2d-269          [32, 648, 24, 24]         629,856
     BatchNorm2d-270          [32, 648, 24, 24]           1,296
            SiLU-271          [32, 648, 24, 24]               0
        CNNBlock-272          [32, 648, 24, 24]               0
          Conv2d-273          [32, 648, 24, 24]          16,200
     BatchNorm2d-274          [32, 648, 24, 24]           1,296
            SiLU-275          [32, 648, 24, 24]               0
        CNNBlock-276          [32, 648, 24, 24]               0
AdaptiveAvgPool2d-277            [32, 648, 1, 1]               0
          Conv2d-278             [32, 27, 1, 1]          17,523
            SiLU-279             [32, 27, 1, 1]               0
          Conv2d-280            [32, 648, 1, 1]          18,144
         Sigmoid-281            [32, 648, 1, 1]               0
SqueezeExcitation-282          [32, 648, 24, 24]               0
          Conv2d-283          [32, 152, 24, 24]          98,496
     BatchNorm2d-284          [32, 152, 24, 24]             304
InvertedResidualBlock-285          [32, 152, 24, 24]               0
          Conv2d-286          [32, 912, 24, 24]       1,247,616
     BatchNorm2d-287          [32, 912, 24, 24]           1,824
            SiLU-288          [32, 912, 24, 24]               0
        CNNBlock-289          [32, 912, 24, 24]               0
          Conv2d-290          [32, 912, 24, 24]          22,800
     BatchNorm2d-291          [32, 912, 24, 24]           1,824
            SiLU-292          [32, 912, 24, 24]               0
        CNNBlock-293          [32, 912, 24, 24]               0
AdaptiveAvgPool2d-294            [32, 912, 1, 1]               0
          Conv2d-295             [32, 38, 1, 1]          34,694
            SiLU-296             [32, 38, 1, 1]               0
          Conv2d-297            [32, 912, 1, 1]          35,568
         Sigmoid-298            [32, 912, 1, 1]               0
SqueezeExcitation-299          [32, 912, 24, 24]               0
          Conv2d-300          [32, 152, 24, 24]         138,624
     BatchNorm2d-301          [32, 152, 24, 24]             304
InvertedResidualBlock-302          [32, 152, 24, 24]               0
          Conv2d-303          [32, 912, 24, 24]       1,247,616
     BatchNorm2d-304          [32, 912, 24, 24]           1,824
            SiLU-305          [32, 912, 24, 24]               0
        CNNBlock-306          [32, 912, 24, 24]               0
          Conv2d-307          [32, 912, 24, 24]          22,800
     BatchNorm2d-308          [32, 912, 24, 24]           1,824
            SiLU-309          [32, 912, 24, 24]               0
        CNNBlock-310          [32, 912, 24, 24]               0
AdaptiveAvgPool2d-311            [32, 912, 1, 1]               0
          Conv2d-312             [32, 38, 1, 1]          34,694
            SiLU-313             [32, 38, 1, 1]               0
          Conv2d-314            [32, 912, 1, 1]          35,568
         Sigmoid-315            [32, 912, 1, 1]               0
SqueezeExcitation-316          [32, 912, 24, 24]               0
          Conv2d-317          [32, 152, 24, 24]         138,624
     BatchNorm2d-318          [32, 152, 24, 24]             304
InvertedResidualBlock-319          [32, 152, 24, 24]               0
          Conv2d-320          [32, 912, 24, 24]       1,247,616
     BatchNorm2d-321          [32, 912, 24, 24]           1,824
            SiLU-322          [32, 912, 24, 24]               0
        CNNBlock-323          [32, 912, 24, 24]               0
          Conv2d-324          [32, 912, 24, 24]          22,800
     BatchNorm2d-325          [32, 912, 24, 24]           1,824
            SiLU-326          [32, 912, 24, 24]               0
        CNNBlock-327          [32, 912, 24, 24]               0
AdaptiveAvgPool2d-328            [32, 912, 1, 1]               0
          Conv2d-329             [32, 38, 1, 1]          34,694
            SiLU-330             [32, 38, 1, 1]               0
          Conv2d-331            [32, 912, 1, 1]          35,568
         Sigmoid-332            [32, 912, 1, 1]               0
SqueezeExcitation-333          [32, 912, 24, 24]               0
          Conv2d-334          [32, 152, 24, 24]         138,624
     BatchNorm2d-335          [32, 152, 24, 24]             304
InvertedResidualBlock-336          [32, 152, 24, 24]               0
          Conv2d-337          [32, 912, 24, 24]       1,247,616
     BatchNorm2d-338          [32, 912, 24, 24]           1,824
            SiLU-339          [32, 912, 24, 24]               0
        CNNBlock-340          [32, 912, 24, 24]               0
          Conv2d-341          [32, 912, 24, 24]          22,800
     BatchNorm2d-342          [32, 912, 24, 24]           1,824
            SiLU-343          [32, 912, 24, 24]               0
        CNNBlock-344          [32, 912, 24, 24]               0
AdaptiveAvgPool2d-345            [32, 912, 1, 1]               0
          Conv2d-346             [32, 38, 1, 1]          34,694
            SiLU-347             [32, 38, 1, 1]               0
          Conv2d-348            [32, 912, 1, 1]          35,568
         Sigmoid-349            [32, 912, 1, 1]               0
SqueezeExcitation-350          [32, 912, 24, 24]               0
          Conv2d-351          [32, 152, 24, 24]         138,624
     BatchNorm2d-352          [32, 152, 24, 24]             304
InvertedResidualBlock-353          [32, 152, 24, 24]               0
          Conv2d-354          [32, 912, 24, 24]       1,247,616
     BatchNorm2d-355          [32, 912, 24, 24]           1,824
            SiLU-356          [32, 912, 24, 24]               0
        CNNBlock-357          [32, 912, 24, 24]               0
          Conv2d-358          [32, 912, 24, 24]          22,800
     BatchNorm2d-359          [32, 912, 24, 24]           1,824
            SiLU-360          [32, 912, 24, 24]               0
        CNNBlock-361          [32, 912, 24, 24]               0
AdaptiveAvgPool2d-362            [32, 912, 1, 1]               0
          Conv2d-363             [32, 38, 1, 1]          34,694
            SiLU-364             [32, 38, 1, 1]               0
          Conv2d-365            [32, 912, 1, 1]          35,568
         Sigmoid-366            [32, 912, 1, 1]               0
SqueezeExcitation-367          [32, 912, 24, 24]               0
          Conv2d-368          [32, 152, 24, 24]         138,624
     BatchNorm2d-369          [32, 152, 24, 24]             304
InvertedResidualBlock-370          [32, 152, 24, 24]               0
          Conv2d-371          [32, 912, 24, 24]       1,247,616
     BatchNorm2d-372          [32, 912, 24, 24]           1,824
            SiLU-373          [32, 912, 24, 24]               0
        CNNBlock-374          [32, 912, 24, 24]               0
          Conv2d-375          [32, 912, 12, 12]          22,800
     BatchNorm2d-376          [32, 912, 12, 12]           1,824
            SiLU-377          [32, 912, 12, 12]               0
        CNNBlock-378          [32, 912, 12, 12]               0
AdaptiveAvgPool2d-379            [32, 912, 1, 1]               0
          Conv2d-380             [32, 38, 1, 1]          34,694
            SiLU-381             [32, 38, 1, 1]               0
          Conv2d-382            [32, 912, 1, 1]          35,568
         Sigmoid-383            [32, 912, 1, 1]               0
SqueezeExcitation-384          [32, 912, 12, 12]               0
          Conv2d-385          [32, 256, 12, 12]         233,472
     BatchNorm2d-386          [32, 256, 12, 12]             512
InvertedResidualBlock-387          [32, 256, 12, 12]               0
          Conv2d-388         [32, 1536, 12, 12]       3,538,944
     BatchNorm2d-389         [32, 1536, 12, 12]           3,072
            SiLU-390         [32, 1536, 12, 12]               0
        CNNBlock-391         [32, 1536, 12, 12]               0
          Conv2d-392         [32, 1536, 12, 12]          38,400
     BatchNorm2d-393         [32, 1536, 12, 12]           3,072
            SiLU-394         [32, 1536, 12, 12]               0
        CNNBlock-395         [32, 1536, 12, 12]               0
AdaptiveAvgPool2d-396           [32, 1536, 1, 1]               0
          Conv2d-397             [32, 64, 1, 1]          98,368
            SiLU-398             [32, 64, 1, 1]               0
          Conv2d-399           [32, 1536, 1, 1]          99,840
         Sigmoid-400           [32, 1536, 1, 1]               0
SqueezeExcitation-401         [32, 1536, 12, 12]               0
          Conv2d-402          [32, 256, 12, 12]         393,216
     BatchNorm2d-403          [32, 256, 12, 12]             512
InvertedResidualBlock-404          [32, 256, 12, 12]               0
          Conv2d-405         [32, 1536, 12, 12]       3,538,944
     BatchNorm2d-406         [32, 1536, 12, 12]           3,072
            SiLU-407         [32, 1536, 12, 12]               0
        CNNBlock-408         [32, 1536, 12, 12]               0
          Conv2d-409         [32, 1536, 12, 12]          38,400
     BatchNorm2d-410         [32, 1536, 12, 12]           3,072
            SiLU-411         [32, 1536, 12, 12]               0
        CNNBlock-412         [32, 1536, 12, 12]               0
AdaptiveAvgPool2d-413           [32, 1536, 1, 1]               0
          Conv2d-414             [32, 64, 1, 1]          98,368
            SiLU-415             [32, 64, 1, 1]               0
          Conv2d-416           [32, 1536, 1, 1]          99,840
         Sigmoid-417           [32, 1536, 1, 1]               0
SqueezeExcitation-418         [32, 1536, 12, 12]               0
          Conv2d-419          [32, 256, 12, 12]         393,216
     BatchNorm2d-420          [32, 256, 12, 12]             512
InvertedResidualBlock-421          [32, 256, 12, 12]               0
          Conv2d-422         [32, 1536, 12, 12]       3,538,944
     BatchNorm2d-423         [32, 1536, 12, 12]           3,072
            SiLU-424         [32, 1536, 12, 12]               0
        CNNBlock-425         [32, 1536, 12, 12]               0
          Conv2d-426         [32, 1536, 12, 12]          38,400
     BatchNorm2d-427         [32, 1536, 12, 12]           3,072
            SiLU-428         [32, 1536, 12, 12]               0
        CNNBlock-429         [32, 1536, 12, 12]               0
AdaptiveAvgPool2d-430           [32, 1536, 1, 1]               0
          Conv2d-431             [32, 64, 1, 1]          98,368
            SiLU-432             [32, 64, 1, 1]               0
          Conv2d-433           [32, 1536, 1, 1]          99,840
         Sigmoid-434           [32, 1536, 1, 1]               0
SqueezeExcitation-435         [32, 1536, 12, 12]               0
          Conv2d-436          [32, 256, 12, 12]         393,216
     BatchNorm2d-437          [32, 256, 12, 12]             512
InvertedResidualBlock-438          [32, 256, 12, 12]               0
          Conv2d-439         [32, 1536, 12, 12]       3,538,944
     BatchNorm2d-440         [32, 1536, 12, 12]           3,072
            SiLU-441         [32, 1536, 12, 12]               0
        CNNBlock-442         [32, 1536, 12, 12]               0
          Conv2d-443         [32, 1536, 12, 12]          38,400
     BatchNorm2d-444         [32, 1536, 12, 12]           3,072
            SiLU-445         [32, 1536, 12, 12]               0
        CNNBlock-446         [32, 1536, 12, 12]               0
AdaptiveAvgPool2d-447           [32, 1536, 1, 1]               0
          Conv2d-448             [32, 64, 1, 1]          98,368
            SiLU-449             [32, 64, 1, 1]               0
          Conv2d-450           [32, 1536, 1, 1]          99,840
         Sigmoid-451           [32, 1536, 1, 1]               0
SqueezeExcitation-452         [32, 1536, 12, 12]               0
          Conv2d-453          [32, 256, 12, 12]         393,216
     BatchNorm2d-454          [32, 256, 12, 12]             512
InvertedResidualBlock-455          [32, 256, 12, 12]               0
          Conv2d-456         [32, 1536, 12, 12]       3,538,944
     BatchNorm2d-457         [32, 1536, 12, 12]           3,072
            SiLU-458         [32, 1536, 12, 12]               0
        CNNBlock-459         [32, 1536, 12, 12]               0
          Conv2d-460         [32, 1536, 12, 12]          38,400
     BatchNorm2d-461         [32, 1536, 12, 12]           3,072
            SiLU-462         [32, 1536, 12, 12]               0
        CNNBlock-463         [32, 1536, 12, 12]               0
AdaptiveAvgPool2d-464           [32, 1536, 1, 1]               0
          Conv2d-465             [32, 64, 1, 1]          98,368
            SiLU-466             [32, 64, 1, 1]               0
          Conv2d-467           [32, 1536, 1, 1]          99,840
         Sigmoid-468           [32, 1536, 1, 1]               0
SqueezeExcitation-469         [32, 1536, 12, 12]               0
          Conv2d-470          [32, 256, 12, 12]         393,216
     BatchNorm2d-471          [32, 256, 12, 12]             512
InvertedResidualBlock-472          [32, 256, 12, 12]               0
          Conv2d-473         [32, 1536, 12, 12]       3,538,944
     BatchNorm2d-474         [32, 1536, 12, 12]           3,072
            SiLU-475         [32, 1536, 12, 12]               0
        CNNBlock-476         [32, 1536, 12, 12]               0
          Conv2d-477         [32, 1536, 12, 12]          38,400
     BatchNorm2d-478         [32, 1536, 12, 12]           3,072
            SiLU-479         [32, 1536, 12, 12]               0
        CNNBlock-480         [32, 1536, 12, 12]               0
AdaptiveAvgPool2d-481           [32, 1536, 1, 1]               0
          Conv2d-482             [32, 64, 1, 1]          98,368
            SiLU-483             [32, 64, 1, 1]               0
          Conv2d-484           [32, 1536, 1, 1]          99,840
         Sigmoid-485           [32, 1536, 1, 1]               0
SqueezeExcitation-486         [32, 1536, 12, 12]               0
          Conv2d-487          [32, 256, 12, 12]         393,216
     BatchNorm2d-488          [32, 256, 12, 12]             512
InvertedResidualBlock-489          [32, 256, 12, 12]               0
          Conv2d-490         [32, 1536, 12, 12]       3,538,944
     BatchNorm2d-491         [32, 1536, 12, 12]           3,072
            SiLU-492         [32, 1536, 12, 12]               0
        CNNBlock-493         [32, 1536, 12, 12]               0
          Conv2d-494         [32, 1536, 12, 12]          13,824
     BatchNorm2d-495         [32, 1536, 12, 12]           3,072
            SiLU-496         [32, 1536, 12, 12]               0
        CNNBlock-497         [32, 1536, 12, 12]               0
AdaptiveAvgPool2d-498           [32, 1536, 1, 1]               0
          Conv2d-499             [32, 64, 1, 1]          98,368
            SiLU-500             [32, 64, 1, 1]               0
          Conv2d-501           [32, 1536, 1, 1]          99,840
         Sigmoid-502           [32, 1536, 1, 1]               0
SqueezeExcitation-503         [32, 1536, 12, 12]               0
          Conv2d-504          [32, 428, 12, 12]         657,408
     BatchNorm2d-505          [32, 428, 12, 12]             856
InvertedResidualBlock-506          [32, 428, 12, 12]               0
          Conv2d-507         [32, 2568, 12, 12]       9,891,936
     BatchNorm2d-508         [32, 2568, 12, 12]           5,136
            SiLU-509         [32, 2568, 12, 12]               0
        CNNBlock-510         [32, 2568, 12, 12]               0
          Conv2d-511         [32, 2568, 12, 12]          23,112
     BatchNorm2d-512         [32, 2568, 12, 12]           5,136
            SiLU-513         [32, 2568, 12, 12]               0
        CNNBlock-514         [32, 2568, 12, 12]               0
AdaptiveAvgPool2d-515           [32, 2568, 1, 1]               0
          Conv2d-516            [32, 107, 1, 1]         274,883
            SiLU-517            [32, 107, 1, 1]               0
          Conv2d-518           [32, 2568, 1, 1]         277,344
         Sigmoid-519           [32, 2568, 1, 1]               0
SqueezeExcitation-520         [32, 2568, 12, 12]               0
          Conv2d-521          [32, 428, 12, 12]       1,099,104
     BatchNorm2d-522          [32, 428, 12, 12]             856
InvertedResidualBlock-523          [32, 428, 12, 12]               0
          Conv2d-524         [32, 1704, 12, 12]         729,312
     BatchNorm2d-525         [32, 1704, 12, 12]           3,408
            SiLU-526         [32, 1704, 12, 12]               0
        CNNBlock-527         [32, 1704, 12, 12]               0
AdaptiveAvgPool2d-528           [32, 1704, 1, 1]               0
         Flatten-529                 [32, 1704]               0
         Dropout-530                 [32, 1704]               0
          Linear-531                    [32, 2]           3,410
    EfficientNet-532                    [32, 2]               0
================================================================
Total params: 56,444,467
Trainable params: 56,444,467
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 52.88
Forward/backward pass size (MB): 50071.99
Params size (MB): 215.32
Estimated Total Size (MB): 50340.19
----------------------------------------------------------------

