EfficientNetB6----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [32, 51, 264, 264]           1,377
       BatchNorm2d-2         [32, 51, 264, 264]             102
              SiLU-3         [32, 51, 264, 264]               0
          CNNBlock-4         [32, 51, 264, 264]               0
            Conv2d-5         [32, 51, 264, 264]             459
       BatchNorm2d-6         [32, 51, 264, 264]             102
              SiLU-7         [32, 51, 264, 264]               0
          CNNBlock-8         [32, 51, 264, 264]               0
 AdaptiveAvgPool2d-9             [32, 51, 1, 1]               0
           Conv2d-10             [32, 12, 1, 1]             624
             SiLU-11             [32, 12, 1, 1]               0
           Conv2d-12             [32, 51, 1, 1]             663
          Sigmoid-13             [32, 51, 1, 1]               0
SqueezeExcitation-14         [32, 51, 264, 264]               0
           Conv2d-15         [32, 28, 264, 264]           1,428
      BatchNorm2d-16         [32, 28, 264, 264]              56
InvertedResidualBlock-17         [32, 28, 264, 264]               0
           Conv2d-18         [32, 28, 264, 264]             252
      BatchNorm2d-19         [32, 28, 264, 264]              56
             SiLU-20         [32, 28, 264, 264]               0
         CNNBlock-21         [32, 28, 264, 264]               0
AdaptiveAvgPool2d-22             [32, 28, 1, 1]               0
           Conv2d-23              [32, 7, 1, 1]             203
             SiLU-24              [32, 7, 1, 1]               0
           Conv2d-25             [32, 28, 1, 1]             224
          Sigmoid-26             [32, 28, 1, 1]               0
SqueezeExcitation-27         [32, 28, 264, 264]               0
           Conv2d-28         [32, 28, 264, 264]             784
      BatchNorm2d-29         [32, 28, 264, 264]              56
InvertedResidualBlock-30         [32, 28, 264, 264]               0
           Conv2d-31         [32, 28, 264, 264]             252
      BatchNorm2d-32         [32, 28, 264, 264]              56
             SiLU-33         [32, 28, 264, 264]               0
         CNNBlock-34         [32, 28, 264, 264]               0
AdaptiveAvgPool2d-35             [32, 28, 1, 1]               0
           Conv2d-36              [32, 7, 1, 1]             203
             SiLU-37              [32, 7, 1, 1]               0
           Conv2d-38             [32, 28, 1, 1]             224
          Sigmoid-39             [32, 28, 1, 1]               0
SqueezeExcitation-40         [32, 28, 264, 264]               0
           Conv2d-41         [32, 28, 264, 264]             784
      BatchNorm2d-42         [32, 28, 264, 264]              56
InvertedResidualBlock-43         [32, 28, 264, 264]               0
           Conv2d-44        [32, 168, 264, 264]          42,336
      BatchNorm2d-45        [32, 168, 264, 264]             336
             SiLU-46        [32, 168, 264, 264]               0
         CNNBlock-47        [32, 168, 264, 264]               0
           Conv2d-48        [32, 168, 132, 132]           1,512
      BatchNorm2d-49        [32, 168, 132, 132]             336
             SiLU-50        [32, 168, 132, 132]               0
         CNNBlock-51        [32, 168, 132, 132]               0
AdaptiveAvgPool2d-52            [32, 168, 1, 1]               0
           Conv2d-53              [32, 7, 1, 1]           1,183
             SiLU-54              [32, 7, 1, 1]               0
           Conv2d-55            [32, 168, 1, 1]           1,344
          Sigmoid-56            [32, 168, 1, 1]               0
SqueezeExcitation-57        [32, 168, 132, 132]               0
           Conv2d-58         [32, 40, 132, 132]           6,720
      BatchNorm2d-59         [32, 40, 132, 132]              80
InvertedResidualBlock-60         [32, 40, 132, 132]               0
           Conv2d-61        [32, 240, 132, 132]          86,400
      BatchNorm2d-62        [32, 240, 132, 132]             480
             SiLU-63        [32, 240, 132, 132]               0
         CNNBlock-64        [32, 240, 132, 132]               0
           Conv2d-65        [32, 240, 132, 132]           2,160
      BatchNorm2d-66        [32, 240, 132, 132]             480
             SiLU-67        [32, 240, 132, 132]               0
         CNNBlock-68        [32, 240, 132, 132]               0
AdaptiveAvgPool2d-69            [32, 240, 1, 1]               0
           Conv2d-70             [32, 10, 1, 1]           2,410
             SiLU-71             [32, 10, 1, 1]               0
           Conv2d-72            [32, 240, 1, 1]           2,640
          Sigmoid-73            [32, 240, 1, 1]               0
SqueezeExcitation-74        [32, 240, 132, 132]               0
           Conv2d-75         [32, 40, 132, 132]           9,600
      BatchNorm2d-76         [32, 40, 132, 132]              80
InvertedResidualBlock-77         [32, 40, 132, 132]               0
           Conv2d-78        [32, 240, 132, 132]          86,400
      BatchNorm2d-79        [32, 240, 132, 132]             480
             SiLU-80        [32, 240, 132, 132]               0
         CNNBlock-81        [32, 240, 132, 132]               0
           Conv2d-82        [32, 240, 132, 132]           2,160
      BatchNorm2d-83        [32, 240, 132, 132]             480
             SiLU-84        [32, 240, 132, 132]               0
         CNNBlock-85        [32, 240, 132, 132]               0
AdaptiveAvgPool2d-86            [32, 240, 1, 1]               0
           Conv2d-87             [32, 10, 1, 1]           2,410
             SiLU-88             [32, 10, 1, 1]               0
           Conv2d-89            [32, 240, 1, 1]           2,640
          Sigmoid-90            [32, 240, 1, 1]               0
SqueezeExcitation-91        [32, 240, 132, 132]               0
           Conv2d-92         [32, 40, 132, 132]           9,600
      BatchNorm2d-93         [32, 40, 132, 132]              80
InvertedResidualBlock-94         [32, 40, 132, 132]               0
           Conv2d-95        [32, 240, 132, 132]          86,400
      BatchNorm2d-96        [32, 240, 132, 132]             480
             SiLU-97        [32, 240, 132, 132]               0
         CNNBlock-98        [32, 240, 132, 132]               0
           Conv2d-99        [32, 240, 132, 132]           2,160
     BatchNorm2d-100        [32, 240, 132, 132]             480
            SiLU-101        [32, 240, 132, 132]               0
        CNNBlock-102        [32, 240, 132, 132]               0
AdaptiveAvgPool2d-103            [32, 240, 1, 1]               0
          Conv2d-104             [32, 10, 1, 1]           2,410
            SiLU-105             [32, 10, 1, 1]               0
          Conv2d-106            [32, 240, 1, 1]           2,640
         Sigmoid-107            [32, 240, 1, 1]               0
SqueezeExcitation-108        [32, 240, 132, 132]               0
          Conv2d-109         [32, 40, 132, 132]           9,600
     BatchNorm2d-110         [32, 40, 132, 132]              80
InvertedResidualBlock-111         [32, 40, 132, 132]               0
          Conv2d-112        [32, 240, 132, 132]          86,400
     BatchNorm2d-113        [32, 240, 132, 132]             480
            SiLU-114        [32, 240, 132, 132]               0
        CNNBlock-115        [32, 240, 132, 132]               0
          Conv2d-116        [32, 240, 132, 132]           2,160
     BatchNorm2d-117        [32, 240, 132, 132]             480
            SiLU-118        [32, 240, 132, 132]               0
        CNNBlock-119        [32, 240, 132, 132]               0
AdaptiveAvgPool2d-120            [32, 240, 1, 1]               0
          Conv2d-121             [32, 10, 1, 1]           2,410
            SiLU-122             [32, 10, 1, 1]               0
          Conv2d-123            [32, 240, 1, 1]           2,640
         Sigmoid-124            [32, 240, 1, 1]               0
SqueezeExcitation-125        [32, 240, 132, 132]               0
          Conv2d-126         [32, 40, 132, 132]           9,600
     BatchNorm2d-127         [32, 40, 132, 132]              80
InvertedResidualBlock-128         [32, 40, 132, 132]               0
          Conv2d-129        [32, 240, 132, 132]          86,400
     BatchNorm2d-130        [32, 240, 132, 132]             480
            SiLU-131        [32, 240, 132, 132]               0
        CNNBlock-132        [32, 240, 132, 132]               0
          Conv2d-133          [32, 240, 66, 66]           6,000
     BatchNorm2d-134          [32, 240, 66, 66]             480
            SiLU-135          [32, 240, 66, 66]               0
        CNNBlock-136          [32, 240, 66, 66]               0
AdaptiveAvgPool2d-137            [32, 240, 1, 1]               0
          Conv2d-138             [32, 10, 1, 1]           2,410
            SiLU-139             [32, 10, 1, 1]               0
          Conv2d-140            [32, 240, 1, 1]           2,640
         Sigmoid-141            [32, 240, 1, 1]               0
SqueezeExcitation-142          [32, 240, 66, 66]               0
          Conv2d-143           [32, 64, 66, 66]          15,360
     BatchNorm2d-144           [32, 64, 66, 66]             128
InvertedResidualBlock-145           [32, 64, 66, 66]               0
          Conv2d-146          [32, 384, 66, 66]         221,184
     BatchNorm2d-147          [32, 384, 66, 66]             768
            SiLU-148          [32, 384, 66, 66]               0
        CNNBlock-149          [32, 384, 66, 66]               0
          Conv2d-150          [32, 384, 66, 66]           9,600
     BatchNorm2d-151          [32, 384, 66, 66]             768
            SiLU-152          [32, 384, 66, 66]               0
        CNNBlock-153          [32, 384, 66, 66]               0
AdaptiveAvgPool2d-154            [32, 384, 1, 1]               0
          Conv2d-155             [32, 16, 1, 1]           6,160
            SiLU-156             [32, 16, 1, 1]               0
          Conv2d-157            [32, 384, 1, 1]           6,528
         Sigmoid-158            [32, 384, 1, 1]               0
SqueezeExcitation-159          [32, 384, 66, 66]               0
          Conv2d-160           [32, 64, 66, 66]          24,576
     BatchNorm2d-161           [32, 64, 66, 66]             128
InvertedResidualBlock-162           [32, 64, 66, 66]               0
          Conv2d-163          [32, 384, 66, 66]         221,184
     BatchNorm2d-164          [32, 384, 66, 66]             768
            SiLU-165          [32, 384, 66, 66]               0
        CNNBlock-166          [32, 384, 66, 66]               0
          Conv2d-167          [32, 384, 66, 66]           9,600
     BatchNorm2d-168          [32, 384, 66, 66]             768
            SiLU-169          [32, 384, 66, 66]               0
        CNNBlock-170          [32, 384, 66, 66]               0
AdaptiveAvgPool2d-171            [32, 384, 1, 1]               0
          Conv2d-172             [32, 16, 1, 1]           6,160
            SiLU-173             [32, 16, 1, 1]               0
          Conv2d-174            [32, 384, 1, 1]           6,528
         Sigmoid-175            [32, 384, 1, 1]               0
SqueezeExcitation-176          [32, 384, 66, 66]               0
          Conv2d-177           [32, 64, 66, 66]          24,576
     BatchNorm2d-178           [32, 64, 66, 66]             128
InvertedResidualBlock-179           [32, 64, 66, 66]               0
          Conv2d-180          [32, 384, 66, 66]         221,184
     BatchNorm2d-181          [32, 384, 66, 66]             768
            SiLU-182          [32, 384, 66, 66]               0
        CNNBlock-183          [32, 384, 66, 66]               0
          Conv2d-184          [32, 384, 66, 66]           9,600
     BatchNorm2d-185          [32, 384, 66, 66]             768
            SiLU-186          [32, 384, 66, 66]               0
        CNNBlock-187          [32, 384, 66, 66]               0
AdaptiveAvgPool2d-188            [32, 384, 1, 1]               0
          Conv2d-189             [32, 16, 1, 1]           6,160
            SiLU-190             [32, 16, 1, 1]               0
          Conv2d-191            [32, 384, 1, 1]           6,528
         Sigmoid-192            [32, 384, 1, 1]               0
SqueezeExcitation-193          [32, 384, 66, 66]               0
          Conv2d-194           [32, 64, 66, 66]          24,576
     BatchNorm2d-195           [32, 64, 66, 66]             128
InvertedResidualBlock-196           [32, 64, 66, 66]               0
          Conv2d-197          [32, 384, 66, 66]         221,184
     BatchNorm2d-198          [32, 384, 66, 66]             768
            SiLU-199          [32, 384, 66, 66]               0
        CNNBlock-200          [32, 384, 66, 66]               0
          Conv2d-201          [32, 384, 66, 66]           9,600
     BatchNorm2d-202          [32, 384, 66, 66]             768
            SiLU-203          [32, 384, 66, 66]               0
        CNNBlock-204          [32, 384, 66, 66]               0
AdaptiveAvgPool2d-205            [32, 384, 1, 1]               0
          Conv2d-206             [32, 16, 1, 1]           6,160
            SiLU-207             [32, 16, 1, 1]               0
          Conv2d-208            [32, 384, 1, 1]           6,528
         Sigmoid-209            [32, 384, 1, 1]               0
SqueezeExcitation-210          [32, 384, 66, 66]               0
          Conv2d-211           [32, 64, 66, 66]          24,576
     BatchNorm2d-212           [32, 64, 66, 66]             128
InvertedResidualBlock-213           [32, 64, 66, 66]               0
          Conv2d-214          [32, 384, 66, 66]         221,184
     BatchNorm2d-215          [32, 384, 66, 66]             768
            SiLU-216          [32, 384, 66, 66]               0
        CNNBlock-217          [32, 384, 66, 66]               0
          Conv2d-218          [32, 384, 33, 33]           3,456
     BatchNorm2d-219          [32, 384, 33, 33]             768
            SiLU-220          [32, 384, 33, 33]               0
        CNNBlock-221          [32, 384, 33, 33]               0
AdaptiveAvgPool2d-222            [32, 384, 1, 1]               0
          Conv2d-223             [32, 16, 1, 1]           6,160
            SiLU-224             [32, 16, 1, 1]               0
          Conv2d-225            [32, 384, 1, 1]           6,528
         Sigmoid-226            [32, 384, 1, 1]               0
SqueezeExcitation-227          [32, 384, 33, 33]               0
          Conv2d-228          [32, 128, 33, 33]          49,152
     BatchNorm2d-229          [32, 128, 33, 33]             256
InvertedResidualBlock-230          [32, 128, 33, 33]               0
          Conv2d-231          [32, 768, 33, 33]         884,736
     BatchNorm2d-232          [32, 768, 33, 33]           1,536
            SiLU-233          [32, 768, 33, 33]               0
        CNNBlock-234          [32, 768, 33, 33]               0
          Conv2d-235          [32, 768, 33, 33]           6,912
     BatchNorm2d-236          [32, 768, 33, 33]           1,536
            SiLU-237          [32, 768, 33, 33]               0
        CNNBlock-238          [32, 768, 33, 33]               0
AdaptiveAvgPool2d-239            [32, 768, 1, 1]               0
          Conv2d-240             [32, 32, 1, 1]          24,608
            SiLU-241             [32, 32, 1, 1]               0
          Conv2d-242            [32, 768, 1, 1]          25,344
         Sigmoid-243            [32, 768, 1, 1]               0
SqueezeExcitation-244          [32, 768, 33, 33]               0
          Conv2d-245          [32, 128, 33, 33]          98,304
     BatchNorm2d-246          [32, 128, 33, 33]             256
InvertedResidualBlock-247          [32, 128, 33, 33]               0
          Conv2d-248          [32, 768, 33, 33]         884,736
     BatchNorm2d-249          [32, 768, 33, 33]           1,536
            SiLU-250          [32, 768, 33, 33]               0
        CNNBlock-251          [32, 768, 33, 33]               0
          Conv2d-252          [32, 768, 33, 33]           6,912
     BatchNorm2d-253          [32, 768, 33, 33]           1,536
            SiLU-254          [32, 768, 33, 33]               0
        CNNBlock-255          [32, 768, 33, 33]               0
AdaptiveAvgPool2d-256            [32, 768, 1, 1]               0
          Conv2d-257             [32, 32, 1, 1]          24,608
            SiLU-258             [32, 32, 1, 1]               0
          Conv2d-259            [32, 768, 1, 1]          25,344
         Sigmoid-260            [32, 768, 1, 1]               0
SqueezeExcitation-261          [32, 768, 33, 33]               0
          Conv2d-262          [32, 128, 33, 33]          98,304
     BatchNorm2d-263          [32, 128, 33, 33]             256
InvertedResidualBlock-264          [32, 128, 33, 33]               0
          Conv2d-265          [32, 768, 33, 33]         884,736
     BatchNorm2d-266          [32, 768, 33, 33]           1,536
            SiLU-267          [32, 768, 33, 33]               0
        CNNBlock-268          [32, 768, 33, 33]               0
          Conv2d-269          [32, 768, 33, 33]           6,912
     BatchNorm2d-270          [32, 768, 33, 33]           1,536
            SiLU-271          [32, 768, 33, 33]               0
        CNNBlock-272          [32, 768, 33, 33]               0
AdaptiveAvgPool2d-273            [32, 768, 1, 1]               0
          Conv2d-274             [32, 32, 1, 1]          24,608
            SiLU-275             [32, 32, 1, 1]               0
          Conv2d-276            [32, 768, 1, 1]          25,344
         Sigmoid-277            [32, 768, 1, 1]               0
SqueezeExcitation-278          [32, 768, 33, 33]               0
          Conv2d-279          [32, 128, 33, 33]          98,304
     BatchNorm2d-280          [32, 128, 33, 33]             256
InvertedResidualBlock-281          [32, 128, 33, 33]               0
          Conv2d-282          [32, 768, 33, 33]         884,736
     BatchNorm2d-283          [32, 768, 33, 33]           1,536
            SiLU-284          [32, 768, 33, 33]               0
        CNNBlock-285          [32, 768, 33, 33]               0
          Conv2d-286          [32, 768, 33, 33]           6,912
     BatchNorm2d-287          [32, 768, 33, 33]           1,536
            SiLU-288          [32, 768, 33, 33]               0
        CNNBlock-289          [32, 768, 33, 33]               0
AdaptiveAvgPool2d-290            [32, 768, 1, 1]               0
          Conv2d-291             [32, 32, 1, 1]          24,608
            SiLU-292             [32, 32, 1, 1]               0
          Conv2d-293            [32, 768, 1, 1]          25,344
         Sigmoid-294            [32, 768, 1, 1]               0
SqueezeExcitation-295          [32, 768, 33, 33]               0
          Conv2d-296          [32, 128, 33, 33]          98,304
     BatchNorm2d-297          [32, 128, 33, 33]             256
InvertedResidualBlock-298          [32, 128, 33, 33]               0
          Conv2d-299          [32, 768, 33, 33]         884,736
     BatchNorm2d-300          [32, 768, 33, 33]           1,536
            SiLU-301          [32, 768, 33, 33]               0
        CNNBlock-302          [32, 768, 33, 33]               0
          Conv2d-303          [32, 768, 33, 33]           6,912
     BatchNorm2d-304          [32, 768, 33, 33]           1,536
            SiLU-305          [32, 768, 33, 33]               0
        CNNBlock-306          [32, 768, 33, 33]               0
AdaptiveAvgPool2d-307            [32, 768, 1, 1]               0
          Conv2d-308             [32, 32, 1, 1]          24,608
            SiLU-309             [32, 32, 1, 1]               0
          Conv2d-310            [32, 768, 1, 1]          25,344
         Sigmoid-311            [32, 768, 1, 1]               0
SqueezeExcitation-312          [32, 768, 33, 33]               0
          Conv2d-313          [32, 128, 33, 33]          98,304
     BatchNorm2d-314          [32, 128, 33, 33]             256
InvertedResidualBlock-315          [32, 128, 33, 33]               0
          Conv2d-316          [32, 768, 33, 33]         884,736
     BatchNorm2d-317          [32, 768, 33, 33]           1,536
            SiLU-318          [32, 768, 33, 33]               0
        CNNBlock-319          [32, 768, 33, 33]               0
          Conv2d-320          [32, 768, 33, 33]           6,912
     BatchNorm2d-321          [32, 768, 33, 33]           1,536
            SiLU-322          [32, 768, 33, 33]               0
        CNNBlock-323          [32, 768, 33, 33]               0
AdaptiveAvgPool2d-324            [32, 768, 1, 1]               0
          Conv2d-325             [32, 32, 1, 1]          24,608
            SiLU-326             [32, 32, 1, 1]               0
          Conv2d-327            [32, 768, 1, 1]          25,344
         Sigmoid-328            [32, 768, 1, 1]               0
SqueezeExcitation-329          [32, 768, 33, 33]               0
          Conv2d-330          [32, 128, 33, 33]          98,304
     BatchNorm2d-331          [32, 128, 33, 33]             256
InvertedResidualBlock-332          [32, 128, 33, 33]               0
          Conv2d-333          [32, 768, 33, 33]         884,736
     BatchNorm2d-334          [32, 768, 33, 33]           1,536
            SiLU-335          [32, 768, 33, 33]               0
        CNNBlock-336          [32, 768, 33, 33]               0
          Conv2d-337          [32, 768, 33, 33]           6,912
     BatchNorm2d-338          [32, 768, 33, 33]           1,536
            SiLU-339          [32, 768, 33, 33]               0
        CNNBlock-340          [32, 768, 33, 33]               0
AdaptiveAvgPool2d-341            [32, 768, 1, 1]               0
          Conv2d-342             [32, 32, 1, 1]          24,608
            SiLU-343             [32, 32, 1, 1]               0
          Conv2d-344            [32, 768, 1, 1]          25,344
         Sigmoid-345            [32, 768, 1, 1]               0
SqueezeExcitation-346          [32, 768, 33, 33]               0
          Conv2d-347          [32, 128, 33, 33]          98,304
     BatchNorm2d-348          [32, 128, 33, 33]             256
InvertedResidualBlock-349          [32, 128, 33, 33]               0
          Conv2d-350          [32, 768, 33, 33]         884,736
     BatchNorm2d-351          [32, 768, 33, 33]           1,536
            SiLU-352          [32, 768, 33, 33]               0
        CNNBlock-353          [32, 768, 33, 33]               0
          Conv2d-354          [32, 768, 33, 33]          19,200
     BatchNorm2d-355          [32, 768, 33, 33]           1,536
            SiLU-356          [32, 768, 33, 33]               0
        CNNBlock-357          [32, 768, 33, 33]               0
AdaptiveAvgPool2d-358            [32, 768, 1, 1]               0
          Conv2d-359             [32, 32, 1, 1]          24,608
            SiLU-360             [32, 32, 1, 1]               0
          Conv2d-361            [32, 768, 1, 1]          25,344
         Sigmoid-362            [32, 768, 1, 1]               0
SqueezeExcitation-363          [32, 768, 33, 33]               0
          Conv2d-364          [32, 180, 33, 33]         138,240
     BatchNorm2d-365          [32, 180, 33, 33]             360
InvertedResidualBlock-366          [32, 180, 33, 33]               0
          Conv2d-367         [32, 1080, 33, 33]       1,749,600
     BatchNorm2d-368         [32, 1080, 33, 33]           2,160
            SiLU-369         [32, 1080, 33, 33]               0
        CNNBlock-370         [32, 1080, 33, 33]               0
          Conv2d-371         [32, 1080, 33, 33]          27,000
     BatchNorm2d-372         [32, 1080, 33, 33]           2,160
            SiLU-373         [32, 1080, 33, 33]               0
        CNNBlock-374         [32, 1080, 33, 33]               0
AdaptiveAvgPool2d-375           [32, 1080, 1, 1]               0
          Conv2d-376             [32, 45, 1, 1]          48,645
            SiLU-377             [32, 45, 1, 1]               0
          Conv2d-378           [32, 1080, 1, 1]          49,680
         Sigmoid-379           [32, 1080, 1, 1]               0
SqueezeExcitation-380         [32, 1080, 33, 33]               0
          Conv2d-381          [32, 180, 33, 33]         194,400
     BatchNorm2d-382          [32, 180, 33, 33]             360
InvertedResidualBlock-383          [32, 180, 33, 33]               0
          Conv2d-384         [32, 1080, 33, 33]       1,749,600
     BatchNorm2d-385         [32, 1080, 33, 33]           2,160
            SiLU-386         [32, 1080, 33, 33]               0
        CNNBlock-387         [32, 1080, 33, 33]               0
          Conv2d-388         [32, 1080, 33, 33]          27,000
     BatchNorm2d-389         [32, 1080, 33, 33]           2,160
            SiLU-390         [32, 1080, 33, 33]               0
        CNNBlock-391         [32, 1080, 33, 33]               0
AdaptiveAvgPool2d-392           [32, 1080, 1, 1]               0
          Conv2d-393             [32, 45, 1, 1]          48,645
            SiLU-394             [32, 45, 1, 1]               0
          Conv2d-395           [32, 1080, 1, 1]          49,680
         Sigmoid-396           [32, 1080, 1, 1]               0
SqueezeExcitation-397         [32, 1080, 33, 33]               0
          Conv2d-398          [32, 180, 33, 33]         194,400
     BatchNorm2d-399          [32, 180, 33, 33]             360
InvertedResidualBlock-400          [32, 180, 33, 33]               0
          Conv2d-401         [32, 1080, 33, 33]       1,749,600
     BatchNorm2d-402         [32, 1080, 33, 33]           2,160
            SiLU-403         [32, 1080, 33, 33]               0
        CNNBlock-404         [32, 1080, 33, 33]               0
          Conv2d-405         [32, 1080, 33, 33]          27,000
     BatchNorm2d-406         [32, 1080, 33, 33]           2,160
            SiLU-407         [32, 1080, 33, 33]               0
        CNNBlock-408         [32, 1080, 33, 33]               0
AdaptiveAvgPool2d-409           [32, 1080, 1, 1]               0
          Conv2d-410             [32, 45, 1, 1]          48,645
            SiLU-411             [32, 45, 1, 1]               0
          Conv2d-412           [32, 1080, 1, 1]          49,680
         Sigmoid-413           [32, 1080, 1, 1]               0
SqueezeExcitation-414         [32, 1080, 33, 33]               0
          Conv2d-415          [32, 180, 33, 33]         194,400
     BatchNorm2d-416          [32, 180, 33, 33]             360
InvertedResidualBlock-417          [32, 180, 33, 33]               0
          Conv2d-418         [32, 1080, 33, 33]       1,749,600
     BatchNorm2d-419         [32, 1080, 33, 33]           2,160
            SiLU-420         [32, 1080, 33, 33]               0
        CNNBlock-421         [32, 1080, 33, 33]               0
          Conv2d-422         [32, 1080, 33, 33]          27,000
     BatchNorm2d-423         [32, 1080, 33, 33]           2,160
            SiLU-424         [32, 1080, 33, 33]               0
        CNNBlock-425         [32, 1080, 33, 33]               0
AdaptiveAvgPool2d-426           [32, 1080, 1, 1]               0
          Conv2d-427             [32, 45, 1, 1]          48,645
            SiLU-428             [32, 45, 1, 1]               0
          Conv2d-429           [32, 1080, 1, 1]          49,680
         Sigmoid-430           [32, 1080, 1, 1]               0
SqueezeExcitation-431         [32, 1080, 33, 33]               0
          Conv2d-432          [32, 180, 33, 33]         194,400
     BatchNorm2d-433          [32, 180, 33, 33]             360
InvertedResidualBlock-434          [32, 180, 33, 33]               0
          Conv2d-435         [32, 1080, 33, 33]       1,749,600
     BatchNorm2d-436         [32, 1080, 33, 33]           2,160
            SiLU-437         [32, 1080, 33, 33]               0
        CNNBlock-438         [32, 1080, 33, 33]               0
          Conv2d-439         [32, 1080, 33, 33]          27,000
     BatchNorm2d-440         [32, 1080, 33, 33]           2,160
            SiLU-441         [32, 1080, 33, 33]               0
        CNNBlock-442         [32, 1080, 33, 33]               0
AdaptiveAvgPool2d-443           [32, 1080, 1, 1]               0
          Conv2d-444             [32, 45, 1, 1]          48,645
            SiLU-445             [32, 45, 1, 1]               0
          Conv2d-446           [32, 1080, 1, 1]          49,680
         Sigmoid-447           [32, 1080, 1, 1]               0
SqueezeExcitation-448         [32, 1080, 33, 33]               0
          Conv2d-449          [32, 180, 33, 33]         194,400
     BatchNorm2d-450          [32, 180, 33, 33]             360
InvertedResidualBlock-451          [32, 180, 33, 33]               0
          Conv2d-452         [32, 1080, 33, 33]       1,749,600
     BatchNorm2d-453         [32, 1080, 33, 33]           2,160
            SiLU-454         [32, 1080, 33, 33]               0
        CNNBlock-455         [32, 1080, 33, 33]               0
          Conv2d-456         [32, 1080, 33, 33]          27,000
     BatchNorm2d-457         [32, 1080, 33, 33]           2,160
            SiLU-458         [32, 1080, 33, 33]               0
        CNNBlock-459         [32, 1080, 33, 33]               0
AdaptiveAvgPool2d-460           [32, 1080, 1, 1]               0
          Conv2d-461             [32, 45, 1, 1]          48,645
            SiLU-462             [32, 45, 1, 1]               0
          Conv2d-463           [32, 1080, 1, 1]          49,680
         Sigmoid-464           [32, 1080, 1, 1]               0
SqueezeExcitation-465         [32, 1080, 33, 33]               0
          Conv2d-466          [32, 180, 33, 33]         194,400
     BatchNorm2d-467          [32, 180, 33, 33]             360
InvertedResidualBlock-468          [32, 180, 33, 33]               0
          Conv2d-469         [32, 1080, 33, 33]       1,749,600
     BatchNorm2d-470         [32, 1080, 33, 33]           2,160
            SiLU-471         [32, 1080, 33, 33]               0
        CNNBlock-472         [32, 1080, 33, 33]               0
          Conv2d-473         [32, 1080, 33, 33]          27,000
     BatchNorm2d-474         [32, 1080, 33, 33]           2,160
            SiLU-475         [32, 1080, 33, 33]               0
        CNNBlock-476         [32, 1080, 33, 33]               0
AdaptiveAvgPool2d-477           [32, 1080, 1, 1]               0
          Conv2d-478             [32, 45, 1, 1]          48,645
            SiLU-479             [32, 45, 1, 1]               0
          Conv2d-480           [32, 1080, 1, 1]          49,680
         Sigmoid-481           [32, 1080, 1, 1]               0
SqueezeExcitation-482         [32, 1080, 33, 33]               0
          Conv2d-483          [32, 180, 33, 33]         194,400
     BatchNorm2d-484          [32, 180, 33, 33]             360
InvertedResidualBlock-485          [32, 180, 33, 33]               0
          Conv2d-486         [32, 1080, 33, 33]       1,749,600
     BatchNorm2d-487         [32, 1080, 33, 33]           2,160
            SiLU-488         [32, 1080, 33, 33]               0
        CNNBlock-489         [32, 1080, 33, 33]               0
          Conv2d-490         [32, 1080, 17, 17]          27,000
     BatchNorm2d-491         [32, 1080, 17, 17]           2,160
            SiLU-492         [32, 1080, 17, 17]               0
        CNNBlock-493         [32, 1080, 17, 17]               0
AdaptiveAvgPool2d-494           [32, 1080, 1, 1]               0
          Conv2d-495             [32, 45, 1, 1]          48,645
            SiLU-496             [32, 45, 1, 1]               0
          Conv2d-497           [32, 1080, 1, 1]          49,680
         Sigmoid-498           [32, 1080, 1, 1]               0
SqueezeExcitation-499         [32, 1080, 17, 17]               0
          Conv2d-500          [32, 312, 17, 17]         336,960
     BatchNorm2d-501          [32, 312, 17, 17]             624
InvertedResidualBlock-502          [32, 312, 17, 17]               0
          Conv2d-503         [32, 1872, 17, 17]       5,256,576
     BatchNorm2d-504         [32, 1872, 17, 17]           3,744
            SiLU-505         [32, 1872, 17, 17]               0
        CNNBlock-506         [32, 1872, 17, 17]               0
          Conv2d-507         [32, 1872, 17, 17]          46,800
     BatchNorm2d-508         [32, 1872, 17, 17]           3,744
            SiLU-509         [32, 1872, 17, 17]               0
        CNNBlock-510         [32, 1872, 17, 17]               0
AdaptiveAvgPool2d-511           [32, 1872, 1, 1]               0
          Conv2d-512             [32, 78, 1, 1]         146,094
            SiLU-513             [32, 78, 1, 1]               0
          Conv2d-514           [32, 1872, 1, 1]         147,888
         Sigmoid-515           [32, 1872, 1, 1]               0
SqueezeExcitation-516         [32, 1872, 17, 17]               0
          Conv2d-517          [32, 312, 17, 17]         584,064
     BatchNorm2d-518          [32, 312, 17, 17]             624
InvertedResidualBlock-519          [32, 312, 17, 17]               0
          Conv2d-520         [32, 1872, 17, 17]       5,256,576
     BatchNorm2d-521         [32, 1872, 17, 17]           3,744
            SiLU-522         [32, 1872, 17, 17]               0
        CNNBlock-523         [32, 1872, 17, 17]               0
          Conv2d-524         [32, 1872, 17, 17]          46,800
     BatchNorm2d-525         [32, 1872, 17, 17]           3,744
            SiLU-526         [32, 1872, 17, 17]               0
        CNNBlock-527         [32, 1872, 17, 17]               0
AdaptiveAvgPool2d-528           [32, 1872, 1, 1]               0
          Conv2d-529             [32, 78, 1, 1]         146,094
            SiLU-530             [32, 78, 1, 1]               0
          Conv2d-531           [32, 1872, 1, 1]         147,888
         Sigmoid-532           [32, 1872, 1, 1]               0
SqueezeExcitation-533         [32, 1872, 17, 17]               0
          Conv2d-534          [32, 312, 17, 17]         584,064
     BatchNorm2d-535          [32, 312, 17, 17]             624
InvertedResidualBlock-536          [32, 312, 17, 17]               0
          Conv2d-537         [32, 1872, 17, 17]       5,256,576
     BatchNorm2d-538         [32, 1872, 17, 17]           3,744
            SiLU-539         [32, 1872, 17, 17]               0
        CNNBlock-540         [32, 1872, 17, 17]               0
          Conv2d-541         [32, 1872, 17, 17]          46,800
     BatchNorm2d-542         [32, 1872, 17, 17]           3,744
            SiLU-543         [32, 1872, 17, 17]               0
        CNNBlock-544         [32, 1872, 17, 17]               0
AdaptiveAvgPool2d-545           [32, 1872, 1, 1]               0
          Conv2d-546             [32, 78, 1, 1]         146,094
            SiLU-547             [32, 78, 1, 1]               0
          Conv2d-548           [32, 1872, 1, 1]         147,888
         Sigmoid-549           [32, 1872, 1, 1]               0
SqueezeExcitation-550         [32, 1872, 17, 17]               0
          Conv2d-551          [32, 312, 17, 17]         584,064
     BatchNorm2d-552          [32, 312, 17, 17]             624
InvertedResidualBlock-553          [32, 312, 17, 17]               0
          Conv2d-554         [32, 1872, 17, 17]       5,256,576
     BatchNorm2d-555         [32, 1872, 17, 17]           3,744
            SiLU-556         [32, 1872, 17, 17]               0
        CNNBlock-557         [32, 1872, 17, 17]               0
          Conv2d-558         [32, 1872, 17, 17]          46,800
     BatchNorm2d-559         [32, 1872, 17, 17]           3,744
            SiLU-560         [32, 1872, 17, 17]               0
        CNNBlock-561         [32, 1872, 17, 17]               0
AdaptiveAvgPool2d-562           [32, 1872, 1, 1]               0
          Conv2d-563             [32, 78, 1, 1]         146,094
            SiLU-564             [32, 78, 1, 1]               0
          Conv2d-565           [32, 1872, 1, 1]         147,888
         Sigmoid-566           [32, 1872, 1, 1]               0
SqueezeExcitation-567         [32, 1872, 17, 17]               0
          Conv2d-568          [32, 312, 17, 17]         584,064
     BatchNorm2d-569          [32, 312, 17, 17]             624
InvertedResidualBlock-570          [32, 312, 17, 17]               0
          Conv2d-571         [32, 1872, 17, 17]       5,256,576
     BatchNorm2d-572         [32, 1872, 17, 17]           3,744
            SiLU-573         [32, 1872, 17, 17]               0
        CNNBlock-574         [32, 1872, 17, 17]               0
          Conv2d-575         [32, 1872, 17, 17]          46,800
     BatchNorm2d-576         [32, 1872, 17, 17]           3,744
            SiLU-577         [32, 1872, 17, 17]               0
        CNNBlock-578         [32, 1872, 17, 17]               0
AdaptiveAvgPool2d-579           [32, 1872, 1, 1]               0
          Conv2d-580             [32, 78, 1, 1]         146,094
            SiLU-581             [32, 78, 1, 1]               0
          Conv2d-582           [32, 1872, 1, 1]         147,888
         Sigmoid-583           [32, 1872, 1, 1]               0
SqueezeExcitation-584         [32, 1872, 17, 17]               0
          Conv2d-585          [32, 312, 17, 17]         584,064
     BatchNorm2d-586          [32, 312, 17, 17]             624
InvertedResidualBlock-587          [32, 312, 17, 17]               0
          Conv2d-588         [32, 1872, 17, 17]       5,256,576
     BatchNorm2d-589         [32, 1872, 17, 17]           3,744
            SiLU-590         [32, 1872, 17, 17]               0
        CNNBlock-591         [32, 1872, 17, 17]               0
          Conv2d-592         [32, 1872, 17, 17]          46,800
     BatchNorm2d-593         [32, 1872, 17, 17]           3,744
            SiLU-594         [32, 1872, 17, 17]               0
        CNNBlock-595         [32, 1872, 17, 17]               0
AdaptiveAvgPool2d-596           [32, 1872, 1, 1]               0
          Conv2d-597             [32, 78, 1, 1]         146,094
            SiLU-598             [32, 78, 1, 1]               0
          Conv2d-599           [32, 1872, 1, 1]         147,888
         Sigmoid-600           [32, 1872, 1, 1]               0
SqueezeExcitation-601         [32, 1872, 17, 17]               0
          Conv2d-602          [32, 312, 17, 17]         584,064
     BatchNorm2d-603          [32, 312, 17, 17]             624
InvertedResidualBlock-604          [32, 312, 17, 17]               0
          Conv2d-605         [32, 1872, 17, 17]       5,256,576
     BatchNorm2d-606         [32, 1872, 17, 17]           3,744
            SiLU-607         [32, 1872, 17, 17]               0
        CNNBlock-608         [32, 1872, 17, 17]               0
          Conv2d-609         [32, 1872, 17, 17]          46,800
     BatchNorm2d-610         [32, 1872, 17, 17]           3,744
            SiLU-611         [32, 1872, 17, 17]               0
        CNNBlock-612         [32, 1872, 17, 17]               0
AdaptiveAvgPool2d-613           [32, 1872, 1, 1]               0
          Conv2d-614             [32, 78, 1, 1]         146,094
            SiLU-615             [32, 78, 1, 1]               0
          Conv2d-616           [32, 1872, 1, 1]         147,888
         Sigmoid-617           [32, 1872, 1, 1]               0
SqueezeExcitation-618         [32, 1872, 17, 17]               0
          Conv2d-619          [32, 312, 17, 17]         584,064
     BatchNorm2d-620          [32, 312, 17, 17]             624
InvertedResidualBlock-621          [32, 312, 17, 17]               0
          Conv2d-622         [32, 1872, 17, 17]       5,256,576
     BatchNorm2d-623         [32, 1872, 17, 17]           3,744
            SiLU-624         [32, 1872, 17, 17]               0
        CNNBlock-625         [32, 1872, 17, 17]               0
          Conv2d-626         [32, 1872, 17, 17]          46,800
     BatchNorm2d-627         [32, 1872, 17, 17]           3,744
            SiLU-628         [32, 1872, 17, 17]               0
        CNNBlock-629         [32, 1872, 17, 17]               0
AdaptiveAvgPool2d-630           [32, 1872, 1, 1]               0
          Conv2d-631             [32, 78, 1, 1]         146,094
            SiLU-632             [32, 78, 1, 1]               0
          Conv2d-633           [32, 1872, 1, 1]         147,888
         Sigmoid-634           [32, 1872, 1, 1]               0
SqueezeExcitation-635         [32, 1872, 17, 17]               0
          Conv2d-636          [32, 312, 17, 17]         584,064
     BatchNorm2d-637          [32, 312, 17, 17]             624
InvertedResidualBlock-638          [32, 312, 17, 17]               0
          Conv2d-639         [32, 1872, 17, 17]       5,256,576
     BatchNorm2d-640         [32, 1872, 17, 17]           3,744
            SiLU-641         [32, 1872, 17, 17]               0
        CNNBlock-642         [32, 1872, 17, 17]               0
          Conv2d-643         [32, 1872, 17, 17]          46,800
     BatchNorm2d-644         [32, 1872, 17, 17]           3,744
            SiLU-645         [32, 1872, 17, 17]               0
        CNNBlock-646         [32, 1872, 17, 17]               0
AdaptiveAvgPool2d-647           [32, 1872, 1, 1]               0
          Conv2d-648             [32, 78, 1, 1]         146,094
            SiLU-649             [32, 78, 1, 1]               0
          Conv2d-650           [32, 1872, 1, 1]         147,888
         Sigmoid-651           [32, 1872, 1, 1]               0
SqueezeExcitation-652         [32, 1872, 17, 17]               0
          Conv2d-653          [32, 312, 17, 17]         584,064
     BatchNorm2d-654          [32, 312, 17, 17]             624
InvertedResidualBlock-655          [32, 312, 17, 17]               0
          Conv2d-656         [32, 1872, 17, 17]       5,256,576
     BatchNorm2d-657         [32, 1872, 17, 17]           3,744
            SiLU-658         [32, 1872, 17, 17]               0
        CNNBlock-659         [32, 1872, 17, 17]               0
          Conv2d-660         [32, 1872, 17, 17]          16,848
     BatchNorm2d-661         [32, 1872, 17, 17]           3,744
            SiLU-662         [32, 1872, 17, 17]               0
        CNNBlock-663         [32, 1872, 17, 17]               0
AdaptiveAvgPool2d-664           [32, 1872, 1, 1]               0
          Conv2d-665             [32, 78, 1, 1]         146,094
            SiLU-666             [32, 78, 1, 1]               0
          Conv2d-667           [32, 1872, 1, 1]         147,888
         Sigmoid-668           [32, 1872, 1, 1]               0
SqueezeExcitation-669         [32, 1872, 17, 17]               0
          Conv2d-670          [32, 516, 17, 17]         965,952
     BatchNorm2d-671          [32, 516, 17, 17]           1,032
InvertedResidualBlock-672          [32, 516, 17, 17]               0
          Conv2d-673         [32, 3096, 17, 17]      14,377,824
     BatchNorm2d-674         [32, 3096, 17, 17]           6,192
            SiLU-675         [32, 3096, 17, 17]               0
        CNNBlock-676         [32, 3096, 17, 17]               0
          Conv2d-677         [32, 3096, 17, 17]          27,864
     BatchNorm2d-678         [32, 3096, 17, 17]           6,192
            SiLU-679         [32, 3096, 17, 17]               0
        CNNBlock-680         [32, 3096, 17, 17]               0
AdaptiveAvgPool2d-681           [32, 3096, 1, 1]               0
          Conv2d-682            [32, 129, 1, 1]         399,513
            SiLU-683            [32, 129, 1, 1]               0
          Conv2d-684           [32, 3096, 1, 1]         402,480
         Sigmoid-685           [32, 3096, 1, 1]               0
SqueezeExcitation-686         [32, 3096, 17, 17]               0
          Conv2d-687          [32, 516, 17, 17]       1,597,536
     BatchNorm2d-688          [32, 516, 17, 17]           1,032
InvertedResidualBlock-689          [32, 516, 17, 17]               0
          Conv2d-690         [32, 3096, 17, 17]      14,377,824
     BatchNorm2d-691         [32, 3096, 17, 17]           6,192
            SiLU-692         [32, 3096, 17, 17]               0
        CNNBlock-693         [32, 3096, 17, 17]               0
          Conv2d-694         [32, 3096, 17, 17]          27,864
     BatchNorm2d-695         [32, 3096, 17, 17]           6,192
            SiLU-696         [32, 3096, 17, 17]               0
        CNNBlock-697         [32, 3096, 17, 17]               0
AdaptiveAvgPool2d-698           [32, 3096, 1, 1]               0
          Conv2d-699            [32, 129, 1, 1]         399,513
            SiLU-700            [32, 129, 1, 1]               0
          Conv2d-701           [32, 3096, 1, 1]         402,480
         Sigmoid-702           [32, 3096, 1, 1]               0
SqueezeExcitation-703         [32, 3096, 17, 17]               0
          Conv2d-704          [32, 516, 17, 17]       1,597,536
     BatchNorm2d-705          [32, 516, 17, 17]           1,032
InvertedResidualBlock-706          [32, 516, 17, 17]               0
          Conv2d-707         [32, 2062, 17, 17]       1,063,992
     BatchNorm2d-708         [32, 2062, 17, 17]           4,124
            SiLU-709         [32, 2062, 17, 17]               0
        CNNBlock-710         [32, 2062, 17, 17]               0
AdaptiveAvgPool2d-711           [32, 2062, 1, 1]               0
         Flatten-712                 [32, 2062]               0
         Dropout-713                 [32, 2062]               0
          Linear-714                    [32, 2]           4,126
    EfficientNet-715                    [32, 2]               0
================================================================
Total params: 124,050,066
Trainable params: 124,050,066
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 102.09
Forward/backward pass size (MB): 148112.14
Params size (MB): 473.21
Estimated Total Size (MB): 148687.45
----------------------------------------------------------------

