EfficientNetB5----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [32, 46, 229, 229]           1,242
       BatchNorm2d-2         [32, 46, 229, 229]              92
              SiLU-3         [32, 46, 229, 229]               0
          CNNBlock-4         [32, 46, 229, 229]               0
            Conv2d-5         [32, 46, 229, 229]             414
       BatchNorm2d-6         [32, 46, 229, 229]              92
              SiLU-7         [32, 46, 229, 229]               0
          CNNBlock-8         [32, 46, 229, 229]               0
 AdaptiveAvgPool2d-9             [32, 46, 1, 1]               0
           Conv2d-10             [32, 11, 1, 1]             517
             SiLU-11             [32, 11, 1, 1]               0
           Conv2d-12             [32, 46, 1, 1]             552
          Sigmoid-13             [32, 46, 1, 1]               0
SqueezeExcitation-14         [32, 46, 229, 229]               0
           Conv2d-15         [32, 24, 229, 229]           1,104
      BatchNorm2d-16         [32, 24, 229, 229]              48
InvertedResidualBlock-17         [32, 24, 229, 229]               0
           Conv2d-18         [32, 24, 229, 229]             216
      BatchNorm2d-19         [32, 24, 229, 229]              48
             SiLU-20         [32, 24, 229, 229]               0
         CNNBlock-21         [32, 24, 229, 229]               0
AdaptiveAvgPool2d-22             [32, 24, 1, 1]               0
           Conv2d-23              [32, 6, 1, 1]             150
             SiLU-24              [32, 6, 1, 1]               0
           Conv2d-25             [32, 24, 1, 1]             168
          Sigmoid-26             [32, 24, 1, 1]               0
SqueezeExcitation-27         [32, 24, 229, 229]               0
           Conv2d-28         [32, 24, 229, 229]             576
      BatchNorm2d-29         [32, 24, 229, 229]              48
InvertedResidualBlock-30         [32, 24, 229, 229]               0
           Conv2d-31         [32, 24, 229, 229]             216
      BatchNorm2d-32         [32, 24, 229, 229]              48
             SiLU-33         [32, 24, 229, 229]               0
         CNNBlock-34         [32, 24, 229, 229]               0
AdaptiveAvgPool2d-35             [32, 24, 1, 1]               0
           Conv2d-36              [32, 6, 1, 1]             150
             SiLU-37              [32, 6, 1, 1]               0
           Conv2d-38             [32, 24, 1, 1]             168
          Sigmoid-39             [32, 24, 1, 1]               0
SqueezeExcitation-40         [32, 24, 229, 229]               0
           Conv2d-41         [32, 24, 229, 229]             576
      BatchNorm2d-42         [32, 24, 229, 229]              48
InvertedResidualBlock-43         [32, 24, 229, 229]               0
           Conv2d-44        [32, 144, 229, 229]          31,104
      BatchNorm2d-45        [32, 144, 229, 229]             288
             SiLU-46        [32, 144, 229, 229]               0
         CNNBlock-47        [32, 144, 229, 229]               0
           Conv2d-48        [32, 144, 115, 115]           1,296
      BatchNorm2d-49        [32, 144, 115, 115]             288
             SiLU-50        [32, 144, 115, 115]               0
         CNNBlock-51        [32, 144, 115, 115]               0
AdaptiveAvgPool2d-52            [32, 144, 1, 1]               0
           Conv2d-53              [32, 6, 1, 1]             870
             SiLU-54              [32, 6, 1, 1]               0
           Conv2d-55            [32, 144, 1, 1]           1,008
          Sigmoid-56            [32, 144, 1, 1]               0
SqueezeExcitation-57        [32, 144, 115, 115]               0
           Conv2d-58         [32, 36, 115, 115]           5,184
      BatchNorm2d-59         [32, 36, 115, 115]              72
InvertedResidualBlock-60         [32, 36, 115, 115]               0
           Conv2d-61        [32, 216, 115, 115]          69,984
      BatchNorm2d-62        [32, 216, 115, 115]             432
             SiLU-63        [32, 216, 115, 115]               0
         CNNBlock-64        [32, 216, 115, 115]               0
           Conv2d-65        [32, 216, 115, 115]           1,944
      BatchNorm2d-66        [32, 216, 115, 115]             432
             SiLU-67        [32, 216, 115, 115]               0
         CNNBlock-68        [32, 216, 115, 115]               0
AdaptiveAvgPool2d-69            [32, 216, 1, 1]               0
           Conv2d-70              [32, 9, 1, 1]           1,953
             SiLU-71              [32, 9, 1, 1]               0
           Conv2d-72            [32, 216, 1, 1]           2,160
          Sigmoid-73            [32, 216, 1, 1]               0
SqueezeExcitation-74        [32, 216, 115, 115]               0
           Conv2d-75         [32, 36, 115, 115]           7,776
      BatchNorm2d-76         [32, 36, 115, 115]              72
InvertedResidualBlock-77         [32, 36, 115, 115]               0
           Conv2d-78        [32, 216, 115, 115]          69,984
      BatchNorm2d-79        [32, 216, 115, 115]             432
             SiLU-80        [32, 216, 115, 115]               0
         CNNBlock-81        [32, 216, 115, 115]               0
           Conv2d-82        [32, 216, 115, 115]           1,944
      BatchNorm2d-83        [32, 216, 115, 115]             432
             SiLU-84        [32, 216, 115, 115]               0
         CNNBlock-85        [32, 216, 115, 115]               0
AdaptiveAvgPool2d-86            [32, 216, 1, 1]               0
           Conv2d-87              [32, 9, 1, 1]           1,953
             SiLU-88              [32, 9, 1, 1]               0
           Conv2d-89            [32, 216, 1, 1]           2,160
          Sigmoid-90            [32, 216, 1, 1]               0
SqueezeExcitation-91        [32, 216, 115, 115]               0
           Conv2d-92         [32, 36, 115, 115]           7,776
      BatchNorm2d-93         [32, 36, 115, 115]              72
InvertedResidualBlock-94         [32, 36, 115, 115]               0
           Conv2d-95        [32, 216, 115, 115]          69,984
      BatchNorm2d-96        [32, 216, 115, 115]             432
             SiLU-97        [32, 216, 115, 115]               0
         CNNBlock-98        [32, 216, 115, 115]               0
           Conv2d-99        [32, 216, 115, 115]           1,944
     BatchNorm2d-100        [32, 216, 115, 115]             432
            SiLU-101        [32, 216, 115, 115]               0
        CNNBlock-102        [32, 216, 115, 115]               0
AdaptiveAvgPool2d-103            [32, 216, 1, 1]               0
          Conv2d-104              [32, 9, 1, 1]           1,953
            SiLU-105              [32, 9, 1, 1]               0
          Conv2d-106            [32, 216, 1, 1]           2,160
         Sigmoid-107            [32, 216, 1, 1]               0
SqueezeExcitation-108        [32, 216, 115, 115]               0
          Conv2d-109         [32, 36, 115, 115]           7,776
     BatchNorm2d-110         [32, 36, 115, 115]              72
InvertedResidualBlock-111         [32, 36, 115, 115]               0
          Conv2d-112        [32, 216, 115, 115]          69,984
     BatchNorm2d-113        [32, 216, 115, 115]             432
            SiLU-114        [32, 216, 115, 115]               0
        CNNBlock-115        [32, 216, 115, 115]               0
          Conv2d-116        [32, 216, 115, 115]           1,944
     BatchNorm2d-117        [32, 216, 115, 115]             432
            SiLU-118        [32, 216, 115, 115]               0
        CNNBlock-119        [32, 216, 115, 115]               0
AdaptiveAvgPool2d-120            [32, 216, 1, 1]               0
          Conv2d-121              [32, 9, 1, 1]           1,953
            SiLU-122              [32, 9, 1, 1]               0
          Conv2d-123            [32, 216, 1, 1]           2,160
         Sigmoid-124            [32, 216, 1, 1]               0
SqueezeExcitation-125        [32, 216, 115, 115]               0
          Conv2d-126         [32, 36, 115, 115]           7,776
     BatchNorm2d-127         [32, 36, 115, 115]              72
InvertedResidualBlock-128         [32, 36, 115, 115]               0
          Conv2d-129        [32, 216, 115, 115]          69,984
     BatchNorm2d-130        [32, 216, 115, 115]             432
            SiLU-131        [32, 216, 115, 115]               0
        CNNBlock-132        [32, 216, 115, 115]               0
          Conv2d-133          [32, 216, 58, 58]           5,400
     BatchNorm2d-134          [32, 216, 58, 58]             432
            SiLU-135          [32, 216, 58, 58]               0
        CNNBlock-136          [32, 216, 58, 58]               0
AdaptiveAvgPool2d-137            [32, 216, 1, 1]               0
          Conv2d-138              [32, 9, 1, 1]           1,953
            SiLU-139              [32, 9, 1, 1]               0
          Conv2d-140            [32, 216, 1, 1]           2,160
         Sigmoid-141            [32, 216, 1, 1]               0
SqueezeExcitation-142          [32, 216, 58, 58]               0
          Conv2d-143           [32, 60, 58, 58]          12,960
     BatchNorm2d-144           [32, 60, 58, 58]             120
InvertedResidualBlock-145           [32, 60, 58, 58]               0
          Conv2d-146          [32, 360, 58, 58]         194,400
     BatchNorm2d-147          [32, 360, 58, 58]             720
            SiLU-148          [32, 360, 58, 58]               0
        CNNBlock-149          [32, 360, 58, 58]               0
          Conv2d-150          [32, 360, 58, 58]           9,000
     BatchNorm2d-151          [32, 360, 58, 58]             720
            SiLU-152          [32, 360, 58, 58]               0
        CNNBlock-153          [32, 360, 58, 58]               0
AdaptiveAvgPool2d-154            [32, 360, 1, 1]               0
          Conv2d-155             [32, 15, 1, 1]           5,415
            SiLU-156             [32, 15, 1, 1]               0
          Conv2d-157            [32, 360, 1, 1]           5,760
         Sigmoid-158            [32, 360, 1, 1]               0
SqueezeExcitation-159          [32, 360, 58, 58]               0
          Conv2d-160           [32, 60, 58, 58]          21,600
     BatchNorm2d-161           [32, 60, 58, 58]             120
InvertedResidualBlock-162           [32, 60, 58, 58]               0
          Conv2d-163          [32, 360, 58, 58]         194,400
     BatchNorm2d-164          [32, 360, 58, 58]             720
            SiLU-165          [32, 360, 58, 58]               0
        CNNBlock-166          [32, 360, 58, 58]               0
          Conv2d-167          [32, 360, 58, 58]           9,000
     BatchNorm2d-168          [32, 360, 58, 58]             720
            SiLU-169          [32, 360, 58, 58]               0
        CNNBlock-170          [32, 360, 58, 58]               0
AdaptiveAvgPool2d-171            [32, 360, 1, 1]               0
          Conv2d-172             [32, 15, 1, 1]           5,415
            SiLU-173             [32, 15, 1, 1]               0
          Conv2d-174            [32, 360, 1, 1]           5,760
         Sigmoid-175            [32, 360, 1, 1]               0
SqueezeExcitation-176          [32, 360, 58, 58]               0
          Conv2d-177           [32, 60, 58, 58]          21,600
     BatchNorm2d-178           [32, 60, 58, 58]             120
InvertedResidualBlock-179           [32, 60, 58, 58]               0
          Conv2d-180          [32, 360, 58, 58]         194,400
     BatchNorm2d-181          [32, 360, 58, 58]             720
            SiLU-182          [32, 360, 58, 58]               0
        CNNBlock-183          [32, 360, 58, 58]               0
          Conv2d-184          [32, 360, 58, 58]           9,000
     BatchNorm2d-185          [32, 360, 58, 58]             720
            SiLU-186          [32, 360, 58, 58]               0
        CNNBlock-187          [32, 360, 58, 58]               0
AdaptiveAvgPool2d-188            [32, 360, 1, 1]               0
          Conv2d-189             [32, 15, 1, 1]           5,415
            SiLU-190             [32, 15, 1, 1]               0
          Conv2d-191            [32, 360, 1, 1]           5,760
         Sigmoid-192            [32, 360, 1, 1]               0
SqueezeExcitation-193          [32, 360, 58, 58]               0
          Conv2d-194           [32, 60, 58, 58]          21,600
     BatchNorm2d-195           [32, 60, 58, 58]             120
InvertedResidualBlock-196           [32, 60, 58, 58]               0
          Conv2d-197          [32, 360, 58, 58]         194,400
     BatchNorm2d-198          [32, 360, 58, 58]             720
            SiLU-199          [32, 360, 58, 58]               0
        CNNBlock-200          [32, 360, 58, 58]               0
          Conv2d-201          [32, 360, 58, 58]           9,000
     BatchNorm2d-202          [32, 360, 58, 58]             720
            SiLU-203          [32, 360, 58, 58]               0
        CNNBlock-204          [32, 360, 58, 58]               0
AdaptiveAvgPool2d-205            [32, 360, 1, 1]               0
          Conv2d-206             [32, 15, 1, 1]           5,415
            SiLU-207             [32, 15, 1, 1]               0
          Conv2d-208            [32, 360, 1, 1]           5,760
         Sigmoid-209            [32, 360, 1, 1]               0
SqueezeExcitation-210          [32, 360, 58, 58]               0
          Conv2d-211           [32, 60, 58, 58]          21,600
     BatchNorm2d-212           [32, 60, 58, 58]             120
InvertedResidualBlock-213           [32, 60, 58, 58]               0
          Conv2d-214          [32, 360, 58, 58]         194,400
     BatchNorm2d-215          [32, 360, 58, 58]             720
            SiLU-216          [32, 360, 58, 58]               0
        CNNBlock-217          [32, 360, 58, 58]               0
          Conv2d-218          [32, 360, 29, 29]           3,240
     BatchNorm2d-219          [32, 360, 29, 29]             720
            SiLU-220          [32, 360, 29, 29]               0
        CNNBlock-221          [32, 360, 29, 29]               0
AdaptiveAvgPool2d-222            [32, 360, 1, 1]               0
          Conv2d-223             [32, 15, 1, 1]           5,415
            SiLU-224             [32, 15, 1, 1]               0
          Conv2d-225            [32, 360, 1, 1]           5,760
         Sigmoid-226            [32, 360, 1, 1]               0
SqueezeExcitation-227          [32, 360, 29, 29]               0
          Conv2d-228          [32, 120, 29, 29]          43,200
     BatchNorm2d-229          [32, 120, 29, 29]             240
InvertedResidualBlock-230          [32, 120, 29, 29]               0
          Conv2d-231          [32, 720, 29, 29]         777,600
     BatchNorm2d-232          [32, 720, 29, 29]           1,440
            SiLU-233          [32, 720, 29, 29]               0
        CNNBlock-234          [32, 720, 29, 29]               0
          Conv2d-235          [32, 720, 29, 29]           6,480
     BatchNorm2d-236          [32, 720, 29, 29]           1,440
            SiLU-237          [32, 720, 29, 29]               0
        CNNBlock-238          [32, 720, 29, 29]               0
AdaptiveAvgPool2d-239            [32, 720, 1, 1]               0
          Conv2d-240             [32, 30, 1, 1]          21,630
            SiLU-241             [32, 30, 1, 1]               0
          Conv2d-242            [32, 720, 1, 1]          22,320
         Sigmoid-243            [32, 720, 1, 1]               0
SqueezeExcitation-244          [32, 720, 29, 29]               0
          Conv2d-245          [32, 120, 29, 29]          86,400
     BatchNorm2d-246          [32, 120, 29, 29]             240
InvertedResidualBlock-247          [32, 120, 29, 29]               0
          Conv2d-248          [32, 720, 29, 29]         777,600
     BatchNorm2d-249          [32, 720, 29, 29]           1,440
            SiLU-250          [32, 720, 29, 29]               0
        CNNBlock-251          [32, 720, 29, 29]               0
          Conv2d-252          [32, 720, 29, 29]           6,480
     BatchNorm2d-253          [32, 720, 29, 29]           1,440
            SiLU-254          [32, 720, 29, 29]               0
        CNNBlock-255          [32, 720, 29, 29]               0
AdaptiveAvgPool2d-256            [32, 720, 1, 1]               0
          Conv2d-257             [32, 30, 1, 1]          21,630
            SiLU-258             [32, 30, 1, 1]               0
          Conv2d-259            [32, 720, 1, 1]          22,320
         Sigmoid-260            [32, 720, 1, 1]               0
SqueezeExcitation-261          [32, 720, 29, 29]               0
          Conv2d-262          [32, 120, 29, 29]          86,400
     BatchNorm2d-263          [32, 120, 29, 29]             240
InvertedResidualBlock-264          [32, 120, 29, 29]               0
          Conv2d-265          [32, 720, 29, 29]         777,600
     BatchNorm2d-266          [32, 720, 29, 29]           1,440
            SiLU-267          [32, 720, 29, 29]               0
        CNNBlock-268          [32, 720, 29, 29]               0
          Conv2d-269          [32, 720, 29, 29]           6,480
     BatchNorm2d-270          [32, 720, 29, 29]           1,440
            SiLU-271          [32, 720, 29, 29]               0
        CNNBlock-272          [32, 720, 29, 29]               0
AdaptiveAvgPool2d-273            [32, 720, 1, 1]               0
          Conv2d-274             [32, 30, 1, 1]          21,630
            SiLU-275             [32, 30, 1, 1]               0
          Conv2d-276            [32, 720, 1, 1]          22,320
         Sigmoid-277            [32, 720, 1, 1]               0
SqueezeExcitation-278          [32, 720, 29, 29]               0
          Conv2d-279          [32, 120, 29, 29]          86,400
     BatchNorm2d-280          [32, 120, 29, 29]             240
InvertedResidualBlock-281          [32, 120, 29, 29]               0
          Conv2d-282          [32, 720, 29, 29]         777,600
     BatchNorm2d-283          [32, 720, 29, 29]           1,440
            SiLU-284          [32, 720, 29, 29]               0
        CNNBlock-285          [32, 720, 29, 29]               0
          Conv2d-286          [32, 720, 29, 29]           6,480
     BatchNorm2d-287          [32, 720, 29, 29]           1,440
            SiLU-288          [32, 720, 29, 29]               0
        CNNBlock-289          [32, 720, 29, 29]               0
AdaptiveAvgPool2d-290            [32, 720, 1, 1]               0
          Conv2d-291             [32, 30, 1, 1]          21,630
            SiLU-292             [32, 30, 1, 1]               0
          Conv2d-293            [32, 720, 1, 1]          22,320
         Sigmoid-294            [32, 720, 1, 1]               0
SqueezeExcitation-295          [32, 720, 29, 29]               0
          Conv2d-296          [32, 120, 29, 29]          86,400
     BatchNorm2d-297          [32, 120, 29, 29]             240
InvertedResidualBlock-298          [32, 120, 29, 29]               0
          Conv2d-299          [32, 720, 29, 29]         777,600
     BatchNorm2d-300          [32, 720, 29, 29]           1,440
            SiLU-301          [32, 720, 29, 29]               0
        CNNBlock-302          [32, 720, 29, 29]               0
          Conv2d-303          [32, 720, 29, 29]           6,480
     BatchNorm2d-304          [32, 720, 29, 29]           1,440
            SiLU-305          [32, 720, 29, 29]               0
        CNNBlock-306          [32, 720, 29, 29]               0
AdaptiveAvgPool2d-307            [32, 720, 1, 1]               0
          Conv2d-308             [32, 30, 1, 1]          21,630
            SiLU-309             [32, 30, 1, 1]               0
          Conv2d-310            [32, 720, 1, 1]          22,320
         Sigmoid-311            [32, 720, 1, 1]               0
SqueezeExcitation-312          [32, 720, 29, 29]               0
          Conv2d-313          [32, 120, 29, 29]          86,400
     BatchNorm2d-314          [32, 120, 29, 29]             240
InvertedResidualBlock-315          [32, 120, 29, 29]               0
          Conv2d-316          [32, 720, 29, 29]         777,600
     BatchNorm2d-317          [32, 720, 29, 29]           1,440
            SiLU-318          [32, 720, 29, 29]               0
        CNNBlock-319          [32, 720, 29, 29]               0
          Conv2d-320          [32, 720, 29, 29]           6,480
     BatchNorm2d-321          [32, 720, 29, 29]           1,440
            SiLU-322          [32, 720, 29, 29]               0
        CNNBlock-323          [32, 720, 29, 29]               0
AdaptiveAvgPool2d-324            [32, 720, 1, 1]               0
          Conv2d-325             [32, 30, 1, 1]          21,630
            SiLU-326             [32, 30, 1, 1]               0
          Conv2d-327            [32, 720, 1, 1]          22,320
         Sigmoid-328            [32, 720, 1, 1]               0
SqueezeExcitation-329          [32, 720, 29, 29]               0
          Conv2d-330          [32, 120, 29, 29]          86,400
     BatchNorm2d-331          [32, 120, 29, 29]             240
InvertedResidualBlock-332          [32, 120, 29, 29]               0
          Conv2d-333          [32, 720, 29, 29]         777,600
     BatchNorm2d-334          [32, 720, 29, 29]           1,440
            SiLU-335          [32, 720, 29, 29]               0
        CNNBlock-336          [32, 720, 29, 29]               0
          Conv2d-337          [32, 720, 29, 29]          18,000
     BatchNorm2d-338          [32, 720, 29, 29]           1,440
            SiLU-339          [32, 720, 29, 29]               0
        CNNBlock-340          [32, 720, 29, 29]               0
AdaptiveAvgPool2d-341            [32, 720, 1, 1]               0
          Conv2d-342             [32, 30, 1, 1]          21,630
            SiLU-343             [32, 30, 1, 1]               0
          Conv2d-344            [32, 720, 1, 1]          22,320
         Sigmoid-345            [32, 720, 1, 1]               0
SqueezeExcitation-346          [32, 720, 29, 29]               0
          Conv2d-347          [32, 164, 29, 29]         118,080
     BatchNorm2d-348          [32, 164, 29, 29]             328
InvertedResidualBlock-349          [32, 164, 29, 29]               0
          Conv2d-350          [32, 984, 29, 29]       1,452,384
     BatchNorm2d-351          [32, 984, 29, 29]           1,968
            SiLU-352          [32, 984, 29, 29]               0
        CNNBlock-353          [32, 984, 29, 29]               0
          Conv2d-354          [32, 984, 29, 29]          24,600
     BatchNorm2d-355          [32, 984, 29, 29]           1,968
            SiLU-356          [32, 984, 29, 29]               0
        CNNBlock-357          [32, 984, 29, 29]               0
AdaptiveAvgPool2d-358            [32, 984, 1, 1]               0
          Conv2d-359             [32, 41, 1, 1]          40,385
            SiLU-360             [32, 41, 1, 1]               0
          Conv2d-361            [32, 984, 1, 1]          41,328
         Sigmoid-362            [32, 984, 1, 1]               0
SqueezeExcitation-363          [32, 984, 29, 29]               0
          Conv2d-364          [32, 164, 29, 29]         161,376
     BatchNorm2d-365          [32, 164, 29, 29]             328
InvertedResidualBlock-366          [32, 164, 29, 29]               0
          Conv2d-367          [32, 984, 29, 29]       1,452,384
     BatchNorm2d-368          [32, 984, 29, 29]           1,968
            SiLU-369          [32, 984, 29, 29]               0
        CNNBlock-370          [32, 984, 29, 29]               0
          Conv2d-371          [32, 984, 29, 29]          24,600
     BatchNorm2d-372          [32, 984, 29, 29]           1,968
            SiLU-373          [32, 984, 29, 29]               0
        CNNBlock-374          [32, 984, 29, 29]               0
AdaptiveAvgPool2d-375            [32, 984, 1, 1]               0
          Conv2d-376             [32, 41, 1, 1]          40,385
            SiLU-377             [32, 41, 1, 1]               0
          Conv2d-378            [32, 984, 1, 1]          41,328
         Sigmoid-379            [32, 984, 1, 1]               0
SqueezeExcitation-380          [32, 984, 29, 29]               0
          Conv2d-381          [32, 164, 29, 29]         161,376
     BatchNorm2d-382          [32, 164, 29, 29]             328
InvertedResidualBlock-383          [32, 164, 29, 29]               0
          Conv2d-384          [32, 984, 29, 29]       1,452,384
     BatchNorm2d-385          [32, 984, 29, 29]           1,968
            SiLU-386          [32, 984, 29, 29]               0
        CNNBlock-387          [32, 984, 29, 29]               0
          Conv2d-388          [32, 984, 29, 29]          24,600
     BatchNorm2d-389          [32, 984, 29, 29]           1,968
            SiLU-390          [32, 984, 29, 29]               0
        CNNBlock-391          [32, 984, 29, 29]               0
AdaptiveAvgPool2d-392            [32, 984, 1, 1]               0
          Conv2d-393             [32, 41, 1, 1]          40,385
            SiLU-394             [32, 41, 1, 1]               0
          Conv2d-395            [32, 984, 1, 1]          41,328
         Sigmoid-396            [32, 984, 1, 1]               0
SqueezeExcitation-397          [32, 984, 29, 29]               0
          Conv2d-398          [32, 164, 29, 29]         161,376
     BatchNorm2d-399          [32, 164, 29, 29]             328
InvertedResidualBlock-400          [32, 164, 29, 29]               0
          Conv2d-401          [32, 984, 29, 29]       1,452,384
     BatchNorm2d-402          [32, 984, 29, 29]           1,968
            SiLU-403          [32, 984, 29, 29]               0
        CNNBlock-404          [32, 984, 29, 29]               0
          Conv2d-405          [32, 984, 29, 29]          24,600
     BatchNorm2d-406          [32, 984, 29, 29]           1,968
            SiLU-407          [32, 984, 29, 29]               0
        CNNBlock-408          [32, 984, 29, 29]               0
AdaptiveAvgPool2d-409            [32, 984, 1, 1]               0
          Conv2d-410             [32, 41, 1, 1]          40,385
            SiLU-411             [32, 41, 1, 1]               0
          Conv2d-412            [32, 984, 1, 1]          41,328
         Sigmoid-413            [32, 984, 1, 1]               0
SqueezeExcitation-414          [32, 984, 29, 29]               0
          Conv2d-415          [32, 164, 29, 29]         161,376
     BatchNorm2d-416          [32, 164, 29, 29]             328
InvertedResidualBlock-417          [32, 164, 29, 29]               0
          Conv2d-418          [32, 984, 29, 29]       1,452,384
     BatchNorm2d-419          [32, 984, 29, 29]           1,968
            SiLU-420          [32, 984, 29, 29]               0
        CNNBlock-421          [32, 984, 29, 29]               0
          Conv2d-422          [32, 984, 29, 29]          24,600
     BatchNorm2d-423          [32, 984, 29, 29]           1,968
            SiLU-424          [32, 984, 29, 29]               0
        CNNBlock-425          [32, 984, 29, 29]               0
AdaptiveAvgPool2d-426            [32, 984, 1, 1]               0
          Conv2d-427             [32, 41, 1, 1]          40,385
            SiLU-428             [32, 41, 1, 1]               0
          Conv2d-429            [32, 984, 1, 1]          41,328
         Sigmoid-430            [32, 984, 1, 1]               0
SqueezeExcitation-431          [32, 984, 29, 29]               0
          Conv2d-432          [32, 164, 29, 29]         161,376
     BatchNorm2d-433          [32, 164, 29, 29]             328
InvertedResidualBlock-434          [32, 164, 29, 29]               0
          Conv2d-435          [32, 984, 29, 29]       1,452,384
     BatchNorm2d-436          [32, 984, 29, 29]           1,968
            SiLU-437          [32, 984, 29, 29]               0
        CNNBlock-438          [32, 984, 29, 29]               0
          Conv2d-439          [32, 984, 29, 29]          24,600
     BatchNorm2d-440          [32, 984, 29, 29]           1,968
            SiLU-441          [32, 984, 29, 29]               0
        CNNBlock-442          [32, 984, 29, 29]               0
AdaptiveAvgPool2d-443            [32, 984, 1, 1]               0
          Conv2d-444             [32, 41, 1, 1]          40,385
            SiLU-445             [32, 41, 1, 1]               0
          Conv2d-446            [32, 984, 1, 1]          41,328
         Sigmoid-447            [32, 984, 1, 1]               0
SqueezeExcitation-448          [32, 984, 29, 29]               0
          Conv2d-449          [32, 164, 29, 29]         161,376
     BatchNorm2d-450          [32, 164, 29, 29]             328
InvertedResidualBlock-451          [32, 164, 29, 29]               0
          Conv2d-452          [32, 984, 29, 29]       1,452,384
     BatchNorm2d-453          [32, 984, 29, 29]           1,968
            SiLU-454          [32, 984, 29, 29]               0
        CNNBlock-455          [32, 984, 29, 29]               0
          Conv2d-456          [32, 984, 15, 15]          24,600
     BatchNorm2d-457          [32, 984, 15, 15]           1,968
            SiLU-458          [32, 984, 15, 15]               0
        CNNBlock-459          [32, 984, 15, 15]               0
AdaptiveAvgPool2d-460            [32, 984, 1, 1]               0
          Conv2d-461             [32, 41, 1, 1]          40,385
            SiLU-462             [32, 41, 1, 1]               0
          Conv2d-463            [32, 984, 1, 1]          41,328
         Sigmoid-464            [32, 984, 1, 1]               0
SqueezeExcitation-465          [32, 984, 15, 15]               0
          Conv2d-466          [32, 284, 15, 15]         279,456
     BatchNorm2d-467          [32, 284, 15, 15]             568
InvertedResidualBlock-468          [32, 284, 15, 15]               0
          Conv2d-469         [32, 1704, 15, 15]       4,355,424
     BatchNorm2d-470         [32, 1704, 15, 15]           3,408
            SiLU-471         [32, 1704, 15, 15]               0
        CNNBlock-472         [32, 1704, 15, 15]               0
          Conv2d-473         [32, 1704, 15, 15]          42,600
     BatchNorm2d-474         [32, 1704, 15, 15]           3,408
            SiLU-475         [32, 1704, 15, 15]               0
        CNNBlock-476         [32, 1704, 15, 15]               0
AdaptiveAvgPool2d-477           [32, 1704, 1, 1]               0
          Conv2d-478             [32, 71, 1, 1]         121,055
            SiLU-479             [32, 71, 1, 1]               0
          Conv2d-480           [32, 1704, 1, 1]         122,688
         Sigmoid-481           [32, 1704, 1, 1]               0
SqueezeExcitation-482         [32, 1704, 15, 15]               0
          Conv2d-483          [32, 284, 15, 15]         483,936
     BatchNorm2d-484          [32, 284, 15, 15]             568
InvertedResidualBlock-485          [32, 284, 15, 15]               0
          Conv2d-486         [32, 1704, 15, 15]       4,355,424
     BatchNorm2d-487         [32, 1704, 15, 15]           3,408
            SiLU-488         [32, 1704, 15, 15]               0
        CNNBlock-489         [32, 1704, 15, 15]               0
          Conv2d-490         [32, 1704, 15, 15]          42,600
     BatchNorm2d-491         [32, 1704, 15, 15]           3,408
            SiLU-492         [32, 1704, 15, 15]               0
        CNNBlock-493         [32, 1704, 15, 15]               0
AdaptiveAvgPool2d-494           [32, 1704, 1, 1]               0
          Conv2d-495             [32, 71, 1, 1]         121,055
            SiLU-496             [32, 71, 1, 1]               0
          Conv2d-497           [32, 1704, 1, 1]         122,688
         Sigmoid-498           [32, 1704, 1, 1]               0
SqueezeExcitation-499         [32, 1704, 15, 15]               0
          Conv2d-500          [32, 284, 15, 15]         483,936
     BatchNorm2d-501          [32, 284, 15, 15]             568
InvertedResidualBlock-502          [32, 284, 15, 15]               0
          Conv2d-503         [32, 1704, 15, 15]       4,355,424
     BatchNorm2d-504         [32, 1704, 15, 15]           3,408
            SiLU-505         [32, 1704, 15, 15]               0
        CNNBlock-506         [32, 1704, 15, 15]               0
          Conv2d-507         [32, 1704, 15, 15]          42,600
     BatchNorm2d-508         [32, 1704, 15, 15]           3,408
            SiLU-509         [32, 1704, 15, 15]               0
        CNNBlock-510         [32, 1704, 15, 15]               0
AdaptiveAvgPool2d-511           [32, 1704, 1, 1]               0
          Conv2d-512             [32, 71, 1, 1]         121,055
            SiLU-513             [32, 71, 1, 1]               0
          Conv2d-514           [32, 1704, 1, 1]         122,688
         Sigmoid-515           [32, 1704, 1, 1]               0
SqueezeExcitation-516         [32, 1704, 15, 15]               0
          Conv2d-517          [32, 284, 15, 15]         483,936
     BatchNorm2d-518          [32, 284, 15, 15]             568
InvertedResidualBlock-519          [32, 284, 15, 15]               0
          Conv2d-520         [32, 1704, 15, 15]       4,355,424
     BatchNorm2d-521         [32, 1704, 15, 15]           3,408
            SiLU-522         [32, 1704, 15, 15]               0
        CNNBlock-523         [32, 1704, 15, 15]               0
          Conv2d-524         [32, 1704, 15, 15]          42,600
     BatchNorm2d-525         [32, 1704, 15, 15]           3,408
            SiLU-526         [32, 1704, 15, 15]               0
        CNNBlock-527         [32, 1704, 15, 15]               0
AdaptiveAvgPool2d-528           [32, 1704, 1, 1]               0
          Conv2d-529             [32, 71, 1, 1]         121,055
            SiLU-530             [32, 71, 1, 1]               0
          Conv2d-531           [32, 1704, 1, 1]         122,688
         Sigmoid-532           [32, 1704, 1, 1]               0
SqueezeExcitation-533         [32, 1704, 15, 15]               0
          Conv2d-534          [32, 284, 15, 15]         483,936
     BatchNorm2d-535          [32, 284, 15, 15]             568
InvertedResidualBlock-536          [32, 284, 15, 15]               0
          Conv2d-537         [32, 1704, 15, 15]       4,355,424
     BatchNorm2d-538         [32, 1704, 15, 15]           3,408
            SiLU-539         [32, 1704, 15, 15]               0
        CNNBlock-540         [32, 1704, 15, 15]               0
          Conv2d-541         [32, 1704, 15, 15]          42,600
     BatchNorm2d-542         [32, 1704, 15, 15]           3,408
            SiLU-543         [32, 1704, 15, 15]               0
        CNNBlock-544         [32, 1704, 15, 15]               0
AdaptiveAvgPool2d-545           [32, 1704, 1, 1]               0
          Conv2d-546             [32, 71, 1, 1]         121,055
            SiLU-547             [32, 71, 1, 1]               0
          Conv2d-548           [32, 1704, 1, 1]         122,688
         Sigmoid-549           [32, 1704, 1, 1]               0
SqueezeExcitation-550         [32, 1704, 15, 15]               0
          Conv2d-551          [32, 284, 15, 15]         483,936
     BatchNorm2d-552          [32, 284, 15, 15]             568
InvertedResidualBlock-553          [32, 284, 15, 15]               0
          Conv2d-554         [32, 1704, 15, 15]       4,355,424
     BatchNorm2d-555         [32, 1704, 15, 15]           3,408
            SiLU-556         [32, 1704, 15, 15]               0
        CNNBlock-557         [32, 1704, 15, 15]               0
          Conv2d-558         [32, 1704, 15, 15]          42,600
     BatchNorm2d-559         [32, 1704, 15, 15]           3,408
            SiLU-560         [32, 1704, 15, 15]               0
        CNNBlock-561         [32, 1704, 15, 15]               0
AdaptiveAvgPool2d-562           [32, 1704, 1, 1]               0
          Conv2d-563             [32, 71, 1, 1]         121,055
            SiLU-564             [32, 71, 1, 1]               0
          Conv2d-565           [32, 1704, 1, 1]         122,688
         Sigmoid-566           [32, 1704, 1, 1]               0
SqueezeExcitation-567         [32, 1704, 15, 15]               0
          Conv2d-568          [32, 284, 15, 15]         483,936
     BatchNorm2d-569          [32, 284, 15, 15]             568
InvertedResidualBlock-570          [32, 284, 15, 15]               0
          Conv2d-571         [32, 1704, 15, 15]       4,355,424
     BatchNorm2d-572         [32, 1704, 15, 15]           3,408
            SiLU-573         [32, 1704, 15, 15]               0
        CNNBlock-574         [32, 1704, 15, 15]               0
          Conv2d-575         [32, 1704, 15, 15]          42,600
     BatchNorm2d-576         [32, 1704, 15, 15]           3,408
            SiLU-577         [32, 1704, 15, 15]               0
        CNNBlock-578         [32, 1704, 15, 15]               0
AdaptiveAvgPool2d-579           [32, 1704, 1, 1]               0
          Conv2d-580             [32, 71, 1, 1]         121,055
            SiLU-581             [32, 71, 1, 1]               0
          Conv2d-582           [32, 1704, 1, 1]         122,688
         Sigmoid-583           [32, 1704, 1, 1]               0
SqueezeExcitation-584         [32, 1704, 15, 15]               0
          Conv2d-585          [32, 284, 15, 15]         483,936
     BatchNorm2d-586          [32, 284, 15, 15]             568
InvertedResidualBlock-587          [32, 284, 15, 15]               0
          Conv2d-588         [32, 1704, 15, 15]       4,355,424
     BatchNorm2d-589         [32, 1704, 15, 15]           3,408
            SiLU-590         [32, 1704, 15, 15]               0
        CNNBlock-591         [32, 1704, 15, 15]               0
          Conv2d-592         [32, 1704, 15, 15]          42,600
     BatchNorm2d-593         [32, 1704, 15, 15]           3,408
            SiLU-594         [32, 1704, 15, 15]               0
        CNNBlock-595         [32, 1704, 15, 15]               0
AdaptiveAvgPool2d-596           [32, 1704, 1, 1]               0
          Conv2d-597             [32, 71, 1, 1]         121,055
            SiLU-598             [32, 71, 1, 1]               0
          Conv2d-599           [32, 1704, 1, 1]         122,688
         Sigmoid-600           [32, 1704, 1, 1]               0
SqueezeExcitation-601         [32, 1704, 15, 15]               0
          Conv2d-602          [32, 284, 15, 15]         483,936
     BatchNorm2d-603          [32, 284, 15, 15]             568
InvertedResidualBlock-604          [32, 284, 15, 15]               0
          Conv2d-605         [32, 1704, 15, 15]       4,355,424
     BatchNorm2d-606         [32, 1704, 15, 15]           3,408
            SiLU-607         [32, 1704, 15, 15]               0
        CNNBlock-608         [32, 1704, 15, 15]               0
          Conv2d-609         [32, 1704, 15, 15]          15,336
     BatchNorm2d-610         [32, 1704, 15, 15]           3,408
            SiLU-611         [32, 1704, 15, 15]               0
        CNNBlock-612         [32, 1704, 15, 15]               0
AdaptiveAvgPool2d-613           [32, 1704, 1, 1]               0
          Conv2d-614             [32, 71, 1, 1]         121,055
            SiLU-615             [32, 71, 1, 1]               0
          Conv2d-616           [32, 1704, 1, 1]         122,688
         Sigmoid-617           [32, 1704, 1, 1]               0
SqueezeExcitation-618         [32, 1704, 15, 15]               0
          Conv2d-619          [32, 468, 15, 15]         797,472
     BatchNorm2d-620          [32, 468, 15, 15]             936
InvertedResidualBlock-621          [32, 468, 15, 15]               0
          Conv2d-622         [32, 2808, 15, 15]      11,827,296
     BatchNorm2d-623         [32, 2808, 15, 15]           5,616
            SiLU-624         [32, 2808, 15, 15]               0
        CNNBlock-625         [32, 2808, 15, 15]               0
          Conv2d-626         [32, 2808, 15, 15]          25,272
     BatchNorm2d-627         [32, 2808, 15, 15]           5,616
            SiLU-628         [32, 2808, 15, 15]               0
        CNNBlock-629         [32, 2808, 15, 15]               0
AdaptiveAvgPool2d-630           [32, 2808, 1, 1]               0
          Conv2d-631            [32, 117, 1, 1]         328,653
            SiLU-632            [32, 117, 1, 1]               0
          Conv2d-633           [32, 2808, 1, 1]         331,344
         Sigmoid-634           [32, 2808, 1, 1]               0
SqueezeExcitation-635         [32, 2808, 15, 15]               0
          Conv2d-636          [32, 468, 15, 15]       1,314,144
     BatchNorm2d-637          [32, 468, 15, 15]             936
InvertedResidualBlock-638          [32, 468, 15, 15]               0
          Conv2d-639         [32, 2808, 15, 15]      11,827,296
     BatchNorm2d-640         [32, 2808, 15, 15]           5,616
            SiLU-641         [32, 2808, 15, 15]               0
        CNNBlock-642         [32, 2808, 15, 15]               0
          Conv2d-643         [32, 2808, 15, 15]          25,272
     BatchNorm2d-644         [32, 2808, 15, 15]           5,616
            SiLU-645         [32, 2808, 15, 15]               0
        CNNBlock-646         [32, 2808, 15, 15]               0
AdaptiveAvgPool2d-647           [32, 2808, 1, 1]               0
          Conv2d-648            [32, 117, 1, 1]         328,653
            SiLU-649            [32, 117, 1, 1]               0
          Conv2d-650           [32, 2808, 1, 1]         331,344
         Sigmoid-651           [32, 2808, 1, 1]               0
SqueezeExcitation-652         [32, 2808, 15, 15]               0
          Conv2d-653          [32, 468, 15, 15]       1,314,144
     BatchNorm2d-654          [32, 468, 15, 15]             936
InvertedResidualBlock-655          [32, 468, 15, 15]               0
          Conv2d-656         [32, 1875, 15, 15]         877,500
     BatchNorm2d-657         [32, 1875, 15, 15]           3,750
            SiLU-658         [32, 1875, 15, 15]               0
        CNNBlock-659         [32, 1875, 15, 15]               0
AdaptiveAvgPool2d-660           [32, 1875, 1, 1]               0
         Flatten-661                 [32, 1875]               0
         Dropout-662                 [32, 1875]               0
          Linear-663                    [32, 2]           3,752
    EfficientNet-664                    [32, 2]               0
================================================================
Total params: 95,385,667
Trainable params: 95,385,667
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 76.48
Forward/backward pass size (MB): 98277.91
Params size (MB): 363.87
Estimated Total Size (MB): 98718.26
----------------------------------------------------------------

