EfficientNetB0----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [32, 32, 112, 112]             864
       BatchNorm2d-2         [32, 32, 112, 112]              64
              SiLU-3         [32, 32, 112, 112]               0
          CNNBlock-4         [32, 32, 112, 112]               0
            Conv2d-5         [32, 32, 112, 112]             288
       BatchNorm2d-6         [32, 32, 112, 112]              64
              SiLU-7         [32, 32, 112, 112]               0
          CNNBlock-8         [32, 32, 112, 112]               0
 AdaptiveAvgPool2d-9             [32, 32, 1, 1]               0
           Conv2d-10              [32, 8, 1, 1]             264
             SiLU-11              [32, 8, 1, 1]               0
           Conv2d-12             [32, 32, 1, 1]             288
          Sigmoid-13             [32, 32, 1, 1]               0
SqueezeExcitation-14         [32, 32, 112, 112]               0
           Conv2d-15         [32, 16, 112, 112]             512
      BatchNorm2d-16         [32, 16, 112, 112]              32
InvertedResidualBlock-17         [32, 16, 112, 112]               0
           Conv2d-18         [32, 96, 112, 112]          13,824
      BatchNorm2d-19         [32, 96, 112, 112]             192
             SiLU-20         [32, 96, 112, 112]               0
         CNNBlock-21         [32, 96, 112, 112]               0
           Conv2d-22           [32, 96, 56, 56]             864
      BatchNorm2d-23           [32, 96, 56, 56]             192
             SiLU-24           [32, 96, 56, 56]               0
         CNNBlock-25           [32, 96, 56, 56]               0
AdaptiveAvgPool2d-26             [32, 96, 1, 1]               0
           Conv2d-27              [32, 4, 1, 1]             388
             SiLU-28              [32, 4, 1, 1]               0
           Conv2d-29             [32, 96, 1, 1]             480
          Sigmoid-30             [32, 96, 1, 1]               0
SqueezeExcitation-31           [32, 96, 56, 56]               0
           Conv2d-32           [32, 24, 56, 56]           2,304
      BatchNorm2d-33           [32, 24, 56, 56]              48
InvertedResidualBlock-34           [32, 24, 56, 56]               0
           Conv2d-35          [32, 144, 56, 56]          31,104
      BatchNorm2d-36          [32, 144, 56, 56]             288
             SiLU-37          [32, 144, 56, 56]               0
         CNNBlock-38          [32, 144, 56, 56]               0
           Conv2d-39          [32, 144, 56, 56]           1,296
      BatchNorm2d-40          [32, 144, 56, 56]             288
             SiLU-41          [32, 144, 56, 56]               0
         CNNBlock-42          [32, 144, 56, 56]               0
AdaptiveAvgPool2d-43            [32, 144, 1, 1]               0
           Conv2d-44              [32, 6, 1, 1]             870
             SiLU-45              [32, 6, 1, 1]               0
           Conv2d-46            [32, 144, 1, 1]           1,008
          Sigmoid-47            [32, 144, 1, 1]               0
SqueezeExcitation-48          [32, 144, 56, 56]               0
           Conv2d-49           [32, 24, 56, 56]           3,456
      BatchNorm2d-50           [32, 24, 56, 56]              48
InvertedResidualBlock-51           [32, 24, 56, 56]               0
           Conv2d-52          [32, 144, 56, 56]          31,104
      BatchNorm2d-53          [32, 144, 56, 56]             288
             SiLU-54          [32, 144, 56, 56]               0
         CNNBlock-55          [32, 144, 56, 56]               0
           Conv2d-56          [32, 144, 28, 28]           3,600
      BatchNorm2d-57          [32, 144, 28, 28]             288
             SiLU-58          [32, 144, 28, 28]               0
         CNNBlock-59          [32, 144, 28, 28]               0
AdaptiveAvgPool2d-60            [32, 144, 1, 1]               0
           Conv2d-61              [32, 6, 1, 1]             870
             SiLU-62              [32, 6, 1, 1]               0
           Conv2d-63            [32, 144, 1, 1]           1,008
          Sigmoid-64            [32, 144, 1, 1]               0
SqueezeExcitation-65          [32, 144, 28, 28]               0
           Conv2d-66           [32, 40, 28, 28]           5,760
      BatchNorm2d-67           [32, 40, 28, 28]              80
InvertedResidualBlock-68           [32, 40, 28, 28]               0
           Conv2d-69          [32, 240, 28, 28]          86,400
      BatchNorm2d-70          [32, 240, 28, 28]             480
             SiLU-71          [32, 240, 28, 28]               0
         CNNBlock-72          [32, 240, 28, 28]               0
           Conv2d-73          [32, 240, 28, 28]           6,000
      BatchNorm2d-74          [32, 240, 28, 28]             480
             SiLU-75          [32, 240, 28, 28]               0
         CNNBlock-76          [32, 240, 28, 28]               0
AdaptiveAvgPool2d-77            [32, 240, 1, 1]               0
           Conv2d-78             [32, 10, 1, 1]           2,410
             SiLU-79             [32, 10, 1, 1]               0
           Conv2d-80            [32, 240, 1, 1]           2,640
          Sigmoid-81            [32, 240, 1, 1]               0
SqueezeExcitation-82          [32, 240, 28, 28]               0
           Conv2d-83           [32, 40, 28, 28]           9,600
      BatchNorm2d-84           [32, 40, 28, 28]              80
InvertedResidualBlock-85           [32, 40, 28, 28]               0
           Conv2d-86          [32, 240, 28, 28]          86,400
      BatchNorm2d-87          [32, 240, 28, 28]             480
             SiLU-88          [32, 240, 28, 28]               0
         CNNBlock-89          [32, 240, 28, 28]               0
           Conv2d-90          [32, 240, 14, 14]           2,160
      BatchNorm2d-91          [32, 240, 14, 14]             480
             SiLU-92          [32, 240, 14, 14]               0
         CNNBlock-93          [32, 240, 14, 14]               0
AdaptiveAvgPool2d-94            [32, 240, 1, 1]               0
           Conv2d-95             [32, 10, 1, 1]           2,410
             SiLU-96             [32, 10, 1, 1]               0
           Conv2d-97            [32, 240, 1, 1]           2,640
          Sigmoid-98            [32, 240, 1, 1]               0
SqueezeExcitation-99          [32, 240, 14, 14]               0
          Conv2d-100           [32, 80, 14, 14]          19,200
     BatchNorm2d-101           [32, 80, 14, 14]             160
InvertedResidualBlock-102           [32, 80, 14, 14]               0
          Conv2d-103          [32, 480, 14, 14]         345,600
     BatchNorm2d-104          [32, 480, 14, 14]             960
            SiLU-105          [32, 480, 14, 14]               0
        CNNBlock-106          [32, 480, 14, 14]               0
          Conv2d-107          [32, 480, 14, 14]           4,320
     BatchNorm2d-108          [32, 480, 14, 14]             960
            SiLU-109          [32, 480, 14, 14]               0
        CNNBlock-110          [32, 480, 14, 14]               0
AdaptiveAvgPool2d-111            [32, 480, 1, 1]               0
          Conv2d-112             [32, 20, 1, 1]           9,620
            SiLU-113             [32, 20, 1, 1]               0
          Conv2d-114            [32, 480, 1, 1]          10,080
         Sigmoid-115            [32, 480, 1, 1]               0
SqueezeExcitation-116          [32, 480, 14, 14]               0
          Conv2d-117           [32, 80, 14, 14]          38,400
     BatchNorm2d-118           [32, 80, 14, 14]             160
InvertedResidualBlock-119           [32, 80, 14, 14]               0
          Conv2d-120          [32, 480, 14, 14]         345,600
     BatchNorm2d-121          [32, 480, 14, 14]             960
            SiLU-122          [32, 480, 14, 14]               0
        CNNBlock-123          [32, 480, 14, 14]               0
          Conv2d-124          [32, 480, 14, 14]           4,320
     BatchNorm2d-125          [32, 480, 14, 14]             960
            SiLU-126          [32, 480, 14, 14]               0
        CNNBlock-127          [32, 480, 14, 14]               0
AdaptiveAvgPool2d-128            [32, 480, 1, 1]               0
          Conv2d-129             [32, 20, 1, 1]           9,620
            SiLU-130             [32, 20, 1, 1]               0
          Conv2d-131            [32, 480, 1, 1]          10,080
         Sigmoid-132            [32, 480, 1, 1]               0
SqueezeExcitation-133          [32, 480, 14, 14]               0
          Conv2d-134           [32, 80, 14, 14]          38,400
     BatchNorm2d-135           [32, 80, 14, 14]             160
InvertedResidualBlock-136           [32, 80, 14, 14]               0
          Conv2d-137          [32, 480, 14, 14]         345,600
     BatchNorm2d-138          [32, 480, 14, 14]             960
            SiLU-139          [32, 480, 14, 14]               0
        CNNBlock-140          [32, 480, 14, 14]               0
          Conv2d-141          [32, 480, 14, 14]          12,000
     BatchNorm2d-142          [32, 480, 14, 14]             960
            SiLU-143          [32, 480, 14, 14]               0
        CNNBlock-144          [32, 480, 14, 14]               0
AdaptiveAvgPool2d-145            [32, 480, 1, 1]               0
          Conv2d-146             [32, 20, 1, 1]           9,620
            SiLU-147             [32, 20, 1, 1]               0
          Conv2d-148            [32, 480, 1, 1]          10,080
         Sigmoid-149            [32, 480, 1, 1]               0
SqueezeExcitation-150          [32, 480, 14, 14]               0
          Conv2d-151          [32, 112, 14, 14]          53,760
     BatchNorm2d-152          [32, 112, 14, 14]             224
InvertedResidualBlock-153          [32, 112, 14, 14]               0
          Conv2d-154          [32, 672, 14, 14]         677,376
     BatchNorm2d-155          [32, 672, 14, 14]           1,344
            SiLU-156          [32, 672, 14, 14]               0
        CNNBlock-157          [32, 672, 14, 14]               0
          Conv2d-158          [32, 672, 14, 14]          16,800
     BatchNorm2d-159          [32, 672, 14, 14]           1,344
            SiLU-160          [32, 672, 14, 14]               0
        CNNBlock-161          [32, 672, 14, 14]               0
AdaptiveAvgPool2d-162            [32, 672, 1, 1]               0
          Conv2d-163             [32, 28, 1, 1]          18,844
            SiLU-164             [32, 28, 1, 1]               0
          Conv2d-165            [32, 672, 1, 1]          19,488
         Sigmoid-166            [32, 672, 1, 1]               0
SqueezeExcitation-167          [32, 672, 14, 14]               0
          Conv2d-168          [32, 112, 14, 14]          75,264
     BatchNorm2d-169          [32, 112, 14, 14]             224
InvertedResidualBlock-170          [32, 112, 14, 14]               0
          Conv2d-171          [32, 672, 14, 14]         677,376
     BatchNorm2d-172          [32, 672, 14, 14]           1,344
            SiLU-173          [32, 672, 14, 14]               0
        CNNBlock-174          [32, 672, 14, 14]               0
          Conv2d-175          [32, 672, 14, 14]          16,800
     BatchNorm2d-176          [32, 672, 14, 14]           1,344
            SiLU-177          [32, 672, 14, 14]               0
        CNNBlock-178          [32, 672, 14, 14]               0
AdaptiveAvgPool2d-179            [32, 672, 1, 1]               0
          Conv2d-180             [32, 28, 1, 1]          18,844
            SiLU-181             [32, 28, 1, 1]               0
          Conv2d-182            [32, 672, 1, 1]          19,488
         Sigmoid-183            [32, 672, 1, 1]               0
SqueezeExcitation-184          [32, 672, 14, 14]               0
          Conv2d-185          [32, 112, 14, 14]          75,264
     BatchNorm2d-186          [32, 112, 14, 14]             224
InvertedResidualBlock-187          [32, 112, 14, 14]               0
          Conv2d-188          [32, 672, 14, 14]         677,376
     BatchNorm2d-189          [32, 672, 14, 14]           1,344
            SiLU-190          [32, 672, 14, 14]               0
        CNNBlock-191          [32, 672, 14, 14]               0
          Conv2d-192            [32, 672, 7, 7]          16,800
     BatchNorm2d-193            [32, 672, 7, 7]           1,344
            SiLU-194            [32, 672, 7, 7]               0
        CNNBlock-195            [32, 672, 7, 7]               0
AdaptiveAvgPool2d-196            [32, 672, 1, 1]               0
          Conv2d-197             [32, 28, 1, 1]          18,844
            SiLU-198             [32, 28, 1, 1]               0
          Conv2d-199            [32, 672, 1, 1]          19,488
         Sigmoid-200            [32, 672, 1, 1]               0
SqueezeExcitation-201            [32, 672, 7, 7]               0
          Conv2d-202            [32, 192, 7, 7]         129,024
     BatchNorm2d-203            [32, 192, 7, 7]             384
InvertedResidualBlock-204            [32, 192, 7, 7]               0
          Conv2d-205           [32, 1152, 7, 7]       1,990,656
     BatchNorm2d-206           [32, 1152, 7, 7]           2,304
            SiLU-207           [32, 1152, 7, 7]               0
        CNNBlock-208           [32, 1152, 7, 7]               0
          Conv2d-209           [32, 1152, 7, 7]          28,800
     BatchNorm2d-210           [32, 1152, 7, 7]           2,304
            SiLU-211           [32, 1152, 7, 7]               0
        CNNBlock-212           [32, 1152, 7, 7]               0
AdaptiveAvgPool2d-213           [32, 1152, 1, 1]               0
          Conv2d-214             [32, 48, 1, 1]          55,344
            SiLU-215             [32, 48, 1, 1]               0
          Conv2d-216           [32, 1152, 1, 1]          56,448
         Sigmoid-217           [32, 1152, 1, 1]               0
SqueezeExcitation-218           [32, 1152, 7, 7]               0
          Conv2d-219            [32, 192, 7, 7]         221,184
     BatchNorm2d-220            [32, 192, 7, 7]             384
InvertedResidualBlock-221            [32, 192, 7, 7]               0
          Conv2d-222           [32, 1152, 7, 7]       1,990,656
     BatchNorm2d-223           [32, 1152, 7, 7]           2,304
            SiLU-224           [32, 1152, 7, 7]               0
        CNNBlock-225           [32, 1152, 7, 7]               0
          Conv2d-226           [32, 1152, 7, 7]          28,800
     BatchNorm2d-227           [32, 1152, 7, 7]           2,304
            SiLU-228           [32, 1152, 7, 7]               0
        CNNBlock-229           [32, 1152, 7, 7]               0
AdaptiveAvgPool2d-230           [32, 1152, 1, 1]               0
          Conv2d-231             [32, 48, 1, 1]          55,344
            SiLU-232             [32, 48, 1, 1]               0
          Conv2d-233           [32, 1152, 1, 1]          56,448
         Sigmoid-234           [32, 1152, 1, 1]               0
SqueezeExcitation-235           [32, 1152, 7, 7]               0
          Conv2d-236            [32, 192, 7, 7]         221,184
     BatchNorm2d-237            [32, 192, 7, 7]             384
InvertedResidualBlock-238            [32, 192, 7, 7]               0
          Conv2d-239           [32, 1152, 7, 7]       1,990,656
     BatchNorm2d-240           [32, 1152, 7, 7]           2,304
            SiLU-241           [32, 1152, 7, 7]               0
        CNNBlock-242           [32, 1152, 7, 7]               0
          Conv2d-243           [32, 1152, 7, 7]          28,800
     BatchNorm2d-244           [32, 1152, 7, 7]           2,304
            SiLU-245           [32, 1152, 7, 7]               0
        CNNBlock-246           [32, 1152, 7, 7]               0
AdaptiveAvgPool2d-247           [32, 1152, 1, 1]               0
          Conv2d-248             [32, 48, 1, 1]          55,344
            SiLU-249             [32, 48, 1, 1]               0
          Conv2d-250           [32, 1152, 1, 1]          56,448
         Sigmoid-251           [32, 1152, 1, 1]               0
SqueezeExcitation-252           [32, 1152, 7, 7]               0
          Conv2d-253            [32, 192, 7, 7]         221,184
     BatchNorm2d-254            [32, 192, 7, 7]             384
InvertedResidualBlock-255            [32, 192, 7, 7]               0
          Conv2d-256           [32, 1152, 7, 7]       1,990,656
     BatchNorm2d-257           [32, 1152, 7, 7]           2,304
            SiLU-258           [32, 1152, 7, 7]               0
        CNNBlock-259           [32, 1152, 7, 7]               0
          Conv2d-260           [32, 1152, 7, 7]          10,368
     BatchNorm2d-261           [32, 1152, 7, 7]           2,304
            SiLU-262           [32, 1152, 7, 7]               0
        CNNBlock-263           [32, 1152, 7, 7]               0
AdaptiveAvgPool2d-264           [32, 1152, 1, 1]               0
          Conv2d-265             [32, 48, 1, 1]          55,344
            SiLU-266             [32, 48, 1, 1]               0
          Conv2d-267           [32, 1152, 1, 1]          56,448
         Sigmoid-268           [32, 1152, 1, 1]               0
SqueezeExcitation-269           [32, 1152, 7, 7]               0
          Conv2d-270            [32, 320, 7, 7]         368,640
     BatchNorm2d-271            [32, 320, 7, 7]             640
InvertedResidualBlock-272            [32, 320, 7, 7]               0
          Conv2d-273           [32, 1280, 7, 7]         409,600
     BatchNorm2d-274           [32, 1280, 7, 7]           2,560
            SiLU-275           [32, 1280, 7, 7]               0
        CNNBlock-276           [32, 1280, 7, 7]               0
AdaptiveAvgPool2d-277           [32, 1280, 1, 1]               0
         Flatten-278                 [32, 1280]               0
         Dropout-279                 [32, 1280]               0
          Linear-280                    [32, 2]           2,562
    EfficientNet-281                    [32, 2]               0
================================================================
Total params: 14,037,118
Trainable params: 14,037,118
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 18.38
Forward/backward pass size (MB): 7008.94
Params size (MB): 53.55
Estimated Total Size (MB): 7080.87
----------------------------------------------------------------

