EfficientNetB3----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [32, 38, 150, 150]           1,026
       BatchNorm2d-2         [32, 38, 150, 150]              76
              SiLU-3         [32, 38, 150, 150]               0
          CNNBlock-4         [32, 38, 150, 150]               0
            Conv2d-5         [32, 38, 150, 150]             342
       BatchNorm2d-6         [32, 38, 150, 150]              76
              SiLU-7         [32, 38, 150, 150]               0
          CNNBlock-8         [32, 38, 150, 150]               0
 AdaptiveAvgPool2d-9             [32, 38, 1, 1]               0
           Conv2d-10              [32, 9, 1, 1]             351
             SiLU-11              [32, 9, 1, 1]               0
           Conv2d-12             [32, 38, 1, 1]             380
          Sigmoid-13             [32, 38, 1, 1]               0
SqueezeExcitation-14         [32, 38, 150, 150]               0
           Conv2d-15         [32, 20, 150, 150]             760
      BatchNorm2d-16         [32, 20, 150, 150]              40
InvertedResidualBlock-17         [32, 20, 150, 150]               0
           Conv2d-18         [32, 20, 150, 150]             180
      BatchNorm2d-19         [32, 20, 150, 150]              40
             SiLU-20         [32, 20, 150, 150]               0
         CNNBlock-21         [32, 20, 150, 150]               0
AdaptiveAvgPool2d-22             [32, 20, 1, 1]               0
           Conv2d-23              [32, 5, 1, 1]             105
             SiLU-24              [32, 5, 1, 1]               0
           Conv2d-25             [32, 20, 1, 1]             120
          Sigmoid-26             [32, 20, 1, 1]               0
SqueezeExcitation-27         [32, 20, 150, 150]               0
           Conv2d-28         [32, 20, 150, 150]             400
      BatchNorm2d-29         [32, 20, 150, 150]              40
InvertedResidualBlock-30         [32, 20, 150, 150]               0
           Conv2d-31        [32, 120, 150, 150]          21,600
      BatchNorm2d-32        [32, 120, 150, 150]             240
             SiLU-33        [32, 120, 150, 150]               0
         CNNBlock-34        [32, 120, 150, 150]               0
           Conv2d-35          [32, 120, 75, 75]           1,080
      BatchNorm2d-36          [32, 120, 75, 75]             240
             SiLU-37          [32, 120, 75, 75]               0
         CNNBlock-38          [32, 120, 75, 75]               0
AdaptiveAvgPool2d-39            [32, 120, 1, 1]               0
           Conv2d-40              [32, 5, 1, 1]             605
             SiLU-41              [32, 5, 1, 1]               0
           Conv2d-42            [32, 120, 1, 1]             720
          Sigmoid-43            [32, 120, 1, 1]               0
SqueezeExcitation-44          [32, 120, 75, 75]               0
           Conv2d-45           [32, 32, 75, 75]           3,840
      BatchNorm2d-46           [32, 32, 75, 75]              64
InvertedResidualBlock-47           [32, 32, 75, 75]               0
           Conv2d-48          [32, 192, 75, 75]          55,296
      BatchNorm2d-49          [32, 192, 75, 75]             384
             SiLU-50          [32, 192, 75, 75]               0
         CNNBlock-51          [32, 192, 75, 75]               0
           Conv2d-52          [32, 192, 75, 75]           1,728
      BatchNorm2d-53          [32, 192, 75, 75]             384
             SiLU-54          [32, 192, 75, 75]               0
         CNNBlock-55          [32, 192, 75, 75]               0
AdaptiveAvgPool2d-56            [32, 192, 1, 1]               0
           Conv2d-57              [32, 8, 1, 1]           1,544
             SiLU-58              [32, 8, 1, 1]               0
           Conv2d-59            [32, 192, 1, 1]           1,728
          Sigmoid-60            [32, 192, 1, 1]               0
SqueezeExcitation-61          [32, 192, 75, 75]               0
           Conv2d-62           [32, 32, 75, 75]           6,144
      BatchNorm2d-63           [32, 32, 75, 75]              64
InvertedResidualBlock-64           [32, 32, 75, 75]               0
           Conv2d-65          [32, 192, 75, 75]          55,296
      BatchNorm2d-66          [32, 192, 75, 75]             384
             SiLU-67          [32, 192, 75, 75]               0
         CNNBlock-68          [32, 192, 75, 75]               0
           Conv2d-69          [32, 192, 75, 75]           1,728
      BatchNorm2d-70          [32, 192, 75, 75]             384
             SiLU-71          [32, 192, 75, 75]               0
         CNNBlock-72          [32, 192, 75, 75]               0
AdaptiveAvgPool2d-73            [32, 192, 1, 1]               0
           Conv2d-74              [32, 8, 1, 1]           1,544
             SiLU-75              [32, 8, 1, 1]               0
           Conv2d-76            [32, 192, 1, 1]           1,728
          Sigmoid-77            [32, 192, 1, 1]               0
SqueezeExcitation-78          [32, 192, 75, 75]               0
           Conv2d-79           [32, 32, 75, 75]           6,144
      BatchNorm2d-80           [32, 32, 75, 75]              64
InvertedResidualBlock-81           [32, 32, 75, 75]               0
           Conv2d-82          [32, 192, 75, 75]          55,296
      BatchNorm2d-83          [32, 192, 75, 75]             384
             SiLU-84          [32, 192, 75, 75]               0
         CNNBlock-85          [32, 192, 75, 75]               0
           Conv2d-86          [32, 192, 38, 38]           4,800
      BatchNorm2d-87          [32, 192, 38, 38]             384
             SiLU-88          [32, 192, 38, 38]               0
         CNNBlock-89          [32, 192, 38, 38]               0
AdaptiveAvgPool2d-90            [32, 192, 1, 1]               0
           Conv2d-91              [32, 8, 1, 1]           1,544
             SiLU-92              [32, 8, 1, 1]               0
           Conv2d-93            [32, 192, 1, 1]           1,728
          Sigmoid-94            [32, 192, 1, 1]               0
SqueezeExcitation-95          [32, 192, 38, 38]               0
           Conv2d-96           [32, 48, 38, 38]           9,216
      BatchNorm2d-97           [32, 48, 38, 38]              96
InvertedResidualBlock-98           [32, 48, 38, 38]               0
           Conv2d-99          [32, 288, 38, 38]         124,416
     BatchNorm2d-100          [32, 288, 38, 38]             576
            SiLU-101          [32, 288, 38, 38]               0
        CNNBlock-102          [32, 288, 38, 38]               0
          Conv2d-103          [32, 288, 38, 38]           7,200
     BatchNorm2d-104          [32, 288, 38, 38]             576
            SiLU-105          [32, 288, 38, 38]               0
        CNNBlock-106          [32, 288, 38, 38]               0
AdaptiveAvgPool2d-107            [32, 288, 1, 1]               0
          Conv2d-108             [32, 12, 1, 1]           3,468
            SiLU-109             [32, 12, 1, 1]               0
          Conv2d-110            [32, 288, 1, 1]           3,744
         Sigmoid-111            [32, 288, 1, 1]               0
SqueezeExcitation-112          [32, 288, 38, 38]               0
          Conv2d-113           [32, 48, 38, 38]          13,824
     BatchNorm2d-114           [32, 48, 38, 38]              96
InvertedResidualBlock-115           [32, 48, 38, 38]               0
          Conv2d-116          [32, 288, 38, 38]         124,416
     BatchNorm2d-117          [32, 288, 38, 38]             576
            SiLU-118          [32, 288, 38, 38]               0
        CNNBlock-119          [32, 288, 38, 38]               0
          Conv2d-120          [32, 288, 38, 38]           7,200
     BatchNorm2d-121          [32, 288, 38, 38]             576
            SiLU-122          [32, 288, 38, 38]               0
        CNNBlock-123          [32, 288, 38, 38]               0
AdaptiveAvgPool2d-124            [32, 288, 1, 1]               0
          Conv2d-125             [32, 12, 1, 1]           3,468
            SiLU-126             [32, 12, 1, 1]               0
          Conv2d-127            [32, 288, 1, 1]           3,744
         Sigmoid-128            [32, 288, 1, 1]               0
SqueezeExcitation-129          [32, 288, 38, 38]               0
          Conv2d-130           [32, 48, 38, 38]          13,824
     BatchNorm2d-131           [32, 48, 38, 38]              96
InvertedResidualBlock-132           [32, 48, 38, 38]               0
          Conv2d-133          [32, 288, 38, 38]         124,416
     BatchNorm2d-134          [32, 288, 38, 38]             576
            SiLU-135          [32, 288, 38, 38]               0
        CNNBlock-136          [32, 288, 38, 38]               0
          Conv2d-137          [32, 288, 19, 19]           2,592
     BatchNorm2d-138          [32, 288, 19, 19]             576
            SiLU-139          [32, 288, 19, 19]               0
        CNNBlock-140          [32, 288, 19, 19]               0
AdaptiveAvgPool2d-141            [32, 288, 1, 1]               0
          Conv2d-142             [32, 12, 1, 1]           3,468
            SiLU-143             [32, 12, 1, 1]               0
          Conv2d-144            [32, 288, 1, 1]           3,744
         Sigmoid-145            [32, 288, 1, 1]               0
SqueezeExcitation-146          [32, 288, 19, 19]               0
          Conv2d-147           [32, 96, 19, 19]          27,648
     BatchNorm2d-148           [32, 96, 19, 19]             192
InvertedResidualBlock-149           [32, 96, 19, 19]               0
          Conv2d-150          [32, 576, 19, 19]         497,664
     BatchNorm2d-151          [32, 576, 19, 19]           1,152
            SiLU-152          [32, 576, 19, 19]               0
        CNNBlock-153          [32, 576, 19, 19]               0
          Conv2d-154          [32, 576, 19, 19]           5,184
     BatchNorm2d-155          [32, 576, 19, 19]           1,152
            SiLU-156          [32, 576, 19, 19]               0
        CNNBlock-157          [32, 576, 19, 19]               0
AdaptiveAvgPool2d-158            [32, 576, 1, 1]               0
          Conv2d-159             [32, 24, 1, 1]          13,848
            SiLU-160             [32, 24, 1, 1]               0
          Conv2d-161            [32, 576, 1, 1]          14,400
         Sigmoid-162            [32, 576, 1, 1]               0
SqueezeExcitation-163          [32, 576, 19, 19]               0
          Conv2d-164           [32, 96, 19, 19]          55,296
     BatchNorm2d-165           [32, 96, 19, 19]             192
InvertedResidualBlock-166           [32, 96, 19, 19]               0
          Conv2d-167          [32, 576, 19, 19]         497,664
     BatchNorm2d-168          [32, 576, 19, 19]           1,152
            SiLU-169          [32, 576, 19, 19]               0
        CNNBlock-170          [32, 576, 19, 19]               0
          Conv2d-171          [32, 576, 19, 19]           5,184
     BatchNorm2d-172          [32, 576, 19, 19]           1,152
            SiLU-173          [32, 576, 19, 19]               0
        CNNBlock-174          [32, 576, 19, 19]               0
AdaptiveAvgPool2d-175            [32, 576, 1, 1]               0
          Conv2d-176             [32, 24, 1, 1]          13,848
            SiLU-177             [32, 24, 1, 1]               0
          Conv2d-178            [32, 576, 1, 1]          14,400
         Sigmoid-179            [32, 576, 1, 1]               0
SqueezeExcitation-180          [32, 576, 19, 19]               0
          Conv2d-181           [32, 96, 19, 19]          55,296
     BatchNorm2d-182           [32, 96, 19, 19]             192
InvertedResidualBlock-183           [32, 96, 19, 19]               0
          Conv2d-184          [32, 576, 19, 19]         497,664
     BatchNorm2d-185          [32, 576, 19, 19]           1,152
            SiLU-186          [32, 576, 19, 19]               0
        CNNBlock-187          [32, 576, 19, 19]               0
          Conv2d-188          [32, 576, 19, 19]           5,184
     BatchNorm2d-189          [32, 576, 19, 19]           1,152
            SiLU-190          [32, 576, 19, 19]               0
        CNNBlock-191          [32, 576, 19, 19]               0
AdaptiveAvgPool2d-192            [32, 576, 1, 1]               0
          Conv2d-193             [32, 24, 1, 1]          13,848
            SiLU-194             [32, 24, 1, 1]               0
          Conv2d-195            [32, 576, 1, 1]          14,400
         Sigmoid-196            [32, 576, 1, 1]               0
SqueezeExcitation-197          [32, 576, 19, 19]               0
          Conv2d-198           [32, 96, 19, 19]          55,296
     BatchNorm2d-199           [32, 96, 19, 19]             192
InvertedResidualBlock-200           [32, 96, 19, 19]               0
          Conv2d-201          [32, 576, 19, 19]         497,664
     BatchNorm2d-202          [32, 576, 19, 19]           1,152
            SiLU-203          [32, 576, 19, 19]               0
        CNNBlock-204          [32, 576, 19, 19]               0
          Conv2d-205          [32, 576, 19, 19]           5,184
     BatchNorm2d-206          [32, 576, 19, 19]           1,152
            SiLU-207          [32, 576, 19, 19]               0
        CNNBlock-208          [32, 576, 19, 19]               0
AdaptiveAvgPool2d-209            [32, 576, 1, 1]               0
          Conv2d-210             [32, 24, 1, 1]          13,848
            SiLU-211             [32, 24, 1, 1]               0
          Conv2d-212            [32, 576, 1, 1]          14,400
         Sigmoid-213            [32, 576, 1, 1]               0
SqueezeExcitation-214          [32, 576, 19, 19]               0
          Conv2d-215           [32, 96, 19, 19]          55,296
     BatchNorm2d-216           [32, 96, 19, 19]             192
InvertedResidualBlock-217           [32, 96, 19, 19]               0
          Conv2d-218          [32, 576, 19, 19]         497,664
     BatchNorm2d-219          [32, 576, 19, 19]           1,152
            SiLU-220          [32, 576, 19, 19]               0
        CNNBlock-221          [32, 576, 19, 19]               0
          Conv2d-222          [32, 576, 19, 19]          14,400
     BatchNorm2d-223          [32, 576, 19, 19]           1,152
            SiLU-224          [32, 576, 19, 19]               0
        CNNBlock-225          [32, 576, 19, 19]               0
AdaptiveAvgPool2d-226            [32, 576, 1, 1]               0
          Conv2d-227             [32, 24, 1, 1]          13,848
            SiLU-228             [32, 24, 1, 1]               0
          Conv2d-229            [32, 576, 1, 1]          14,400
         Sigmoid-230            [32, 576, 1, 1]               0
SqueezeExcitation-231          [32, 576, 19, 19]               0
          Conv2d-232          [32, 136, 19, 19]          78,336
     BatchNorm2d-233          [32, 136, 19, 19]             272
InvertedResidualBlock-234          [32, 136, 19, 19]               0
          Conv2d-235          [32, 816, 19, 19]         998,784
     BatchNorm2d-236          [32, 816, 19, 19]           1,632
            SiLU-237          [32, 816, 19, 19]               0
        CNNBlock-238          [32, 816, 19, 19]               0
          Conv2d-239          [32, 816, 19, 19]          20,400
     BatchNorm2d-240          [32, 816, 19, 19]           1,632
            SiLU-241          [32, 816, 19, 19]               0
        CNNBlock-242          [32, 816, 19, 19]               0
AdaptiveAvgPool2d-243            [32, 816, 1, 1]               0
          Conv2d-244             [32, 34, 1, 1]          27,778
            SiLU-245             [32, 34, 1, 1]               0
          Conv2d-246            [32, 816, 1, 1]          28,560
         Sigmoid-247            [32, 816, 1, 1]               0
SqueezeExcitation-248          [32, 816, 19, 19]               0
          Conv2d-249          [32, 136, 19, 19]         110,976
     BatchNorm2d-250          [32, 136, 19, 19]             272
InvertedResidualBlock-251          [32, 136, 19, 19]               0
          Conv2d-252          [32, 816, 19, 19]         998,784
     BatchNorm2d-253          [32, 816, 19, 19]           1,632
            SiLU-254          [32, 816, 19, 19]               0
        CNNBlock-255          [32, 816, 19, 19]               0
          Conv2d-256          [32, 816, 19, 19]          20,400
     BatchNorm2d-257          [32, 816, 19, 19]           1,632
            SiLU-258          [32, 816, 19, 19]               0
        CNNBlock-259          [32, 816, 19, 19]               0
AdaptiveAvgPool2d-260            [32, 816, 1, 1]               0
          Conv2d-261             [32, 34, 1, 1]          27,778
            SiLU-262             [32, 34, 1, 1]               0
          Conv2d-263            [32, 816, 1, 1]          28,560
         Sigmoid-264            [32, 816, 1, 1]               0
SqueezeExcitation-265          [32, 816, 19, 19]               0
          Conv2d-266          [32, 136, 19, 19]         110,976
     BatchNorm2d-267          [32, 136, 19, 19]             272
InvertedResidualBlock-268          [32, 136, 19, 19]               0
          Conv2d-269          [32, 816, 19, 19]         998,784
     BatchNorm2d-270          [32, 816, 19, 19]           1,632
            SiLU-271          [32, 816, 19, 19]               0
        CNNBlock-272          [32, 816, 19, 19]               0
          Conv2d-273          [32, 816, 19, 19]          20,400
     BatchNorm2d-274          [32, 816, 19, 19]           1,632
            SiLU-275          [32, 816, 19, 19]               0
        CNNBlock-276          [32, 816, 19, 19]               0
AdaptiveAvgPool2d-277            [32, 816, 1, 1]               0
          Conv2d-278             [32, 34, 1, 1]          27,778
            SiLU-279             [32, 34, 1, 1]               0
          Conv2d-280            [32, 816, 1, 1]          28,560
         Sigmoid-281            [32, 816, 1, 1]               0
SqueezeExcitation-282          [32, 816, 19, 19]               0
          Conv2d-283          [32, 136, 19, 19]         110,976
     BatchNorm2d-284          [32, 136, 19, 19]             272
InvertedResidualBlock-285          [32, 136, 19, 19]               0
          Conv2d-286          [32, 816, 19, 19]         998,784
     BatchNorm2d-287          [32, 816, 19, 19]           1,632
            SiLU-288          [32, 816, 19, 19]               0
        CNNBlock-289          [32, 816, 19, 19]               0
          Conv2d-290          [32, 816, 19, 19]          20,400
     BatchNorm2d-291          [32, 816, 19, 19]           1,632
            SiLU-292          [32, 816, 19, 19]               0
        CNNBlock-293          [32, 816, 19, 19]               0
AdaptiveAvgPool2d-294            [32, 816, 1, 1]               0
          Conv2d-295             [32, 34, 1, 1]          27,778
            SiLU-296             [32, 34, 1, 1]               0
          Conv2d-297            [32, 816, 1, 1]          28,560
         Sigmoid-298            [32, 816, 1, 1]               0
SqueezeExcitation-299          [32, 816, 19, 19]               0
          Conv2d-300          [32, 136, 19, 19]         110,976
     BatchNorm2d-301          [32, 136, 19, 19]             272
InvertedResidualBlock-302          [32, 136, 19, 19]               0
          Conv2d-303          [32, 816, 19, 19]         998,784
     BatchNorm2d-304          [32, 816, 19, 19]           1,632
            SiLU-305          [32, 816, 19, 19]               0
        CNNBlock-306          [32, 816, 19, 19]               0
          Conv2d-307          [32, 816, 10, 10]          20,400
     BatchNorm2d-308          [32, 816, 10, 10]           1,632
            SiLU-309          [32, 816, 10, 10]               0
        CNNBlock-310          [32, 816, 10, 10]               0
AdaptiveAvgPool2d-311            [32, 816, 1, 1]               0
          Conv2d-312             [32, 34, 1, 1]          27,778
            SiLU-313             [32, 34, 1, 1]               0
          Conv2d-314            [32, 816, 1, 1]          28,560
         Sigmoid-315            [32, 816, 1, 1]               0
SqueezeExcitation-316          [32, 816, 10, 10]               0
          Conv2d-317          [32, 232, 10, 10]         189,312
     BatchNorm2d-318          [32, 232, 10, 10]             464
InvertedResidualBlock-319          [32, 232, 10, 10]               0
          Conv2d-320         [32, 1392, 10, 10]       2,906,496
     BatchNorm2d-321         [32, 1392, 10, 10]           2,784
            SiLU-322         [32, 1392, 10, 10]               0
        CNNBlock-323         [32, 1392, 10, 10]               0
          Conv2d-324         [32, 1392, 10, 10]          34,800
     BatchNorm2d-325         [32, 1392, 10, 10]           2,784
            SiLU-326         [32, 1392, 10, 10]               0
        CNNBlock-327         [32, 1392, 10, 10]               0
AdaptiveAvgPool2d-328           [32, 1392, 1, 1]               0
          Conv2d-329             [32, 58, 1, 1]          80,794
            SiLU-330             [32, 58, 1, 1]               0
          Conv2d-331           [32, 1392, 1, 1]          82,128
         Sigmoid-332           [32, 1392, 1, 1]               0
SqueezeExcitation-333         [32, 1392, 10, 10]               0
          Conv2d-334          [32, 232, 10, 10]         322,944
     BatchNorm2d-335          [32, 232, 10, 10]             464
InvertedResidualBlock-336          [32, 232, 10, 10]               0
          Conv2d-337         [32, 1392, 10, 10]       2,906,496
     BatchNorm2d-338         [32, 1392, 10, 10]           2,784
            SiLU-339         [32, 1392, 10, 10]               0
        CNNBlock-340         [32, 1392, 10, 10]               0
          Conv2d-341         [32, 1392, 10, 10]          34,800
     BatchNorm2d-342         [32, 1392, 10, 10]           2,784
            SiLU-343         [32, 1392, 10, 10]               0
        CNNBlock-344         [32, 1392, 10, 10]               0
AdaptiveAvgPool2d-345           [32, 1392, 1, 1]               0
          Conv2d-346             [32, 58, 1, 1]          80,794
            SiLU-347             [32, 58, 1, 1]               0
          Conv2d-348           [32, 1392, 1, 1]          82,128
         Sigmoid-349           [32, 1392, 1, 1]               0
SqueezeExcitation-350         [32, 1392, 10, 10]               0
          Conv2d-351          [32, 232, 10, 10]         322,944
     BatchNorm2d-352          [32, 232, 10, 10]             464
InvertedResidualBlock-353          [32, 232, 10, 10]               0
          Conv2d-354         [32, 1392, 10, 10]       2,906,496
     BatchNorm2d-355         [32, 1392, 10, 10]           2,784
            SiLU-356         [32, 1392, 10, 10]               0
        CNNBlock-357         [32, 1392, 10, 10]               0
          Conv2d-358         [32, 1392, 10, 10]          34,800
     BatchNorm2d-359         [32, 1392, 10, 10]           2,784
            SiLU-360         [32, 1392, 10, 10]               0
        CNNBlock-361         [32, 1392, 10, 10]               0
AdaptiveAvgPool2d-362           [32, 1392, 1, 1]               0
          Conv2d-363             [32, 58, 1, 1]          80,794
            SiLU-364             [32, 58, 1, 1]               0
          Conv2d-365           [32, 1392, 1, 1]          82,128
         Sigmoid-366           [32, 1392, 1, 1]               0
SqueezeExcitation-367         [32, 1392, 10, 10]               0
          Conv2d-368          [32, 232, 10, 10]         322,944
     BatchNorm2d-369          [32, 232, 10, 10]             464
InvertedResidualBlock-370          [32, 232, 10, 10]               0
          Conv2d-371         [32, 1392, 10, 10]       2,906,496
     BatchNorm2d-372         [32, 1392, 10, 10]           2,784
            SiLU-373         [32, 1392, 10, 10]               0
        CNNBlock-374         [32, 1392, 10, 10]               0
          Conv2d-375         [32, 1392, 10, 10]          34,800
     BatchNorm2d-376         [32, 1392, 10, 10]           2,784
            SiLU-377         [32, 1392, 10, 10]               0
        CNNBlock-378         [32, 1392, 10, 10]               0
AdaptiveAvgPool2d-379           [32, 1392, 1, 1]               0
          Conv2d-380             [32, 58, 1, 1]          80,794
            SiLU-381             [32, 58, 1, 1]               0
          Conv2d-382           [32, 1392, 1, 1]          82,128
         Sigmoid-383           [32, 1392, 1, 1]               0
SqueezeExcitation-384         [32, 1392, 10, 10]               0
          Conv2d-385          [32, 232, 10, 10]         322,944
     BatchNorm2d-386          [32, 232, 10, 10]             464
InvertedResidualBlock-387          [32, 232, 10, 10]               0
          Conv2d-388         [32, 1392, 10, 10]       2,906,496
     BatchNorm2d-389         [32, 1392, 10, 10]           2,784
            SiLU-390         [32, 1392, 10, 10]               0
        CNNBlock-391         [32, 1392, 10, 10]               0
          Conv2d-392         [32, 1392, 10, 10]          34,800
     BatchNorm2d-393         [32, 1392, 10, 10]           2,784
            SiLU-394         [32, 1392, 10, 10]               0
        CNNBlock-395         [32, 1392, 10, 10]               0
AdaptiveAvgPool2d-396           [32, 1392, 1, 1]               0
          Conv2d-397             [32, 58, 1, 1]          80,794
            SiLU-398             [32, 58, 1, 1]               0
          Conv2d-399           [32, 1392, 1, 1]          82,128
         Sigmoid-400           [32, 1392, 1, 1]               0
SqueezeExcitation-401         [32, 1392, 10, 10]               0
          Conv2d-402          [32, 232, 10, 10]         322,944
     BatchNorm2d-403          [32, 232, 10, 10]             464
InvertedResidualBlock-404          [32, 232, 10, 10]               0
          Conv2d-405         [32, 1392, 10, 10]       2,906,496
     BatchNorm2d-406         [32, 1392, 10, 10]           2,784
            SiLU-407         [32, 1392, 10, 10]               0
        CNNBlock-408         [32, 1392, 10, 10]               0
          Conv2d-409         [32, 1392, 10, 10]          12,528
     BatchNorm2d-410         [32, 1392, 10, 10]           2,784
            SiLU-411         [32, 1392, 10, 10]               0
        CNNBlock-412         [32, 1392, 10, 10]               0
AdaptiveAvgPool2d-413           [32, 1392, 1, 1]               0
          Conv2d-414             [32, 58, 1, 1]          80,794
            SiLU-415             [32, 58, 1, 1]               0
          Conv2d-416           [32, 1392, 1, 1]          82,128
         Sigmoid-417           [32, 1392, 1, 1]               0
SqueezeExcitation-418         [32, 1392, 10, 10]               0
          Conv2d-419          [32, 388, 10, 10]         540,096
     BatchNorm2d-420          [32, 388, 10, 10]             776
InvertedResidualBlock-421          [32, 388, 10, 10]               0
          Conv2d-422         [32, 2328, 10, 10]       8,129,376
     BatchNorm2d-423         [32, 2328, 10, 10]           4,656
            SiLU-424         [32, 2328, 10, 10]               0
        CNNBlock-425         [32, 2328, 10, 10]               0
          Conv2d-426         [32, 2328, 10, 10]          20,952
     BatchNorm2d-427         [32, 2328, 10, 10]           4,656
            SiLU-428         [32, 2328, 10, 10]               0
        CNNBlock-429         [32, 2328, 10, 10]               0
AdaptiveAvgPool2d-430           [32, 2328, 1, 1]               0
          Conv2d-431             [32, 97, 1, 1]         225,913
            SiLU-432             [32, 97, 1, 1]               0
          Conv2d-433           [32, 2328, 1, 1]         228,144
         Sigmoid-434           [32, 2328, 1, 1]               0
SqueezeExcitation-435         [32, 2328, 10, 10]               0
          Conv2d-436          [32, 388, 10, 10]         903,264
     BatchNorm2d-437          [32, 388, 10, 10]             776
InvertedResidualBlock-438          [32, 388, 10, 10]               0
          Conv2d-439         [32, 1549, 10, 10]         601,012
     BatchNorm2d-440         [32, 1549, 10, 10]           3,098
            SiLU-441         [32, 1549, 10, 10]               0
        CNNBlock-442         [32, 1549, 10, 10]               0
AdaptiveAvgPool2d-443           [32, 1549, 1, 1]               0
         Flatten-444                 [32, 1549]               0
         Dropout-445                 [32, 1549]               0
          Linear-446                    [32, 2]           3,100
    EfficientNet-447                    [32, 2]               0
================================================================
Total params: 40,636,106
Trainable params: 40,636,106
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 32.96
Forward/backward pass size (MB): 23835.34
Params size (MB): 155.01
Estimated Total Size (MB): 24023.32
----------------------------------------------------------------

