EfficientNetB2----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [2, 35, 130, 130]             945
       BatchNorm2d-2          [2, 35, 130, 130]              70
              SiLU-3          [2, 35, 130, 130]               0
          CNNBlock-4          [2, 35, 130, 130]               0
            Conv2d-5          [2, 35, 130, 130]             315
       BatchNorm2d-6          [2, 35, 130, 130]              70
              SiLU-7          [2, 35, 130, 130]               0
          CNNBlock-8          [2, 35, 130, 130]               0
 AdaptiveAvgPool2d-9              [2, 35, 1, 1]               0
           Conv2d-10               [2, 8, 1, 1]             288
             SiLU-11               [2, 8, 1, 1]               0
           Conv2d-12              [2, 35, 1, 1]             315
          Sigmoid-13              [2, 35, 1, 1]               0
SqueezeExcitation-14          [2, 35, 130, 130]               0
           Conv2d-15          [2, 20, 130, 130]             700
      BatchNorm2d-16          [2, 20, 130, 130]              40
InvertedResidualBlock-17          [2, 20, 130, 130]               0
           Conv2d-18          [2, 20, 130, 130]             180
      BatchNorm2d-19          [2, 20, 130, 130]              40
             SiLU-20          [2, 20, 130, 130]               0
         CNNBlock-21          [2, 20, 130, 130]               0
AdaptiveAvgPool2d-22              [2, 20, 1, 1]               0
           Conv2d-23               [2, 5, 1, 1]             105
             SiLU-24               [2, 5, 1, 1]               0
           Conv2d-25              [2, 20, 1, 1]             120
          Sigmoid-26              [2, 20, 1, 1]               0
SqueezeExcitation-27          [2, 20, 130, 130]               0
           Conv2d-28          [2, 20, 130, 130]             400
      BatchNorm2d-29          [2, 20, 130, 130]              40
InvertedResidualBlock-30          [2, 20, 130, 130]               0
           Conv2d-31         [2, 120, 130, 130]          21,600
      BatchNorm2d-32         [2, 120, 130, 130]             240
             SiLU-33         [2, 120, 130, 130]               0
         CNNBlock-34         [2, 120, 130, 130]               0
           Conv2d-35           [2, 120, 65, 65]           1,080
      BatchNorm2d-36           [2, 120, 65, 65]             240
             SiLU-37           [2, 120, 65, 65]               0
         CNNBlock-38           [2, 120, 65, 65]               0
AdaptiveAvgPool2d-39             [2, 120, 1, 1]               0
           Conv2d-40               [2, 5, 1, 1]             605
             SiLU-41               [2, 5, 1, 1]               0
           Conv2d-42             [2, 120, 1, 1]             720
          Sigmoid-43             [2, 120, 1, 1]               0
SqueezeExcitation-44           [2, 120, 65, 65]               0
           Conv2d-45            [2, 28, 65, 65]           3,360
      BatchNorm2d-46            [2, 28, 65, 65]              56
InvertedResidualBlock-47            [2, 28, 65, 65]               0
           Conv2d-48           [2, 168, 65, 65]          42,336
      BatchNorm2d-49           [2, 168, 65, 65]             336
             SiLU-50           [2, 168, 65, 65]               0
         CNNBlock-51           [2, 168, 65, 65]               0
           Conv2d-52           [2, 168, 65, 65]           1,512
      BatchNorm2d-53           [2, 168, 65, 65]             336
             SiLU-54           [2, 168, 65, 65]               0
         CNNBlock-55           [2, 168, 65, 65]               0
AdaptiveAvgPool2d-56             [2, 168, 1, 1]               0
           Conv2d-57               [2, 7, 1, 1]           1,183
             SiLU-58               [2, 7, 1, 1]               0
           Conv2d-59             [2, 168, 1, 1]           1,344
          Sigmoid-60             [2, 168, 1, 1]               0
SqueezeExcitation-61           [2, 168, 65, 65]               0
           Conv2d-62            [2, 28, 65, 65]           4,704
      BatchNorm2d-63            [2, 28, 65, 65]              56
InvertedResidualBlock-64            [2, 28, 65, 65]               0
           Conv2d-65           [2, 168, 65, 65]          42,336
      BatchNorm2d-66           [2, 168, 65, 65]             336
             SiLU-67           [2, 168, 65, 65]               0
         CNNBlock-68           [2, 168, 65, 65]               0
           Conv2d-69           [2, 168, 65, 65]           1,512
      BatchNorm2d-70           [2, 168, 65, 65]             336
             SiLU-71           [2, 168, 65, 65]               0
         CNNBlock-72           [2, 168, 65, 65]               0
AdaptiveAvgPool2d-73             [2, 168, 1, 1]               0
           Conv2d-74               [2, 7, 1, 1]           1,183
             SiLU-75               [2, 7, 1, 1]               0
           Conv2d-76             [2, 168, 1, 1]           1,344
          Sigmoid-77             [2, 168, 1, 1]               0
SqueezeExcitation-78           [2, 168, 65, 65]               0
           Conv2d-79            [2, 28, 65, 65]           4,704
      BatchNorm2d-80            [2, 28, 65, 65]              56
InvertedResidualBlock-81            [2, 28, 65, 65]               0
           Conv2d-82           [2, 168, 65, 65]          42,336
      BatchNorm2d-83           [2, 168, 65, 65]             336
             SiLU-84           [2, 168, 65, 65]               0
         CNNBlock-85           [2, 168, 65, 65]               0
           Conv2d-86           [2, 168, 33, 33]           4,200
      BatchNorm2d-87           [2, 168, 33, 33]             336
             SiLU-88           [2, 168, 33, 33]               0
         CNNBlock-89           [2, 168, 33, 33]               0
AdaptiveAvgPool2d-90             [2, 168, 1, 1]               0
           Conv2d-91               [2, 7, 1, 1]           1,183
             SiLU-92               [2, 7, 1, 1]               0
           Conv2d-93             [2, 168, 1, 1]           1,344
          Sigmoid-94             [2, 168, 1, 1]               0
SqueezeExcitation-95           [2, 168, 33, 33]               0
           Conv2d-96            [2, 44, 33, 33]           7,392
      BatchNorm2d-97            [2, 44, 33, 33]              88
InvertedResidualBlock-98            [2, 44, 33, 33]               0
           Conv2d-99           [2, 264, 33, 33]         104,544
     BatchNorm2d-100           [2, 264, 33, 33]             528
            SiLU-101           [2, 264, 33, 33]               0
        CNNBlock-102           [2, 264, 33, 33]               0
          Conv2d-103           [2, 264, 33, 33]           6,600
     BatchNorm2d-104           [2, 264, 33, 33]             528
            SiLU-105           [2, 264, 33, 33]               0
        CNNBlock-106           [2, 264, 33, 33]               0
AdaptiveAvgPool2d-107             [2, 264, 1, 1]               0
          Conv2d-108              [2, 11, 1, 1]           2,915
            SiLU-109              [2, 11, 1, 1]               0
          Conv2d-110             [2, 264, 1, 1]           3,168
         Sigmoid-111             [2, 264, 1, 1]               0
SqueezeExcitation-112           [2, 264, 33, 33]               0
          Conv2d-113            [2, 44, 33, 33]          11,616
     BatchNorm2d-114            [2, 44, 33, 33]              88
InvertedResidualBlock-115            [2, 44, 33, 33]               0
          Conv2d-116           [2, 264, 33, 33]         104,544
     BatchNorm2d-117           [2, 264, 33, 33]             528
            SiLU-118           [2, 264, 33, 33]               0
        CNNBlock-119           [2, 264, 33, 33]               0
          Conv2d-120           [2, 264, 33, 33]           6,600
     BatchNorm2d-121           [2, 264, 33, 33]             528
            SiLU-122           [2, 264, 33, 33]               0
        CNNBlock-123           [2, 264, 33, 33]               0
AdaptiveAvgPool2d-124             [2, 264, 1, 1]               0
          Conv2d-125              [2, 11, 1, 1]           2,915
            SiLU-126              [2, 11, 1, 1]               0
          Conv2d-127             [2, 264, 1, 1]           3,168
         Sigmoid-128             [2, 264, 1, 1]               0
SqueezeExcitation-129           [2, 264, 33, 33]               0
          Conv2d-130            [2, 44, 33, 33]          11,616
     BatchNorm2d-131            [2, 44, 33, 33]              88
InvertedResidualBlock-132            [2, 44, 33, 33]               0
          Conv2d-133           [2, 264, 33, 33]         104,544
     BatchNorm2d-134           [2, 264, 33, 33]             528
            SiLU-135           [2, 264, 33, 33]               0
        CNNBlock-136           [2, 264, 33, 33]               0
          Conv2d-137           [2, 264, 17, 17]           2,376
     BatchNorm2d-138           [2, 264, 17, 17]             528
            SiLU-139           [2, 264, 17, 17]               0
        CNNBlock-140           [2, 264, 17, 17]               0
AdaptiveAvgPool2d-141             [2, 264, 1, 1]               0
          Conv2d-142              [2, 11, 1, 1]           2,915
            SiLU-143              [2, 11, 1, 1]               0
          Conv2d-144             [2, 264, 1, 1]           3,168
         Sigmoid-145             [2, 264, 1, 1]               0
SqueezeExcitation-146           [2, 264, 17, 17]               0
          Conv2d-147            [2, 88, 17, 17]          23,232
     BatchNorm2d-148            [2, 88, 17, 17]             176
InvertedResidualBlock-149            [2, 88, 17, 17]               0
          Conv2d-150           [2, 528, 17, 17]         418,176
     BatchNorm2d-151           [2, 528, 17, 17]           1,056
            SiLU-152           [2, 528, 17, 17]               0
        CNNBlock-153           [2, 528, 17, 17]               0
          Conv2d-154           [2, 528, 17, 17]           4,752
     BatchNorm2d-155           [2, 528, 17, 17]           1,056
            SiLU-156           [2, 528, 17, 17]               0
        CNNBlock-157           [2, 528, 17, 17]               0
AdaptiveAvgPool2d-158             [2, 528, 1, 1]               0
          Conv2d-159              [2, 22, 1, 1]          11,638
            SiLU-160              [2, 22, 1, 1]               0
          Conv2d-161             [2, 528, 1, 1]          12,144
         Sigmoid-162             [2, 528, 1, 1]               0
SqueezeExcitation-163           [2, 528, 17, 17]               0
          Conv2d-164            [2, 88, 17, 17]          46,464
     BatchNorm2d-165            [2, 88, 17, 17]             176
InvertedResidualBlock-166            [2, 88, 17, 17]               0
          Conv2d-167           [2, 528, 17, 17]         418,176
     BatchNorm2d-168           [2, 528, 17, 17]           1,056
            SiLU-169           [2, 528, 17, 17]               0
        CNNBlock-170           [2, 528, 17, 17]               0
          Conv2d-171           [2, 528, 17, 17]           4,752
     BatchNorm2d-172           [2, 528, 17, 17]           1,056
            SiLU-173           [2, 528, 17, 17]               0
        CNNBlock-174           [2, 528, 17, 17]               0
AdaptiveAvgPool2d-175             [2, 528, 1, 1]               0
          Conv2d-176              [2, 22, 1, 1]          11,638
            SiLU-177              [2, 22, 1, 1]               0
          Conv2d-178             [2, 528, 1, 1]          12,144
         Sigmoid-179             [2, 528, 1, 1]               0
SqueezeExcitation-180           [2, 528, 17, 17]               0
          Conv2d-181            [2, 88, 17, 17]          46,464
     BatchNorm2d-182            [2, 88, 17, 17]             176
InvertedResidualBlock-183            [2, 88, 17, 17]               0
          Conv2d-184           [2, 528, 17, 17]         418,176
     BatchNorm2d-185           [2, 528, 17, 17]           1,056
            SiLU-186           [2, 528, 17, 17]               0
        CNNBlock-187           [2, 528, 17, 17]               0
          Conv2d-188           [2, 528, 17, 17]           4,752
     BatchNorm2d-189           [2, 528, 17, 17]           1,056
            SiLU-190           [2, 528, 17, 17]               0
        CNNBlock-191           [2, 528, 17, 17]               0
AdaptiveAvgPool2d-192             [2, 528, 1, 1]               0
          Conv2d-193              [2, 22, 1, 1]          11,638
            SiLU-194              [2, 22, 1, 1]               0
          Conv2d-195             [2, 528, 1, 1]          12,144
         Sigmoid-196             [2, 528, 1, 1]               0
SqueezeExcitation-197           [2, 528, 17, 17]               0
          Conv2d-198            [2, 88, 17, 17]          46,464
     BatchNorm2d-199            [2, 88, 17, 17]             176
InvertedResidualBlock-200            [2, 88, 17, 17]               0
          Conv2d-201           [2, 528, 17, 17]         418,176
     BatchNorm2d-202           [2, 528, 17, 17]           1,056
            SiLU-203           [2, 528, 17, 17]               0
        CNNBlock-204           [2, 528, 17, 17]               0
          Conv2d-205           [2, 528, 17, 17]          13,200
     BatchNorm2d-206           [2, 528, 17, 17]           1,056
            SiLU-207           [2, 528, 17, 17]               0
        CNNBlock-208           [2, 528, 17, 17]               0
AdaptiveAvgPool2d-209             [2, 528, 1, 1]               0
          Conv2d-210              [2, 22, 1, 1]          11,638
            SiLU-211              [2, 22, 1, 1]               0
          Conv2d-212             [2, 528, 1, 1]          12,144
         Sigmoid-213             [2, 528, 1, 1]               0
SqueezeExcitation-214           [2, 528, 17, 17]               0
          Conv2d-215           [2, 124, 17, 17]          65,472
     BatchNorm2d-216           [2, 124, 17, 17]             248
InvertedResidualBlock-217           [2, 124, 17, 17]               0
          Conv2d-218           [2, 744, 17, 17]         830,304
     BatchNorm2d-219           [2, 744, 17, 17]           1,488
            SiLU-220           [2, 744, 17, 17]               0
        CNNBlock-221           [2, 744, 17, 17]               0
          Conv2d-222           [2, 744, 17, 17]          18,600
     BatchNorm2d-223           [2, 744, 17, 17]           1,488
            SiLU-224           [2, 744, 17, 17]               0
        CNNBlock-225           [2, 744, 17, 17]               0
AdaptiveAvgPool2d-226             [2, 744, 1, 1]               0
          Conv2d-227              [2, 31, 1, 1]          23,095
            SiLU-228              [2, 31, 1, 1]               0
          Conv2d-229             [2, 744, 1, 1]          23,808
         Sigmoid-230             [2, 744, 1, 1]               0
SqueezeExcitation-231           [2, 744, 17, 17]               0
          Conv2d-232           [2, 124, 17, 17]          92,256
     BatchNorm2d-233           [2, 124, 17, 17]             248
InvertedResidualBlock-234           [2, 124, 17, 17]               0
          Conv2d-235           [2, 744, 17, 17]         830,304
     BatchNorm2d-236           [2, 744, 17, 17]           1,488
            SiLU-237           [2, 744, 17, 17]               0
        CNNBlock-238           [2, 744, 17, 17]               0
          Conv2d-239           [2, 744, 17, 17]          18,600
     BatchNorm2d-240           [2, 744, 17, 17]           1,488
            SiLU-241           [2, 744, 17, 17]               0
        CNNBlock-242           [2, 744, 17, 17]               0
AdaptiveAvgPool2d-243             [2, 744, 1, 1]               0
          Conv2d-244              [2, 31, 1, 1]          23,095
            SiLU-245              [2, 31, 1, 1]               0
          Conv2d-246             [2, 744, 1, 1]          23,808
         Sigmoid-247             [2, 744, 1, 1]               0
SqueezeExcitation-248           [2, 744, 17, 17]               0
          Conv2d-249           [2, 124, 17, 17]          92,256
     BatchNorm2d-250           [2, 124, 17, 17]             248
InvertedResidualBlock-251           [2, 124, 17, 17]               0
          Conv2d-252           [2, 744, 17, 17]         830,304
     BatchNorm2d-253           [2, 744, 17, 17]           1,488
            SiLU-254           [2, 744, 17, 17]               0
        CNNBlock-255           [2, 744, 17, 17]               0
          Conv2d-256           [2, 744, 17, 17]          18,600
     BatchNorm2d-257           [2, 744, 17, 17]           1,488
            SiLU-258           [2, 744, 17, 17]               0
        CNNBlock-259           [2, 744, 17, 17]               0
AdaptiveAvgPool2d-260             [2, 744, 1, 1]               0
          Conv2d-261              [2, 31, 1, 1]          23,095
            SiLU-262              [2, 31, 1, 1]               0
          Conv2d-263             [2, 744, 1, 1]          23,808
         Sigmoid-264             [2, 744, 1, 1]               0
SqueezeExcitation-265           [2, 744, 17, 17]               0
          Conv2d-266           [2, 124, 17, 17]          92,256
     BatchNorm2d-267           [2, 124, 17, 17]             248
InvertedResidualBlock-268           [2, 124, 17, 17]               0
          Conv2d-269           [2, 744, 17, 17]         830,304
     BatchNorm2d-270           [2, 744, 17, 17]           1,488
            SiLU-271           [2, 744, 17, 17]               0
        CNNBlock-272           [2, 744, 17, 17]               0
          Conv2d-273             [2, 744, 9, 9]          18,600
     BatchNorm2d-274             [2, 744, 9, 9]           1,488
            SiLU-275             [2, 744, 9, 9]               0
        CNNBlock-276             [2, 744, 9, 9]               0
AdaptiveAvgPool2d-277             [2, 744, 1, 1]               0
          Conv2d-278              [2, 31, 1, 1]          23,095
            SiLU-279              [2, 31, 1, 1]               0
          Conv2d-280             [2, 744, 1, 1]          23,808
         Sigmoid-281             [2, 744, 1, 1]               0
SqueezeExcitation-282             [2, 744, 9, 9]               0
          Conv2d-283             [2, 212, 9, 9]         157,728
     BatchNorm2d-284             [2, 212, 9, 9]             424
InvertedResidualBlock-285             [2, 212, 9, 9]               0
          Conv2d-286            [2, 1272, 9, 9]       2,426,976
     BatchNorm2d-287            [2, 1272, 9, 9]           2,544
            SiLU-288            [2, 1272, 9, 9]               0
        CNNBlock-289            [2, 1272, 9, 9]               0
          Conv2d-290            [2, 1272, 9, 9]          31,800
     BatchNorm2d-291            [2, 1272, 9, 9]           2,544
            SiLU-292            [2, 1272, 9, 9]               0
        CNNBlock-293            [2, 1272, 9, 9]               0
AdaptiveAvgPool2d-294            [2, 1272, 1, 1]               0
          Conv2d-295              [2, 53, 1, 1]          67,469
            SiLU-296              [2, 53, 1, 1]               0
          Conv2d-297            [2, 1272, 1, 1]          68,688
         Sigmoid-298            [2, 1272, 1, 1]               0
SqueezeExcitation-299            [2, 1272, 9, 9]               0
          Conv2d-300             [2, 212, 9, 9]         269,664
     BatchNorm2d-301             [2, 212, 9, 9]             424
InvertedResidualBlock-302             [2, 212, 9, 9]               0
          Conv2d-303            [2, 1272, 9, 9]       2,426,976
     BatchNorm2d-304            [2, 1272, 9, 9]           2,544
            SiLU-305            [2, 1272, 9, 9]               0
        CNNBlock-306            [2, 1272, 9, 9]               0
          Conv2d-307            [2, 1272, 9, 9]          31,800
     BatchNorm2d-308            [2, 1272, 9, 9]           2,544
            SiLU-309            [2, 1272, 9, 9]               0
        CNNBlock-310            [2, 1272, 9, 9]               0
AdaptiveAvgPool2d-311            [2, 1272, 1, 1]               0
          Conv2d-312              [2, 53, 1, 1]          67,469
            SiLU-313              [2, 53, 1, 1]               0
          Conv2d-314            [2, 1272, 1, 1]          68,688
         Sigmoid-315            [2, 1272, 1, 1]               0
SqueezeExcitation-316            [2, 1272, 9, 9]               0
          Conv2d-317             [2, 212, 9, 9]         269,664
     BatchNorm2d-318             [2, 212, 9, 9]             424
InvertedResidualBlock-319             [2, 212, 9, 9]               0
          Conv2d-320            [2, 1272, 9, 9]       2,426,976
     BatchNorm2d-321            [2, 1272, 9, 9]           2,544
            SiLU-322            [2, 1272, 9, 9]               0
        CNNBlock-323            [2, 1272, 9, 9]               0
          Conv2d-324            [2, 1272, 9, 9]          31,800
     BatchNorm2d-325            [2, 1272, 9, 9]           2,544
            SiLU-326            [2, 1272, 9, 9]               0
        CNNBlock-327            [2, 1272, 9, 9]               0
AdaptiveAvgPool2d-328            [2, 1272, 1, 1]               0
          Conv2d-329              [2, 53, 1, 1]          67,469
            SiLU-330              [2, 53, 1, 1]               0
          Conv2d-331            [2, 1272, 1, 1]          68,688
         Sigmoid-332            [2, 1272, 1, 1]               0
SqueezeExcitation-333            [2, 1272, 9, 9]               0
          Conv2d-334             [2, 212, 9, 9]         269,664
     BatchNorm2d-335             [2, 212, 9, 9]             424
InvertedResidualBlock-336             [2, 212, 9, 9]               0
          Conv2d-337            [2, 1272, 9, 9]       2,426,976
     BatchNorm2d-338            [2, 1272, 9, 9]           2,544
            SiLU-339            [2, 1272, 9, 9]               0
        CNNBlock-340            [2, 1272, 9, 9]               0
          Conv2d-341            [2, 1272, 9, 9]          31,800
     BatchNorm2d-342            [2, 1272, 9, 9]           2,544
            SiLU-343            [2, 1272, 9, 9]               0
        CNNBlock-344            [2, 1272, 9, 9]               0
AdaptiveAvgPool2d-345            [2, 1272, 1, 1]               0
          Conv2d-346              [2, 53, 1, 1]          67,469
            SiLU-347              [2, 53, 1, 1]               0
          Conv2d-348            [2, 1272, 1, 1]          68,688
         Sigmoid-349            [2, 1272, 1, 1]               0
SqueezeExcitation-350            [2, 1272, 9, 9]               0
          Conv2d-351             [2, 212, 9, 9]         269,664
     BatchNorm2d-352             [2, 212, 9, 9]             424
InvertedResidualBlock-353             [2, 212, 9, 9]               0
          Conv2d-354            [2, 1272, 9, 9]       2,426,976
     BatchNorm2d-355            [2, 1272, 9, 9]           2,544
            SiLU-356            [2, 1272, 9, 9]               0
        CNNBlock-357            [2, 1272, 9, 9]               0
          Conv2d-358            [2, 1272, 9, 9]          11,448
     BatchNorm2d-359            [2, 1272, 9, 9]           2,544
            SiLU-360            [2, 1272, 9, 9]               0
        CNNBlock-361            [2, 1272, 9, 9]               0
AdaptiveAvgPool2d-362            [2, 1272, 1, 1]               0
          Conv2d-363              [2, 53, 1, 1]          67,469
            SiLU-364              [2, 53, 1, 1]               0
          Conv2d-365            [2, 1272, 1, 1]          68,688
         Sigmoid-366            [2, 1272, 1, 1]               0
SqueezeExcitation-367            [2, 1272, 9, 9]               0
          Conv2d-368             [2, 352, 9, 9]         447,744
     BatchNorm2d-369             [2, 352, 9, 9]             704
InvertedResidualBlock-370             [2, 352, 9, 9]               0
          Conv2d-371            [2, 2112, 9, 9]       6,690,816
     BatchNorm2d-372            [2, 2112, 9, 9]           4,224
            SiLU-373            [2, 2112, 9, 9]               0
        CNNBlock-374            [2, 2112, 9, 9]               0
          Conv2d-375            [2, 2112, 9, 9]          19,008
     BatchNorm2d-376            [2, 2112, 9, 9]           4,224
            SiLU-377            [2, 2112, 9, 9]               0
        CNNBlock-378            [2, 2112, 9, 9]               0
AdaptiveAvgPool2d-379            [2, 2112, 1, 1]               0
          Conv2d-380              [2, 88, 1, 1]         185,944
            SiLU-381              [2, 88, 1, 1]               0
          Conv2d-382            [2, 2112, 1, 1]         187,968
         Sigmoid-383            [2, 2112, 1, 1]               0
SqueezeExcitation-384            [2, 2112, 9, 9]               0
          Conv2d-385             [2, 352, 9, 9]         743,424
     BatchNorm2d-386             [2, 352, 9, 9]             704
InvertedResidualBlock-387             [2, 352, 9, 9]               0
          Conv2d-388            [2, 1408, 9, 9]         495,616
     BatchNorm2d-389            [2, 1408, 9, 9]           2,816
            SiLU-390            [2, 1408, 9, 9]               0
        CNNBlock-391            [2, 1408, 9, 9]               0
AdaptiveAvgPool2d-392            [2, 1408, 1, 1]               0
         Flatten-393                  [2, 1408]               0
         Dropout-394                  [2, 1408]               0
          Linear-395                     [2, 2]           2,818
    EfficientNet-396                     [2, 2]               0
================================================================
Total params: 29,476,086
Trainable params: 29,476,086
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.55
Forward/backward pass size (MB): 987.67
Params size (MB): 112.44
Estimated Total Size (MB): 1101.66
----------------------------------------------------------------

