EfficientNetB1----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [32, 33, 120, 120]             891
       BatchNorm2d-2         [32, 33, 120, 120]              66
              SiLU-3         [32, 33, 120, 120]               0
          CNNBlock-4         [32, 33, 120, 120]               0
            Conv2d-5         [32, 33, 120, 120]             297
       BatchNorm2d-6         [32, 33, 120, 120]              66
              SiLU-7         [32, 33, 120, 120]               0
          CNNBlock-8         [32, 33, 120, 120]               0
 AdaptiveAvgPool2d-9             [32, 33, 1, 1]               0
           Conv2d-10              [32, 8, 1, 1]             272
             SiLU-11              [32, 8, 1, 1]               0
           Conv2d-12             [32, 33, 1, 1]             297
          Sigmoid-13             [32, 33, 1, 1]               0
SqueezeExcitation-14         [32, 33, 120, 120]               0
           Conv2d-15         [32, 16, 120, 120]             528
      BatchNorm2d-16         [32, 16, 120, 120]              32
InvertedResidualBlock-17         [32, 16, 120, 120]               0
           Conv2d-18         [32, 16, 120, 120]             144
      BatchNorm2d-19         [32, 16, 120, 120]              32
             SiLU-20         [32, 16, 120, 120]               0
         CNNBlock-21         [32, 16, 120, 120]               0
AdaptiveAvgPool2d-22             [32, 16, 1, 1]               0
           Conv2d-23              [32, 4, 1, 1]              68
             SiLU-24              [32, 4, 1, 1]               0
           Conv2d-25             [32, 16, 1, 1]              80
          Sigmoid-26             [32, 16, 1, 1]               0
SqueezeExcitation-27         [32, 16, 120, 120]               0
           Conv2d-28         [32, 16, 120, 120]             256
      BatchNorm2d-29         [32, 16, 120, 120]              32
InvertedResidualBlock-30         [32, 16, 120, 120]               0
           Conv2d-31         [32, 96, 120, 120]          13,824
      BatchNorm2d-32         [32, 96, 120, 120]             192
             SiLU-33         [32, 96, 120, 120]               0
         CNNBlock-34         [32, 96, 120, 120]               0
           Conv2d-35           [32, 96, 60, 60]             864
      BatchNorm2d-36           [32, 96, 60, 60]             192
             SiLU-37           [32, 96, 60, 60]               0
         CNNBlock-38           [32, 96, 60, 60]               0
AdaptiveAvgPool2d-39             [32, 96, 1, 1]               0
           Conv2d-40              [32, 4, 1, 1]             388
             SiLU-41              [32, 4, 1, 1]               0
           Conv2d-42             [32, 96, 1, 1]             480
          Sigmoid-43             [32, 96, 1, 1]               0
SqueezeExcitation-44           [32, 96, 60, 60]               0
           Conv2d-45           [32, 28, 60, 60]           2,688
      BatchNorm2d-46           [32, 28, 60, 60]              56
InvertedResidualBlock-47           [32, 28, 60, 60]               0
           Conv2d-48          [32, 168, 60, 60]          42,336
      BatchNorm2d-49          [32, 168, 60, 60]             336
             SiLU-50          [32, 168, 60, 60]               0
         CNNBlock-51          [32, 168, 60, 60]               0
           Conv2d-52          [32, 168, 60, 60]           1,512
      BatchNorm2d-53          [32, 168, 60, 60]             336
             SiLU-54          [32, 168, 60, 60]               0
         CNNBlock-55          [32, 168, 60, 60]               0
AdaptiveAvgPool2d-56            [32, 168, 1, 1]               0
           Conv2d-57              [32, 7, 1, 1]           1,183
             SiLU-58              [32, 7, 1, 1]               0
           Conv2d-59            [32, 168, 1, 1]           1,344
          Sigmoid-60            [32, 168, 1, 1]               0
SqueezeExcitation-61          [32, 168, 60, 60]               0
           Conv2d-62           [32, 28, 60, 60]           4,704
      BatchNorm2d-63           [32, 28, 60, 60]              56
InvertedResidualBlock-64           [32, 28, 60, 60]               0
           Conv2d-65          [32, 168, 60, 60]          42,336
      BatchNorm2d-66          [32, 168, 60, 60]             336
             SiLU-67          [32, 168, 60, 60]               0
         CNNBlock-68          [32, 168, 60, 60]               0
           Conv2d-69          [32, 168, 60, 60]           1,512
      BatchNorm2d-70          [32, 168, 60, 60]             336
             SiLU-71          [32, 168, 60, 60]               0
         CNNBlock-72          [32, 168, 60, 60]               0
AdaptiveAvgPool2d-73            [32, 168, 1, 1]               0
           Conv2d-74              [32, 7, 1, 1]           1,183
             SiLU-75              [32, 7, 1, 1]               0
           Conv2d-76            [32, 168, 1, 1]           1,344
          Sigmoid-77            [32, 168, 1, 1]               0
SqueezeExcitation-78          [32, 168, 60, 60]               0
           Conv2d-79           [32, 28, 60, 60]           4,704
      BatchNorm2d-80           [32, 28, 60, 60]              56
InvertedResidualBlock-81           [32, 28, 60, 60]               0
           Conv2d-82          [32, 168, 60, 60]          42,336
      BatchNorm2d-83          [32, 168, 60, 60]             336
             SiLU-84          [32, 168, 60, 60]               0
         CNNBlock-85          [32, 168, 60, 60]               0
           Conv2d-86          [32, 168, 30, 30]           4,200
      BatchNorm2d-87          [32, 168, 30, 30]             336
             SiLU-88          [32, 168, 30, 30]               0
         CNNBlock-89          [32, 168, 30, 30]               0
AdaptiveAvgPool2d-90            [32, 168, 1, 1]               0
           Conv2d-91              [32, 7, 1, 1]           1,183
             SiLU-92              [32, 7, 1, 1]               0
           Conv2d-93            [32, 168, 1, 1]           1,344
          Sigmoid-94            [32, 168, 1, 1]               0
SqueezeExcitation-95          [32, 168, 30, 30]               0
           Conv2d-96           [32, 44, 30, 30]           7,392
      BatchNorm2d-97           [32, 44, 30, 30]              88
InvertedResidualBlock-98           [32, 44, 30, 30]               0
           Conv2d-99          [32, 264, 30, 30]         104,544
     BatchNorm2d-100          [32, 264, 30, 30]             528
            SiLU-101          [32, 264, 30, 30]               0
        CNNBlock-102          [32, 264, 30, 30]               0
          Conv2d-103          [32, 264, 30, 30]           6,600
     BatchNorm2d-104          [32, 264, 30, 30]             528
            SiLU-105          [32, 264, 30, 30]               0
        CNNBlock-106          [32, 264, 30, 30]               0
AdaptiveAvgPool2d-107            [32, 264, 1, 1]               0
          Conv2d-108             [32, 11, 1, 1]           2,915
            SiLU-109             [32, 11, 1, 1]               0
          Conv2d-110            [32, 264, 1, 1]           3,168
         Sigmoid-111            [32, 264, 1, 1]               0
SqueezeExcitation-112          [32, 264, 30, 30]               0
          Conv2d-113           [32, 44, 30, 30]          11,616
     BatchNorm2d-114           [32, 44, 30, 30]              88
InvertedResidualBlock-115           [32, 44, 30, 30]               0
          Conv2d-116          [32, 264, 30, 30]         104,544
     BatchNorm2d-117          [32, 264, 30, 30]             528
            SiLU-118          [32, 264, 30, 30]               0
        CNNBlock-119          [32, 264, 30, 30]               0
          Conv2d-120          [32, 264, 30, 30]           6,600
     BatchNorm2d-121          [32, 264, 30, 30]             528
            SiLU-122          [32, 264, 30, 30]               0
        CNNBlock-123          [32, 264, 30, 30]               0
AdaptiveAvgPool2d-124            [32, 264, 1, 1]               0
          Conv2d-125             [32, 11, 1, 1]           2,915
            SiLU-126             [32, 11, 1, 1]               0
          Conv2d-127            [32, 264, 1, 1]           3,168
         Sigmoid-128            [32, 264, 1, 1]               0
SqueezeExcitation-129          [32, 264, 30, 30]               0
          Conv2d-130           [32, 44, 30, 30]          11,616
     BatchNorm2d-131           [32, 44, 30, 30]              88
InvertedResidualBlock-132           [32, 44, 30, 30]               0
          Conv2d-133          [32, 264, 30, 30]         104,544
     BatchNorm2d-134          [32, 264, 30, 30]             528
            SiLU-135          [32, 264, 30, 30]               0
        CNNBlock-136          [32, 264, 30, 30]               0
          Conv2d-137          [32, 264, 15, 15]           2,376
     BatchNorm2d-138          [32, 264, 15, 15]             528
            SiLU-139          [32, 264, 15, 15]               0
        CNNBlock-140          [32, 264, 15, 15]               0
AdaptiveAvgPool2d-141            [32, 264, 1, 1]               0
          Conv2d-142             [32, 11, 1, 1]           2,915
            SiLU-143             [32, 11, 1, 1]               0
          Conv2d-144            [32, 264, 1, 1]           3,168
         Sigmoid-145            [32, 264, 1, 1]               0
SqueezeExcitation-146          [32, 264, 15, 15]               0
          Conv2d-147           [32, 84, 15, 15]          22,176
     BatchNorm2d-148           [32, 84, 15, 15]             168
InvertedResidualBlock-149           [32, 84, 15, 15]               0
          Conv2d-150          [32, 504, 15, 15]         381,024
     BatchNorm2d-151          [32, 504, 15, 15]           1,008
            SiLU-152          [32, 504, 15, 15]               0
        CNNBlock-153          [32, 504, 15, 15]               0
          Conv2d-154          [32, 504, 15, 15]           4,536
     BatchNorm2d-155          [32, 504, 15, 15]           1,008
            SiLU-156          [32, 504, 15, 15]               0
        CNNBlock-157          [32, 504, 15, 15]               0
AdaptiveAvgPool2d-158            [32, 504, 1, 1]               0
          Conv2d-159             [32, 21, 1, 1]          10,605
            SiLU-160             [32, 21, 1, 1]               0
          Conv2d-161            [32, 504, 1, 1]          11,088
         Sigmoid-162            [32, 504, 1, 1]               0
SqueezeExcitation-163          [32, 504, 15, 15]               0
          Conv2d-164           [32, 84, 15, 15]          42,336
     BatchNorm2d-165           [32, 84, 15, 15]             168
InvertedResidualBlock-166           [32, 84, 15, 15]               0
          Conv2d-167          [32, 504, 15, 15]         381,024
     BatchNorm2d-168          [32, 504, 15, 15]           1,008
            SiLU-169          [32, 504, 15, 15]               0
        CNNBlock-170          [32, 504, 15, 15]               0
          Conv2d-171          [32, 504, 15, 15]           4,536
     BatchNorm2d-172          [32, 504, 15, 15]           1,008
            SiLU-173          [32, 504, 15, 15]               0
        CNNBlock-174          [32, 504, 15, 15]               0
AdaptiveAvgPool2d-175            [32, 504, 1, 1]               0
          Conv2d-176             [32, 21, 1, 1]          10,605
            SiLU-177             [32, 21, 1, 1]               0
          Conv2d-178            [32, 504, 1, 1]          11,088
         Sigmoid-179            [32, 504, 1, 1]               0
SqueezeExcitation-180          [32, 504, 15, 15]               0
          Conv2d-181           [32, 84, 15, 15]          42,336
     BatchNorm2d-182           [32, 84, 15, 15]             168
InvertedResidualBlock-183           [32, 84, 15, 15]               0
          Conv2d-184          [32, 504, 15, 15]         381,024
     BatchNorm2d-185          [32, 504, 15, 15]           1,008
            SiLU-186          [32, 504, 15, 15]               0
        CNNBlock-187          [32, 504, 15, 15]               0
          Conv2d-188          [32, 504, 15, 15]           4,536
     BatchNorm2d-189          [32, 504, 15, 15]           1,008
            SiLU-190          [32, 504, 15, 15]               0
        CNNBlock-191          [32, 504, 15, 15]               0
AdaptiveAvgPool2d-192            [32, 504, 1, 1]               0
          Conv2d-193             [32, 21, 1, 1]          10,605
            SiLU-194             [32, 21, 1, 1]               0
          Conv2d-195            [32, 504, 1, 1]          11,088
         Sigmoid-196            [32, 504, 1, 1]               0
SqueezeExcitation-197          [32, 504, 15, 15]               0
          Conv2d-198           [32, 84, 15, 15]          42,336
     BatchNorm2d-199           [32, 84, 15, 15]             168
InvertedResidualBlock-200           [32, 84, 15, 15]               0
          Conv2d-201          [32, 504, 15, 15]         381,024
     BatchNorm2d-202          [32, 504, 15, 15]           1,008
            SiLU-203          [32, 504, 15, 15]               0
        CNNBlock-204          [32, 504, 15, 15]               0
          Conv2d-205          [32, 504, 15, 15]          12,600
     BatchNorm2d-206          [32, 504, 15, 15]           1,008
            SiLU-207          [32, 504, 15, 15]               0
        CNNBlock-208          [32, 504, 15, 15]               0
AdaptiveAvgPool2d-209            [32, 504, 1, 1]               0
          Conv2d-210             [32, 21, 1, 1]          10,605
            SiLU-211             [32, 21, 1, 1]               0
          Conv2d-212            [32, 504, 1, 1]          11,088
         Sigmoid-213            [32, 504, 1, 1]               0
SqueezeExcitation-214          [32, 504, 15, 15]               0
          Conv2d-215          [32, 120, 15, 15]          60,480
     BatchNorm2d-216          [32, 120, 15, 15]             240
InvertedResidualBlock-217          [32, 120, 15, 15]               0
          Conv2d-218          [32, 720, 15, 15]         777,600
     BatchNorm2d-219          [32, 720, 15, 15]           1,440
            SiLU-220          [32, 720, 15, 15]               0
        CNNBlock-221          [32, 720, 15, 15]               0
          Conv2d-222          [32, 720, 15, 15]          18,000
     BatchNorm2d-223          [32, 720, 15, 15]           1,440
            SiLU-224          [32, 720, 15, 15]               0
        CNNBlock-225          [32, 720, 15, 15]               0
AdaptiveAvgPool2d-226            [32, 720, 1, 1]               0
          Conv2d-227             [32, 30, 1, 1]          21,630
            SiLU-228             [32, 30, 1, 1]               0
          Conv2d-229            [32, 720, 1, 1]          22,320
         Sigmoid-230            [32, 720, 1, 1]               0
SqueezeExcitation-231          [32, 720, 15, 15]               0
          Conv2d-232          [32, 120, 15, 15]          86,400
     BatchNorm2d-233          [32, 120, 15, 15]             240
InvertedResidualBlock-234          [32, 120, 15, 15]               0
          Conv2d-235          [32, 720, 15, 15]         777,600
     BatchNorm2d-236          [32, 720, 15, 15]           1,440
            SiLU-237          [32, 720, 15, 15]               0
        CNNBlock-238          [32, 720, 15, 15]               0
          Conv2d-239          [32, 720, 15, 15]          18,000
     BatchNorm2d-240          [32, 720, 15, 15]           1,440
            SiLU-241          [32, 720, 15, 15]               0
        CNNBlock-242          [32, 720, 15, 15]               0
AdaptiveAvgPool2d-243            [32, 720, 1, 1]               0
          Conv2d-244             [32, 30, 1, 1]          21,630
            SiLU-245             [32, 30, 1, 1]               0
          Conv2d-246            [32, 720, 1, 1]          22,320
         Sigmoid-247            [32, 720, 1, 1]               0
SqueezeExcitation-248          [32, 720, 15, 15]               0
          Conv2d-249          [32, 120, 15, 15]          86,400
     BatchNorm2d-250          [32, 120, 15, 15]             240
InvertedResidualBlock-251          [32, 120, 15, 15]               0
          Conv2d-252          [32, 720, 15, 15]         777,600
     BatchNorm2d-253          [32, 720, 15, 15]           1,440
            SiLU-254          [32, 720, 15, 15]               0
        CNNBlock-255          [32, 720, 15, 15]               0
          Conv2d-256          [32, 720, 15, 15]          18,000
     BatchNorm2d-257          [32, 720, 15, 15]           1,440
            SiLU-258          [32, 720, 15, 15]               0
        CNNBlock-259          [32, 720, 15, 15]               0
AdaptiveAvgPool2d-260            [32, 720, 1, 1]               0
          Conv2d-261             [32, 30, 1, 1]          21,630
            SiLU-262             [32, 30, 1, 1]               0
          Conv2d-263            [32, 720, 1, 1]          22,320
         Sigmoid-264            [32, 720, 1, 1]               0
SqueezeExcitation-265          [32, 720, 15, 15]               0
          Conv2d-266          [32, 120, 15, 15]          86,400
     BatchNorm2d-267          [32, 120, 15, 15]             240
InvertedResidualBlock-268          [32, 120, 15, 15]               0
          Conv2d-269          [32, 720, 15, 15]         777,600
     BatchNorm2d-270          [32, 720, 15, 15]           1,440
            SiLU-271          [32, 720, 15, 15]               0
        CNNBlock-272          [32, 720, 15, 15]               0
          Conv2d-273            [32, 720, 8, 8]          18,000
     BatchNorm2d-274            [32, 720, 8, 8]           1,440
            SiLU-275            [32, 720, 8, 8]               0
        CNNBlock-276            [32, 720, 8, 8]               0
AdaptiveAvgPool2d-277            [32, 720, 1, 1]               0
          Conv2d-278             [32, 30, 1, 1]          21,630
            SiLU-279             [32, 30, 1, 1]               0
          Conv2d-280            [32, 720, 1, 1]          22,320
         Sigmoid-281            [32, 720, 1, 1]               0
SqueezeExcitation-282            [32, 720, 8, 8]               0
          Conv2d-283            [32, 204, 8, 8]         146,880
     BatchNorm2d-284            [32, 204, 8, 8]             408
InvertedResidualBlock-285            [32, 204, 8, 8]               0
          Conv2d-286           [32, 1224, 8, 8]       2,247,264
     BatchNorm2d-287           [32, 1224, 8, 8]           2,448
            SiLU-288           [32, 1224, 8, 8]               0
        CNNBlock-289           [32, 1224, 8, 8]               0
          Conv2d-290           [32, 1224, 8, 8]          30,600
     BatchNorm2d-291           [32, 1224, 8, 8]           2,448
            SiLU-292           [32, 1224, 8, 8]               0
        CNNBlock-293           [32, 1224, 8, 8]               0
AdaptiveAvgPool2d-294           [32, 1224, 1, 1]               0
          Conv2d-295             [32, 51, 1, 1]          62,475
            SiLU-296             [32, 51, 1, 1]               0
          Conv2d-297           [32, 1224, 1, 1]          63,648
         Sigmoid-298           [32, 1224, 1, 1]               0
SqueezeExcitation-299           [32, 1224, 8, 8]               0
          Conv2d-300            [32, 204, 8, 8]         249,696
     BatchNorm2d-301            [32, 204, 8, 8]             408
InvertedResidualBlock-302            [32, 204, 8, 8]               0
          Conv2d-303           [32, 1224, 8, 8]       2,247,264
     BatchNorm2d-304           [32, 1224, 8, 8]           2,448
            SiLU-305           [32, 1224, 8, 8]               0
        CNNBlock-306           [32, 1224, 8, 8]               0
          Conv2d-307           [32, 1224, 8, 8]          30,600
     BatchNorm2d-308           [32, 1224, 8, 8]           2,448
            SiLU-309           [32, 1224, 8, 8]               0
        CNNBlock-310           [32, 1224, 8, 8]               0
AdaptiveAvgPool2d-311           [32, 1224, 1, 1]               0
          Conv2d-312             [32, 51, 1, 1]          62,475
            SiLU-313             [32, 51, 1, 1]               0
          Conv2d-314           [32, 1224, 1, 1]          63,648
         Sigmoid-315           [32, 1224, 1, 1]               0
SqueezeExcitation-316           [32, 1224, 8, 8]               0
          Conv2d-317            [32, 204, 8, 8]         249,696
     BatchNorm2d-318            [32, 204, 8, 8]             408
InvertedResidualBlock-319            [32, 204, 8, 8]               0
          Conv2d-320           [32, 1224, 8, 8]       2,247,264
     BatchNorm2d-321           [32, 1224, 8, 8]           2,448
            SiLU-322           [32, 1224, 8, 8]               0
        CNNBlock-323           [32, 1224, 8, 8]               0
          Conv2d-324           [32, 1224, 8, 8]          30,600
     BatchNorm2d-325           [32, 1224, 8, 8]           2,448
            SiLU-326           [32, 1224, 8, 8]               0
        CNNBlock-327           [32, 1224, 8, 8]               0
AdaptiveAvgPool2d-328           [32, 1224, 1, 1]               0
          Conv2d-329             [32, 51, 1, 1]          62,475
            SiLU-330             [32, 51, 1, 1]               0
          Conv2d-331           [32, 1224, 1, 1]          63,648
         Sigmoid-332           [32, 1224, 1, 1]               0
SqueezeExcitation-333           [32, 1224, 8, 8]               0
          Conv2d-334            [32, 204, 8, 8]         249,696
     BatchNorm2d-335            [32, 204, 8, 8]             408
InvertedResidualBlock-336            [32, 204, 8, 8]               0
          Conv2d-337           [32, 1224, 8, 8]       2,247,264
     BatchNorm2d-338           [32, 1224, 8, 8]           2,448
            SiLU-339           [32, 1224, 8, 8]               0
        CNNBlock-340           [32, 1224, 8, 8]               0
          Conv2d-341           [32, 1224, 8, 8]          30,600
     BatchNorm2d-342           [32, 1224, 8, 8]           2,448
            SiLU-343           [32, 1224, 8, 8]               0
        CNNBlock-344           [32, 1224, 8, 8]               0
AdaptiveAvgPool2d-345           [32, 1224, 1, 1]               0
          Conv2d-346             [32, 51, 1, 1]          62,475
            SiLU-347             [32, 51, 1, 1]               0
          Conv2d-348           [32, 1224, 1, 1]          63,648
         Sigmoid-349           [32, 1224, 1, 1]               0
SqueezeExcitation-350           [32, 1224, 8, 8]               0
          Conv2d-351            [32, 204, 8, 8]         249,696
     BatchNorm2d-352            [32, 204, 8, 8]             408
InvertedResidualBlock-353            [32, 204, 8, 8]               0
          Conv2d-354           [32, 1224, 8, 8]       2,247,264
     BatchNorm2d-355           [32, 1224, 8, 8]           2,448
            SiLU-356           [32, 1224, 8, 8]               0
        CNNBlock-357           [32, 1224, 8, 8]               0
          Conv2d-358           [32, 1224, 8, 8]          11,016
     BatchNorm2d-359           [32, 1224, 8, 8]           2,448
            SiLU-360           [32, 1224, 8, 8]               0
        CNNBlock-361           [32, 1224, 8, 8]               0
AdaptiveAvgPool2d-362           [32, 1224, 1, 1]               0
          Conv2d-363             [32, 51, 1, 1]          62,475
            SiLU-364             [32, 51, 1, 1]               0
          Conv2d-365           [32, 1224, 1, 1]          63,648
         Sigmoid-366           [32, 1224, 1, 1]               0
SqueezeExcitation-367           [32, 1224, 8, 8]               0
          Conv2d-368            [32, 336, 8, 8]         411,264
     BatchNorm2d-369            [32, 336, 8, 8]             672
InvertedResidualBlock-370            [32, 336, 8, 8]               0
          Conv2d-371           [32, 2016, 8, 8]       6,096,384
     BatchNorm2d-372           [32, 2016, 8, 8]           4,032
            SiLU-373           [32, 2016, 8, 8]               0
        CNNBlock-374           [32, 2016, 8, 8]               0
          Conv2d-375           [32, 2016, 8, 8]          18,144
     BatchNorm2d-376           [32, 2016, 8, 8]           4,032
            SiLU-377           [32, 2016, 8, 8]               0
        CNNBlock-378           [32, 2016, 8, 8]               0
AdaptiveAvgPool2d-379           [32, 2016, 1, 1]               0
          Conv2d-380             [32, 84, 1, 1]         169,428
            SiLU-381             [32, 84, 1, 1]               0
          Conv2d-382           [32, 2016, 1, 1]         171,360
         Sigmoid-383           [32, 2016, 1, 1]               0
SqueezeExcitation-384           [32, 2016, 8, 8]               0
          Conv2d-385            [32, 336, 8, 8]         677,376
     BatchNorm2d-386            [32, 336, 8, 8]             672
InvertedResidualBlock-387            [32, 336, 8, 8]               0
          Conv2d-388           [32, 1343, 8, 8]         451,248
     BatchNorm2d-389           [32, 1343, 8, 8]           2,686
            SiLU-390           [32, 1343, 8, 8]               0
        CNNBlock-391           [32, 1343, 8, 8]               0
AdaptiveAvgPool2d-392           [32, 1343, 1, 1]               0
         Flatten-393                 [32, 1343]               0
         Dropout-394                 [32, 1343]               0
          Linear-395                    [32, 2]           2,688
    EfficientNet-396                    [32, 2]               0
================================================================
Total params: 27,224,484
Trainable params: 27,224,484
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 21.09
Forward/backward pass size (MB): 12257.69
Params size (MB): 103.85
Estimated Total Size (MB): 12382.63
----------------------------------------------------------------

