EfficientNetB2----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [32, 35, 130, 130]             945
       BatchNorm2d-2         [32, 35, 130, 130]              70
              SiLU-3         [32, 35, 130, 130]               0
          CNNBlock-4         [32, 35, 130, 130]               0
            Conv2d-5         [32, 35, 130, 130]             315
       BatchNorm2d-6         [32, 35, 130, 130]              70
              SiLU-7         [32, 35, 130, 130]               0
          CNNBlock-8         [32, 35, 130, 130]               0
 AdaptiveAvgPool2d-9             [32, 35, 1, 1]               0
           Conv2d-10              [32, 8, 1, 1]             288
             SiLU-11              [32, 8, 1, 1]               0
           Conv2d-12             [32, 35, 1, 1]             315
          Sigmoid-13             [32, 35, 1, 1]               0
SqueezeExcitation-14         [32, 35, 130, 130]               0
           Conv2d-15         [32, 20, 130, 130]             700
      BatchNorm2d-16         [32, 20, 130, 130]              40
InvertedResidualBlock-17         [32, 20, 130, 130]               0
           Conv2d-18         [32, 20, 130, 130]             180
      BatchNorm2d-19         [32, 20, 130, 130]              40
             SiLU-20         [32, 20, 130, 130]               0
         CNNBlock-21         [32, 20, 130, 130]               0
AdaptiveAvgPool2d-22             [32, 20, 1, 1]               0
           Conv2d-23              [32, 5, 1, 1]             105
             SiLU-24              [32, 5, 1, 1]               0
           Conv2d-25             [32, 20, 1, 1]             120
          Sigmoid-26             [32, 20, 1, 1]               0
SqueezeExcitation-27         [32, 20, 130, 130]               0
           Conv2d-28         [32, 20, 130, 130]             400
      BatchNorm2d-29         [32, 20, 130, 130]              40
InvertedResidualBlock-30         [32, 20, 130, 130]               0
           Conv2d-31        [32, 120, 130, 130]          21,600
      BatchNorm2d-32        [32, 120, 130, 130]             240
             SiLU-33        [32, 120, 130, 130]               0
         CNNBlock-34        [32, 120, 130, 130]               0
           Conv2d-35          [32, 120, 65, 65]           1,080
      BatchNorm2d-36          [32, 120, 65, 65]             240
             SiLU-37          [32, 120, 65, 65]               0
         CNNBlock-38          [32, 120, 65, 65]               0
AdaptiveAvgPool2d-39            [32, 120, 1, 1]               0
           Conv2d-40              [32, 5, 1, 1]             605
             SiLU-41              [32, 5, 1, 1]               0
           Conv2d-42            [32, 120, 1, 1]             720
          Sigmoid-43            [32, 120, 1, 1]               0
SqueezeExcitation-44          [32, 120, 65, 65]               0
           Conv2d-45           [32, 28, 65, 65]           3,360
      BatchNorm2d-46           [32, 28, 65, 65]              56
InvertedResidualBlock-47           [32, 28, 65, 65]               0
           Conv2d-48          [32, 168, 65, 65]          42,336
      BatchNorm2d-49          [32, 168, 65, 65]             336
             SiLU-50          [32, 168, 65, 65]               0
         CNNBlock-51          [32, 168, 65, 65]               0
           Conv2d-52          [32, 168, 65, 65]           1,512
      BatchNorm2d-53          [32, 168, 65, 65]             336
             SiLU-54          [32, 168, 65, 65]               0
         CNNBlock-55          [32, 168, 65, 65]               0
AdaptiveAvgPool2d-56            [32, 168, 1, 1]               0
           Conv2d-57              [32, 7, 1, 1]           1,183
             SiLU-58              [32, 7, 1, 1]               0
           Conv2d-59            [32, 168, 1, 1]           1,344
          Sigmoid-60            [32, 168, 1, 1]               0
SqueezeExcitation-61          [32, 168, 65, 65]               0
           Conv2d-62           [32, 28, 65, 65]           4,704
      BatchNorm2d-63           [32, 28, 65, 65]              56
InvertedResidualBlock-64           [32, 28, 65, 65]               0
           Conv2d-65          [32, 168, 65, 65]          42,336
      BatchNorm2d-66          [32, 168, 65, 65]             336
             SiLU-67          [32, 168, 65, 65]               0
         CNNBlock-68          [32, 168, 65, 65]               0
           Conv2d-69          [32, 168, 65, 65]           1,512
      BatchNorm2d-70          [32, 168, 65, 65]             336
             SiLU-71          [32, 168, 65, 65]               0
         CNNBlock-72          [32, 168, 65, 65]               0
AdaptiveAvgPool2d-73            [32, 168, 1, 1]               0
           Conv2d-74              [32, 7, 1, 1]           1,183
             SiLU-75              [32, 7, 1, 1]               0
           Conv2d-76            [32, 168, 1, 1]           1,344
          Sigmoid-77            [32, 168, 1, 1]               0
SqueezeExcitation-78          [32, 168, 65, 65]               0
           Conv2d-79           [32, 28, 65, 65]           4,704
      BatchNorm2d-80           [32, 28, 65, 65]              56
InvertedResidualBlock-81           [32, 28, 65, 65]               0
           Conv2d-82          [32, 168, 65, 65]          42,336
      BatchNorm2d-83          [32, 168, 65, 65]             336
             SiLU-84          [32, 168, 65, 65]               0
         CNNBlock-85          [32, 168, 65, 65]               0
           Conv2d-86          [32, 168, 33, 33]           4,200
      BatchNorm2d-87          [32, 168, 33, 33]             336
             SiLU-88          [32, 168, 33, 33]               0
         CNNBlock-89          [32, 168, 33, 33]               0
AdaptiveAvgPool2d-90            [32, 168, 1, 1]               0
           Conv2d-91              [32, 7, 1, 1]           1,183
             SiLU-92              [32, 7, 1, 1]               0
           Conv2d-93            [32, 168, 1, 1]           1,344
          Sigmoid-94            [32, 168, 1, 1]               0
SqueezeExcitation-95          [32, 168, 33, 33]               0
           Conv2d-96           [32, 44, 33, 33]           7,392
      BatchNorm2d-97           [32, 44, 33, 33]              88
InvertedResidualBlock-98           [32, 44, 33, 33]               0
           Conv2d-99          [32, 264, 33, 33]         104,544
     BatchNorm2d-100          [32, 264, 33, 33]             528
            SiLU-101          [32, 264, 33, 33]               0
        CNNBlock-102          [32, 264, 33, 33]               0
          Conv2d-103          [32, 264, 33, 33]           6,600
     BatchNorm2d-104          [32, 264, 33, 33]             528
            SiLU-105          [32, 264, 33, 33]               0
        CNNBlock-106          [32, 264, 33, 33]               0
AdaptiveAvgPool2d-107            [32, 264, 1, 1]               0
          Conv2d-108             [32, 11, 1, 1]           2,915
            SiLU-109             [32, 11, 1, 1]               0
          Conv2d-110            [32, 264, 1, 1]           3,168
         Sigmoid-111            [32, 264, 1, 1]               0
SqueezeExcitation-112          [32, 264, 33, 33]               0
          Conv2d-113           [32, 44, 33, 33]          11,616
     BatchNorm2d-114           [32, 44, 33, 33]              88
InvertedResidualBlock-115           [32, 44, 33, 33]               0
          Conv2d-116          [32, 264, 33, 33]         104,544
     BatchNorm2d-117          [32, 264, 33, 33]             528
            SiLU-118          [32, 264, 33, 33]               0
        CNNBlock-119          [32, 264, 33, 33]               0
          Conv2d-120          [32, 264, 33, 33]           6,600
     BatchNorm2d-121          [32, 264, 33, 33]             528
            SiLU-122          [32, 264, 33, 33]               0
        CNNBlock-123          [32, 264, 33, 33]               0
AdaptiveAvgPool2d-124            [32, 264, 1, 1]               0
          Conv2d-125             [32, 11, 1, 1]           2,915
            SiLU-126             [32, 11, 1, 1]               0
          Conv2d-127            [32, 264, 1, 1]           3,168
         Sigmoid-128            [32, 264, 1, 1]               0
SqueezeExcitation-129          [32, 264, 33, 33]               0
          Conv2d-130           [32, 44, 33, 33]          11,616
     BatchNorm2d-131           [32, 44, 33, 33]              88
InvertedResidualBlock-132           [32, 44, 33, 33]               0
          Conv2d-133          [32, 264, 33, 33]         104,544
     BatchNorm2d-134          [32, 264, 33, 33]             528
            SiLU-135          [32, 264, 33, 33]               0
        CNNBlock-136          [32, 264, 33, 33]               0
          Conv2d-137          [32, 264, 17, 17]           2,376
     BatchNorm2d-138          [32, 264, 17, 17]             528
            SiLU-139          [32, 264, 17, 17]               0
        CNNBlock-140          [32, 264, 17, 17]               0
AdaptiveAvgPool2d-141            [32, 264, 1, 1]               0
          Conv2d-142             [32, 11, 1, 1]           2,915
            SiLU-143             [32, 11, 1, 1]               0
          Conv2d-144            [32, 264, 1, 1]           3,168
         Sigmoid-145            [32, 264, 1, 1]               0
SqueezeExcitation-146          [32, 264, 17, 17]               0
          Conv2d-147           [32, 88, 17, 17]          23,232
     BatchNorm2d-148           [32, 88, 17, 17]             176
InvertedResidualBlock-149           [32, 88, 17, 17]               0
          Conv2d-150          [32, 528, 17, 17]         418,176
     BatchNorm2d-151          [32, 528, 17, 17]           1,056
            SiLU-152          [32, 528, 17, 17]               0
        CNNBlock-153          [32, 528, 17, 17]               0
          Conv2d-154          [32, 528, 17, 17]           4,752
     BatchNorm2d-155          [32, 528, 17, 17]           1,056
            SiLU-156          [32, 528, 17, 17]               0
        CNNBlock-157          [32, 528, 17, 17]               0
AdaptiveAvgPool2d-158            [32, 528, 1, 1]               0
          Conv2d-159             [32, 22, 1, 1]          11,638
            SiLU-160             [32, 22, 1, 1]               0
          Conv2d-161            [32, 528, 1, 1]          12,144
         Sigmoid-162            [32, 528, 1, 1]               0
SqueezeExcitation-163          [32, 528, 17, 17]               0
          Conv2d-164           [32, 88, 17, 17]          46,464
     BatchNorm2d-165           [32, 88, 17, 17]             176
InvertedResidualBlock-166           [32, 88, 17, 17]               0
          Conv2d-167          [32, 528, 17, 17]         418,176
     BatchNorm2d-168          [32, 528, 17, 17]           1,056
            SiLU-169          [32, 528, 17, 17]               0
        CNNBlock-170          [32, 528, 17, 17]               0
          Conv2d-171          [32, 528, 17, 17]           4,752
     BatchNorm2d-172          [32, 528, 17, 17]           1,056
            SiLU-173          [32, 528, 17, 17]               0
        CNNBlock-174          [32, 528, 17, 17]               0
AdaptiveAvgPool2d-175            [32, 528, 1, 1]               0
          Conv2d-176             [32, 22, 1, 1]          11,638
            SiLU-177             [32, 22, 1, 1]               0
          Conv2d-178            [32, 528, 1, 1]          12,144
         Sigmoid-179            [32, 528, 1, 1]               0
SqueezeExcitation-180          [32, 528, 17, 17]               0
          Conv2d-181           [32, 88, 17, 17]          46,464
     BatchNorm2d-182           [32, 88, 17, 17]             176
InvertedResidualBlock-183           [32, 88, 17, 17]               0
          Conv2d-184          [32, 528, 17, 17]         418,176
     BatchNorm2d-185          [32, 528, 17, 17]           1,056
            SiLU-186          [32, 528, 17, 17]               0
        CNNBlock-187          [32, 528, 17, 17]               0
          Conv2d-188          [32, 528, 17, 17]           4,752
     BatchNorm2d-189          [32, 528, 17, 17]           1,056
            SiLU-190          [32, 528, 17, 17]               0
        CNNBlock-191          [32, 528, 17, 17]               0
AdaptiveAvgPool2d-192            [32, 528, 1, 1]               0
          Conv2d-193             [32, 22, 1, 1]          11,638
            SiLU-194             [32, 22, 1, 1]               0
          Conv2d-195            [32, 528, 1, 1]          12,144
         Sigmoid-196            [32, 528, 1, 1]               0
SqueezeExcitation-197          [32, 528, 17, 17]               0
          Conv2d-198           [32, 88, 17, 17]          46,464
     BatchNorm2d-199           [32, 88, 17, 17]             176
InvertedResidualBlock-200           [32, 88, 17, 17]               0
          Conv2d-201          [32, 528, 17, 17]         418,176
     BatchNorm2d-202          [32, 528, 17, 17]           1,056
            SiLU-203          [32, 528, 17, 17]               0
        CNNBlock-204          [32, 528, 17, 17]               0
          Conv2d-205          [32, 528, 17, 17]          13,200
     BatchNorm2d-206          [32, 528, 17, 17]           1,056
            SiLU-207          [32, 528, 17, 17]               0
        CNNBlock-208          [32, 528, 17, 17]               0
AdaptiveAvgPool2d-209            [32, 528, 1, 1]               0
          Conv2d-210             [32, 22, 1, 1]          11,638
            SiLU-211             [32, 22, 1, 1]               0
          Conv2d-212            [32, 528, 1, 1]          12,144
         Sigmoid-213            [32, 528, 1, 1]               0
SqueezeExcitation-214          [32, 528, 17, 17]               0
          Conv2d-215          [32, 124, 17, 17]          65,472
     BatchNorm2d-216          [32, 124, 17, 17]             248
InvertedResidualBlock-217          [32, 124, 17, 17]               0
          Conv2d-218          [32, 744, 17, 17]         830,304
     BatchNorm2d-219          [32, 744, 17, 17]           1,488
            SiLU-220          [32, 744, 17, 17]               0
        CNNBlock-221          [32, 744, 17, 17]               0
          Conv2d-222          [32, 744, 17, 17]          18,600
     BatchNorm2d-223          [32, 744, 17, 17]           1,488
            SiLU-224          [32, 744, 17, 17]               0
        CNNBlock-225          [32, 744, 17, 17]               0
AdaptiveAvgPool2d-226            [32, 744, 1, 1]               0
          Conv2d-227             [32, 31, 1, 1]          23,095
            SiLU-228             [32, 31, 1, 1]               0
          Conv2d-229            [32, 744, 1, 1]          23,808
         Sigmoid-230            [32, 744, 1, 1]               0
SqueezeExcitation-231          [32, 744, 17, 17]               0
          Conv2d-232          [32, 124, 17, 17]          92,256
     BatchNorm2d-233          [32, 124, 17, 17]             248
InvertedResidualBlock-234          [32, 124, 17, 17]               0
          Conv2d-235          [32, 744, 17, 17]         830,304
     BatchNorm2d-236          [32, 744, 17, 17]           1,488
            SiLU-237          [32, 744, 17, 17]               0
        CNNBlock-238          [32, 744, 17, 17]               0
          Conv2d-239          [32, 744, 17, 17]          18,600
     BatchNorm2d-240          [32, 744, 17, 17]           1,488
            SiLU-241          [32, 744, 17, 17]               0
        CNNBlock-242          [32, 744, 17, 17]               0
AdaptiveAvgPool2d-243            [32, 744, 1, 1]               0
          Conv2d-244             [32, 31, 1, 1]          23,095
            SiLU-245             [32, 31, 1, 1]               0
          Conv2d-246            [32, 744, 1, 1]          23,808
         Sigmoid-247            [32, 744, 1, 1]               0
SqueezeExcitation-248          [32, 744, 17, 17]               0
          Conv2d-249          [32, 124, 17, 17]          92,256
     BatchNorm2d-250          [32, 124, 17, 17]             248
InvertedResidualBlock-251          [32, 124, 17, 17]               0
          Conv2d-252          [32, 744, 17, 17]         830,304
     BatchNorm2d-253          [32, 744, 17, 17]           1,488
            SiLU-254          [32, 744, 17, 17]               0
        CNNBlock-255          [32, 744, 17, 17]               0
          Conv2d-256          [32, 744, 17, 17]          18,600
     BatchNorm2d-257          [32, 744, 17, 17]           1,488
            SiLU-258          [32, 744, 17, 17]               0
        CNNBlock-259          [32, 744, 17, 17]               0
AdaptiveAvgPool2d-260            [32, 744, 1, 1]               0
          Conv2d-261             [32, 31, 1, 1]          23,095
            SiLU-262             [32, 31, 1, 1]               0
          Conv2d-263            [32, 744, 1, 1]          23,808
         Sigmoid-264            [32, 744, 1, 1]               0
SqueezeExcitation-265          [32, 744, 17, 17]               0
          Conv2d-266          [32, 124, 17, 17]          92,256
     BatchNorm2d-267          [32, 124, 17, 17]             248
InvertedResidualBlock-268          [32, 124, 17, 17]               0
          Conv2d-269          [32, 744, 17, 17]         830,304
     BatchNorm2d-270          [32, 744, 17, 17]           1,488
            SiLU-271          [32, 744, 17, 17]               0
        CNNBlock-272          [32, 744, 17, 17]               0
          Conv2d-273            [32, 744, 9, 9]          18,600
     BatchNorm2d-274            [32, 744, 9, 9]           1,488
            SiLU-275            [32, 744, 9, 9]               0
        CNNBlock-276            [32, 744, 9, 9]               0
AdaptiveAvgPool2d-277            [32, 744, 1, 1]               0
          Conv2d-278             [32, 31, 1, 1]          23,095
            SiLU-279             [32, 31, 1, 1]               0
          Conv2d-280            [32, 744, 1, 1]          23,808
         Sigmoid-281            [32, 744, 1, 1]               0
SqueezeExcitation-282            [32, 744, 9, 9]               0
          Conv2d-283            [32, 212, 9, 9]         157,728
     BatchNorm2d-284            [32, 212, 9, 9]             424
InvertedResidualBlock-285            [32, 212, 9, 9]               0
          Conv2d-286           [32, 1272, 9, 9]       2,426,976
     BatchNorm2d-287           [32, 1272, 9, 9]           2,544
            SiLU-288           [32, 1272, 9, 9]               0
        CNNBlock-289           [32, 1272, 9, 9]               0
          Conv2d-290           [32, 1272, 9, 9]          31,800
     BatchNorm2d-291           [32, 1272, 9, 9]           2,544
            SiLU-292           [32, 1272, 9, 9]               0
        CNNBlock-293           [32, 1272, 9, 9]               0
AdaptiveAvgPool2d-294           [32, 1272, 1, 1]               0
          Conv2d-295             [32, 53, 1, 1]          67,469
            SiLU-296             [32, 53, 1, 1]               0
          Conv2d-297           [32, 1272, 1, 1]          68,688
         Sigmoid-298           [32, 1272, 1, 1]               0
SqueezeExcitation-299           [32, 1272, 9, 9]               0
          Conv2d-300            [32, 212, 9, 9]         269,664
     BatchNorm2d-301            [32, 212, 9, 9]             424
InvertedResidualBlock-302            [32, 212, 9, 9]               0
          Conv2d-303           [32, 1272, 9, 9]       2,426,976
     BatchNorm2d-304           [32, 1272, 9, 9]           2,544
            SiLU-305           [32, 1272, 9, 9]               0
        CNNBlock-306           [32, 1272, 9, 9]               0
          Conv2d-307           [32, 1272, 9, 9]          31,800
     BatchNorm2d-308           [32, 1272, 9, 9]           2,544
            SiLU-309           [32, 1272, 9, 9]               0
        CNNBlock-310           [32, 1272, 9, 9]               0
AdaptiveAvgPool2d-311           [32, 1272, 1, 1]               0
          Conv2d-312             [32, 53, 1, 1]          67,469
            SiLU-313             [32, 53, 1, 1]               0
          Conv2d-314           [32, 1272, 1, 1]          68,688
         Sigmoid-315           [32, 1272, 1, 1]               0
SqueezeExcitation-316           [32, 1272, 9, 9]               0
          Conv2d-317            [32, 212, 9, 9]         269,664
     BatchNorm2d-318            [32, 212, 9, 9]             424
InvertedResidualBlock-319            [32, 212, 9, 9]               0
          Conv2d-320           [32, 1272, 9, 9]       2,426,976
     BatchNorm2d-321           [32, 1272, 9, 9]           2,544
            SiLU-322           [32, 1272, 9, 9]               0
        CNNBlock-323           [32, 1272, 9, 9]               0
          Conv2d-324           [32, 1272, 9, 9]          31,800
     BatchNorm2d-325           [32, 1272, 9, 9]           2,544
            SiLU-326           [32, 1272, 9, 9]               0
        CNNBlock-327           [32, 1272, 9, 9]               0
AdaptiveAvgPool2d-328           [32, 1272, 1, 1]               0
          Conv2d-329             [32, 53, 1, 1]          67,469
            SiLU-330             [32, 53, 1, 1]               0
          Conv2d-331           [32, 1272, 1, 1]          68,688
         Sigmoid-332           [32, 1272, 1, 1]               0
SqueezeExcitation-333           [32, 1272, 9, 9]               0
          Conv2d-334            [32, 212, 9, 9]         269,664
     BatchNorm2d-335            [32, 212, 9, 9]             424
InvertedResidualBlock-336            [32, 212, 9, 9]               0
          Conv2d-337           [32, 1272, 9, 9]       2,426,976
     BatchNorm2d-338           [32, 1272, 9, 9]           2,544
            SiLU-339           [32, 1272, 9, 9]               0
        CNNBlock-340           [32, 1272, 9, 9]               0
          Conv2d-341           [32, 1272, 9, 9]          31,800
     BatchNorm2d-342           [32, 1272, 9, 9]           2,544
            SiLU-343           [32, 1272, 9, 9]               0
        CNNBlock-344           [32, 1272, 9, 9]               0
AdaptiveAvgPool2d-345           [32, 1272, 1, 1]               0
          Conv2d-346             [32, 53, 1, 1]          67,469
            SiLU-347             [32, 53, 1, 1]               0
          Conv2d-348           [32, 1272, 1, 1]          68,688
         Sigmoid-349           [32, 1272, 1, 1]               0
SqueezeExcitation-350           [32, 1272, 9, 9]               0
          Conv2d-351            [32, 212, 9, 9]         269,664
     BatchNorm2d-352            [32, 212, 9, 9]             424
InvertedResidualBlock-353            [32, 212, 9, 9]               0
          Conv2d-354           [32, 1272, 9, 9]       2,426,976
     BatchNorm2d-355           [32, 1272, 9, 9]           2,544
            SiLU-356           [32, 1272, 9, 9]               0
        CNNBlock-357           [32, 1272, 9, 9]               0
          Conv2d-358           [32, 1272, 9, 9]          11,448
     BatchNorm2d-359           [32, 1272, 9, 9]           2,544
            SiLU-360           [32, 1272, 9, 9]               0
        CNNBlock-361           [32, 1272, 9, 9]               0
AdaptiveAvgPool2d-362           [32, 1272, 1, 1]               0
          Conv2d-363             [32, 53, 1, 1]          67,469
            SiLU-364             [32, 53, 1, 1]               0
          Conv2d-365           [32, 1272, 1, 1]          68,688
         Sigmoid-366           [32, 1272, 1, 1]               0
SqueezeExcitation-367           [32, 1272, 9, 9]               0
          Conv2d-368            [32, 352, 9, 9]         447,744
     BatchNorm2d-369            [32, 352, 9, 9]             704
InvertedResidualBlock-370            [32, 352, 9, 9]               0
          Conv2d-371           [32, 2112, 9, 9]       6,690,816
     BatchNorm2d-372           [32, 2112, 9, 9]           4,224
            SiLU-373           [32, 2112, 9, 9]               0
        CNNBlock-374           [32, 2112, 9, 9]               0
          Conv2d-375           [32, 2112, 9, 9]          19,008
     BatchNorm2d-376           [32, 2112, 9, 9]           4,224
            SiLU-377           [32, 2112, 9, 9]               0
        CNNBlock-378           [32, 2112, 9, 9]               0
AdaptiveAvgPool2d-379           [32, 2112, 1, 1]               0
          Conv2d-380             [32, 88, 1, 1]         185,944
            SiLU-381             [32, 88, 1, 1]               0
          Conv2d-382           [32, 2112, 1, 1]         187,968
         Sigmoid-383           [32, 2112, 1, 1]               0
SqueezeExcitation-384           [32, 2112, 9, 9]               0
          Conv2d-385            [32, 352, 9, 9]         743,424
     BatchNorm2d-386            [32, 352, 9, 9]             704
InvertedResidualBlock-387            [32, 352, 9, 9]               0
          Conv2d-388           [32, 1408, 9, 9]         495,616
     BatchNorm2d-389           [32, 1408, 9, 9]           2,816
            SiLU-390           [32, 1408, 9, 9]               0
        CNNBlock-391           [32, 1408, 9, 9]               0
AdaptiveAvgPool2d-392           [32, 1408, 1, 1]               0
         Flatten-393                 [32, 1408]               0
         Dropout-394                 [32, 1408]               0
          Linear-395                    [32, 2]           2,818
    EfficientNet-396                    [32, 2]               0
================================================================
Total params: 29,476,086
Trainable params: 29,476,086
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 24.76
Forward/backward pass size (MB): 15802.75
Params size (MB): 112.44
Estimated Total Size (MB): 15939.95
----------------------------------------------------------------

