ResNet50----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [2, 64, 122, 122]           9,472
       BatchNorm2d-2          [2, 64, 122, 122]             128
              ReLU-3          [2, 64, 122, 122]               0
         MaxPool2d-4            [2, 64, 61, 61]               0
            Conv2d-5            [2, 64, 61, 61]           4,160
       BatchNorm2d-6            [2, 64, 61, 61]             128
              ReLU-7            [2, 64, 61, 61]               0
            Conv2d-8            [2, 64, 61, 61]          36,928
       BatchNorm2d-9            [2, 64, 61, 61]             128
             ReLU-10            [2, 64, 61, 61]               0
           Conv2d-11           [2, 256, 61, 61]          16,640
      BatchNorm2d-12           [2, 256, 61, 61]             512
           Conv2d-13           [2, 256, 61, 61]          16,640
      BatchNorm2d-14           [2, 256, 61, 61]             512
             ReLU-15           [2, 256, 61, 61]               0
            Block-16           [2, 256, 61, 61]               0
           Conv2d-17            [2, 64, 61, 61]          16,448
      BatchNorm2d-18            [2, 64, 61, 61]             128
             ReLU-19            [2, 64, 61, 61]               0
           Conv2d-20            [2, 64, 61, 61]          36,928
      BatchNorm2d-21            [2, 64, 61, 61]             128
             ReLU-22            [2, 64, 61, 61]               0
           Conv2d-23           [2, 256, 61, 61]          16,640
      BatchNorm2d-24           [2, 256, 61, 61]             512
             ReLU-25           [2, 256, 61, 61]               0
            Block-26           [2, 256, 61, 61]               0
           Conv2d-27            [2, 64, 61, 61]          16,448
      BatchNorm2d-28            [2, 64, 61, 61]             128
             ReLU-29            [2, 64, 61, 61]               0
           Conv2d-30            [2, 64, 61, 61]          36,928
      BatchNorm2d-31            [2, 64, 61, 61]             128
             ReLU-32            [2, 64, 61, 61]               0
           Conv2d-33           [2, 256, 61, 61]          16,640
      BatchNorm2d-34           [2, 256, 61, 61]             512
             ReLU-35           [2, 256, 61, 61]               0
            Block-36           [2, 256, 61, 61]               0
           Conv2d-37           [2, 128, 61, 61]          32,896
      BatchNorm2d-38           [2, 128, 61, 61]             256
             ReLU-39           [2, 128, 61, 61]               0
           Conv2d-40           [2, 128, 31, 31]         147,584
      BatchNorm2d-41           [2, 128, 31, 31]             256
             ReLU-42           [2, 128, 31, 31]               0
           Conv2d-43           [2, 512, 31, 31]          66,048
      BatchNorm2d-44           [2, 512, 31, 31]           1,024
           Conv2d-45           [2, 512, 31, 31]         131,584
      BatchNorm2d-46           [2, 512, 31, 31]           1,024
             ReLU-47           [2, 512, 31, 31]               0
            Block-48           [2, 512, 31, 31]               0
           Conv2d-49           [2, 128, 31, 31]          65,664
      BatchNorm2d-50           [2, 128, 31, 31]             256
             ReLU-51           [2, 128, 31, 31]               0
           Conv2d-52           [2, 128, 31, 31]         147,584
      BatchNorm2d-53           [2, 128, 31, 31]             256
             ReLU-54           [2, 128, 31, 31]               0
           Conv2d-55           [2, 512, 31, 31]          66,048
      BatchNorm2d-56           [2, 512, 31, 31]           1,024
             ReLU-57           [2, 512, 31, 31]               0
            Block-58           [2, 512, 31, 31]               0
           Conv2d-59           [2, 128, 31, 31]          65,664
      BatchNorm2d-60           [2, 128, 31, 31]             256
             ReLU-61           [2, 128, 31, 31]               0
           Conv2d-62           [2, 128, 31, 31]         147,584
      BatchNorm2d-63           [2, 128, 31, 31]             256
             ReLU-64           [2, 128, 31, 31]               0
           Conv2d-65           [2, 512, 31, 31]          66,048
      BatchNorm2d-66           [2, 512, 31, 31]           1,024
             ReLU-67           [2, 512, 31, 31]               0
            Block-68           [2, 512, 31, 31]               0
           Conv2d-69           [2, 128, 31, 31]          65,664
      BatchNorm2d-70           [2, 128, 31, 31]             256
             ReLU-71           [2, 128, 31, 31]               0
           Conv2d-72           [2, 128, 31, 31]         147,584
      BatchNorm2d-73           [2, 128, 31, 31]             256
             ReLU-74           [2, 128, 31, 31]               0
           Conv2d-75           [2, 512, 31, 31]          66,048
      BatchNorm2d-76           [2, 512, 31, 31]           1,024
             ReLU-77           [2, 512, 31, 31]               0
            Block-78           [2, 512, 31, 31]               0
           Conv2d-79           [2, 256, 31, 31]         131,328
      BatchNorm2d-80           [2, 256, 31, 31]             512
             ReLU-81           [2, 256, 31, 31]               0
           Conv2d-82           [2, 256, 16, 16]         590,080
      BatchNorm2d-83           [2, 256, 16, 16]             512
             ReLU-84           [2, 256, 16, 16]               0
           Conv2d-85          [2, 1024, 16, 16]         263,168
      BatchNorm2d-86          [2, 1024, 16, 16]           2,048
           Conv2d-87          [2, 1024, 16, 16]         525,312
      BatchNorm2d-88          [2, 1024, 16, 16]           2,048
             ReLU-89          [2, 1024, 16, 16]               0
            Block-90          [2, 1024, 16, 16]               0
           Conv2d-91           [2, 256, 16, 16]         262,400
      BatchNorm2d-92           [2, 256, 16, 16]             512
             ReLU-93           [2, 256, 16, 16]               0
           Conv2d-94           [2, 256, 16, 16]         590,080
      BatchNorm2d-95           [2, 256, 16, 16]             512
             ReLU-96           [2, 256, 16, 16]               0
           Conv2d-97          [2, 1024, 16, 16]         263,168
      BatchNorm2d-98          [2, 1024, 16, 16]           2,048
             ReLU-99          [2, 1024, 16, 16]               0
           Block-100          [2, 1024, 16, 16]               0
          Conv2d-101           [2, 256, 16, 16]         262,400
     BatchNorm2d-102           [2, 256, 16, 16]             512
            ReLU-103           [2, 256, 16, 16]               0
          Conv2d-104           [2, 256, 16, 16]         590,080
     BatchNorm2d-105           [2, 256, 16, 16]             512
            ReLU-106           [2, 256, 16, 16]               0
          Conv2d-107          [2, 1024, 16, 16]         263,168
     BatchNorm2d-108          [2, 1024, 16, 16]           2,048
            ReLU-109          [2, 1024, 16, 16]               0
           Block-110          [2, 1024, 16, 16]               0
          Conv2d-111           [2, 256, 16, 16]         262,400
     BatchNorm2d-112           [2, 256, 16, 16]             512
            ReLU-113           [2, 256, 16, 16]               0
          Conv2d-114           [2, 256, 16, 16]         590,080
     BatchNorm2d-115           [2, 256, 16, 16]             512
            ReLU-116           [2, 256, 16, 16]               0
          Conv2d-117          [2, 1024, 16, 16]         263,168
     BatchNorm2d-118          [2, 1024, 16, 16]           2,048
            ReLU-119          [2, 1024, 16, 16]               0
           Block-120          [2, 1024, 16, 16]               0
          Conv2d-121           [2, 256, 16, 16]         262,400
     BatchNorm2d-122           [2, 256, 16, 16]             512
            ReLU-123           [2, 256, 16, 16]               0
          Conv2d-124           [2, 256, 16, 16]         590,080
     BatchNorm2d-125           [2, 256, 16, 16]             512
            ReLU-126           [2, 256, 16, 16]               0
          Conv2d-127          [2, 1024, 16, 16]         263,168
     BatchNorm2d-128          [2, 1024, 16, 16]           2,048
            ReLU-129          [2, 1024, 16, 16]               0
           Block-130          [2, 1024, 16, 16]               0
          Conv2d-131           [2, 256, 16, 16]         262,400
     BatchNorm2d-132           [2, 256, 16, 16]             512
            ReLU-133           [2, 256, 16, 16]               0
          Conv2d-134           [2, 256, 16, 16]         590,080
     BatchNorm2d-135           [2, 256, 16, 16]             512
            ReLU-136           [2, 256, 16, 16]               0
          Conv2d-137          [2, 1024, 16, 16]         263,168
     BatchNorm2d-138          [2, 1024, 16, 16]           2,048
            ReLU-139          [2, 1024, 16, 16]               0
           Block-140          [2, 1024, 16, 16]               0
          Conv2d-141           [2, 512, 16, 16]         524,800
     BatchNorm2d-142           [2, 512, 16, 16]           1,024
            ReLU-143           [2, 512, 16, 16]               0
          Conv2d-144             [2, 512, 8, 8]       2,359,808
     BatchNorm2d-145             [2, 512, 8, 8]           1,024
            ReLU-146             [2, 512, 8, 8]               0
          Conv2d-147            [2, 2048, 8, 8]       1,050,624
     BatchNorm2d-148            [2, 2048, 8, 8]           4,096
          Conv2d-149            [2, 2048, 8, 8]       2,099,200
     BatchNorm2d-150            [2, 2048, 8, 8]           4,096
            ReLU-151            [2, 2048, 8, 8]               0
           Block-152            [2, 2048, 8, 8]               0
          Conv2d-153             [2, 512, 8, 8]       1,049,088
     BatchNorm2d-154             [2, 512, 8, 8]           1,024
            ReLU-155             [2, 512, 8, 8]               0
          Conv2d-156             [2, 512, 8, 8]       2,359,808
     BatchNorm2d-157             [2, 512, 8, 8]           1,024
            ReLU-158             [2, 512, 8, 8]               0
          Conv2d-159            [2, 2048, 8, 8]       1,050,624
     BatchNorm2d-160            [2, 2048, 8, 8]           4,096
            ReLU-161            [2, 2048, 8, 8]               0
           Block-162            [2, 2048, 8, 8]               0
          Conv2d-163             [2, 512, 8, 8]       1,049,088
     BatchNorm2d-164             [2, 512, 8, 8]           1,024
            ReLU-165             [2, 512, 8, 8]               0
          Conv2d-166             [2, 512, 8, 8]       2,359,808
     BatchNorm2d-167             [2, 512, 8, 8]           1,024
            ReLU-168             [2, 512, 8, 8]               0
          Conv2d-169            [2, 2048, 8, 8]       1,050,624
     BatchNorm2d-170            [2, 2048, 8, 8]           4,096
            ReLU-171            [2, 2048, 8, 8]               0
           Block-172            [2, 2048, 8, 8]               0
AdaptiveAvgPool2d-173            [2, 2048, 1, 1]               0
         Flatten-174                  [2, 2048]               0
          Linear-175                     [2, 2]           4,098
          ResNet-176                     [2, 2]               0
================================================================
Total params: 23,538,690
Trainable params: 23,538,690
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.36
Forward/backward pass size (MB): 702.32
Params size (MB): 89.79
Estimated Total Size (MB): 793.48
----------------------------------------------------------------

