ResNet101----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [32, 64, 128, 128]           9,472
       BatchNorm2d-2         [32, 64, 128, 128]             128
              ReLU-3         [32, 64, 128, 128]               0
         MaxPool2d-4           [32, 64, 64, 64]               0
            Conv2d-5           [32, 64, 64, 64]           4,160
       BatchNorm2d-6           [32, 64, 64, 64]             128
              ReLU-7           [32, 64, 64, 64]               0
            Conv2d-8           [32, 64, 64, 64]          36,928
       BatchNorm2d-9           [32, 64, 64, 64]             128
             ReLU-10           [32, 64, 64, 64]               0
           Conv2d-11          [32, 256, 64, 64]          16,640
      BatchNorm2d-12          [32, 256, 64, 64]             512
           Conv2d-13          [32, 256, 64, 64]          16,640
      BatchNorm2d-14          [32, 256, 64, 64]             512
             ReLU-15          [32, 256, 64, 64]               0
            Block-16          [32, 256, 64, 64]               0
           Conv2d-17           [32, 64, 64, 64]          16,448
      BatchNorm2d-18           [32, 64, 64, 64]             128
             ReLU-19           [32, 64, 64, 64]               0
           Conv2d-20           [32, 64, 64, 64]          36,928
      BatchNorm2d-21           [32, 64, 64, 64]             128
             ReLU-22           [32, 64, 64, 64]               0
           Conv2d-23          [32, 256, 64, 64]          16,640
      BatchNorm2d-24          [32, 256, 64, 64]             512
             ReLU-25          [32, 256, 64, 64]               0
            Block-26          [32, 256, 64, 64]               0
           Conv2d-27           [32, 64, 64, 64]          16,448
      BatchNorm2d-28           [32, 64, 64, 64]             128
             ReLU-29           [32, 64, 64, 64]               0
           Conv2d-30           [32, 64, 64, 64]          36,928
      BatchNorm2d-31           [32, 64, 64, 64]             128
             ReLU-32           [32, 64, 64, 64]               0
           Conv2d-33          [32, 256, 64, 64]          16,640
      BatchNorm2d-34          [32, 256, 64, 64]             512
             ReLU-35          [32, 256, 64, 64]               0
            Block-36          [32, 256, 64, 64]               0
           Conv2d-37          [32, 128, 64, 64]          32,896
      BatchNorm2d-38          [32, 128, 64, 64]             256
             ReLU-39          [32, 128, 64, 64]               0
           Conv2d-40          [32, 128, 32, 32]         147,584
      BatchNorm2d-41          [32, 128, 32, 32]             256
             ReLU-42          [32, 128, 32, 32]               0
           Conv2d-43          [32, 512, 32, 32]          66,048
      BatchNorm2d-44          [32, 512, 32, 32]           1,024
           Conv2d-45          [32, 512, 32, 32]         131,584
      BatchNorm2d-46          [32, 512, 32, 32]           1,024
             ReLU-47          [32, 512, 32, 32]               0
            Block-48          [32, 512, 32, 32]               0
           Conv2d-49          [32, 128, 32, 32]          65,664
      BatchNorm2d-50          [32, 128, 32, 32]             256
             ReLU-51          [32, 128, 32, 32]               0
           Conv2d-52          [32, 128, 32, 32]         147,584
      BatchNorm2d-53          [32, 128, 32, 32]             256
             ReLU-54          [32, 128, 32, 32]               0
           Conv2d-55          [32, 512, 32, 32]          66,048
      BatchNorm2d-56          [32, 512, 32, 32]           1,024
             ReLU-57          [32, 512, 32, 32]               0
            Block-58          [32, 512, 32, 32]               0
           Conv2d-59          [32, 128, 32, 32]          65,664
      BatchNorm2d-60          [32, 128, 32, 32]             256
             ReLU-61          [32, 128, 32, 32]               0
           Conv2d-62          [32, 128, 32, 32]         147,584
      BatchNorm2d-63          [32, 128, 32, 32]             256
             ReLU-64          [32, 128, 32, 32]               0
           Conv2d-65          [32, 512, 32, 32]          66,048
      BatchNorm2d-66          [32, 512, 32, 32]           1,024
             ReLU-67          [32, 512, 32, 32]               0
            Block-68          [32, 512, 32, 32]               0
           Conv2d-69          [32, 128, 32, 32]          65,664
      BatchNorm2d-70          [32, 128, 32, 32]             256
             ReLU-71          [32, 128, 32, 32]               0
           Conv2d-72          [32, 128, 32, 32]         147,584
      BatchNorm2d-73          [32, 128, 32, 32]             256
             ReLU-74          [32, 128, 32, 32]               0
           Conv2d-75          [32, 512, 32, 32]          66,048
      BatchNorm2d-76          [32, 512, 32, 32]           1,024
             ReLU-77          [32, 512, 32, 32]               0
            Block-78          [32, 512, 32, 32]               0
           Conv2d-79          [32, 256, 32, 32]         131,328
      BatchNorm2d-80          [32, 256, 32, 32]             512
             ReLU-81          [32, 256, 32, 32]               0
           Conv2d-82          [32, 256, 16, 16]         590,080
      BatchNorm2d-83          [32, 256, 16, 16]             512
             ReLU-84          [32, 256, 16, 16]               0
           Conv2d-85         [32, 1024, 16, 16]         263,168
      BatchNorm2d-86         [32, 1024, 16, 16]           2,048
           Conv2d-87         [32, 1024, 16, 16]         525,312
      BatchNorm2d-88         [32, 1024, 16, 16]           2,048
             ReLU-89         [32, 1024, 16, 16]               0
            Block-90         [32, 1024, 16, 16]               0
           Conv2d-91          [32, 256, 16, 16]         262,400
      BatchNorm2d-92          [32, 256, 16, 16]             512
             ReLU-93          [32, 256, 16, 16]               0
           Conv2d-94          [32, 256, 16, 16]         590,080
      BatchNorm2d-95          [32, 256, 16, 16]             512
             ReLU-96          [32, 256, 16, 16]               0
           Conv2d-97         [32, 1024, 16, 16]         263,168
      BatchNorm2d-98         [32, 1024, 16, 16]           2,048
             ReLU-99         [32, 1024, 16, 16]               0
           Block-100         [32, 1024, 16, 16]               0
          Conv2d-101          [32, 256, 16, 16]         262,400
     BatchNorm2d-102          [32, 256, 16, 16]             512
            ReLU-103          [32, 256, 16, 16]               0
          Conv2d-104          [32, 256, 16, 16]         590,080
     BatchNorm2d-105          [32, 256, 16, 16]             512
            ReLU-106          [32, 256, 16, 16]               0
          Conv2d-107         [32, 1024, 16, 16]         263,168
     BatchNorm2d-108         [32, 1024, 16, 16]           2,048
            ReLU-109         [32, 1024, 16, 16]               0
           Block-110         [32, 1024, 16, 16]               0
          Conv2d-111          [32, 256, 16, 16]         262,400
     BatchNorm2d-112          [32, 256, 16, 16]             512
            ReLU-113          [32, 256, 16, 16]               0
          Conv2d-114          [32, 256, 16, 16]         590,080
     BatchNorm2d-115          [32, 256, 16, 16]             512
            ReLU-116          [32, 256, 16, 16]               0
          Conv2d-117         [32, 1024, 16, 16]         263,168
     BatchNorm2d-118         [32, 1024, 16, 16]           2,048
            ReLU-119         [32, 1024, 16, 16]               0
           Block-120         [32, 1024, 16, 16]               0
          Conv2d-121          [32, 256, 16, 16]         262,400
     BatchNorm2d-122          [32, 256, 16, 16]             512
            ReLU-123          [32, 256, 16, 16]               0
          Conv2d-124          [32, 256, 16, 16]         590,080
     BatchNorm2d-125          [32, 256, 16, 16]             512
            ReLU-126          [32, 256, 16, 16]               0
          Conv2d-127         [32, 1024, 16, 16]         263,168
     BatchNorm2d-128         [32, 1024, 16, 16]           2,048
            ReLU-129         [32, 1024, 16, 16]               0
           Block-130         [32, 1024, 16, 16]               0
          Conv2d-131          [32, 256, 16, 16]         262,400
     BatchNorm2d-132          [32, 256, 16, 16]             512
            ReLU-133          [32, 256, 16, 16]               0
          Conv2d-134          [32, 256, 16, 16]         590,080
     BatchNorm2d-135          [32, 256, 16, 16]             512
            ReLU-136          [32, 256, 16, 16]               0
          Conv2d-137         [32, 1024, 16, 16]         263,168
     BatchNorm2d-138         [32, 1024, 16, 16]           2,048
            ReLU-139         [32, 1024, 16, 16]               0
           Block-140         [32, 1024, 16, 16]               0
          Conv2d-141          [32, 256, 16, 16]         262,400
     BatchNorm2d-142          [32, 256, 16, 16]             512
            ReLU-143          [32, 256, 16, 16]               0
          Conv2d-144          [32, 256, 16, 16]         590,080
     BatchNorm2d-145          [32, 256, 16, 16]             512
            ReLU-146          [32, 256, 16, 16]               0
          Conv2d-147         [32, 1024, 16, 16]         263,168
     BatchNorm2d-148         [32, 1024, 16, 16]           2,048
            ReLU-149         [32, 1024, 16, 16]               0
           Block-150         [32, 1024, 16, 16]               0
          Conv2d-151          [32, 256, 16, 16]         262,400
     BatchNorm2d-152          [32, 256, 16, 16]             512
            ReLU-153          [32, 256, 16, 16]               0
          Conv2d-154          [32, 256, 16, 16]         590,080
     BatchNorm2d-155          [32, 256, 16, 16]             512
            ReLU-156          [32, 256, 16, 16]               0
          Conv2d-157         [32, 1024, 16, 16]         263,168
     BatchNorm2d-158         [32, 1024, 16, 16]           2,048
            ReLU-159         [32, 1024, 16, 16]               0
           Block-160         [32, 1024, 16, 16]               0
          Conv2d-161          [32, 256, 16, 16]         262,400
     BatchNorm2d-162          [32, 256, 16, 16]             512
            ReLU-163          [32, 256, 16, 16]               0
          Conv2d-164          [32, 256, 16, 16]         590,080
     BatchNorm2d-165          [32, 256, 16, 16]             512
            ReLU-166          [32, 256, 16, 16]               0
          Conv2d-167         [32, 1024, 16, 16]         263,168
     BatchNorm2d-168         [32, 1024, 16, 16]           2,048
            ReLU-169         [32, 1024, 16, 16]               0
           Block-170         [32, 1024, 16, 16]               0
          Conv2d-171          [32, 256, 16, 16]         262,400
     BatchNorm2d-172          [32, 256, 16, 16]             512
            ReLU-173          [32, 256, 16, 16]               0
          Conv2d-174          [32, 256, 16, 16]         590,080
     BatchNorm2d-175          [32, 256, 16, 16]             512
            ReLU-176          [32, 256, 16, 16]               0
          Conv2d-177         [32, 1024, 16, 16]         263,168
     BatchNorm2d-178         [32, 1024, 16, 16]           2,048
            ReLU-179         [32, 1024, 16, 16]               0
           Block-180         [32, 1024, 16, 16]               0
          Conv2d-181          [32, 256, 16, 16]         262,400
     BatchNorm2d-182          [32, 256, 16, 16]             512
            ReLU-183          [32, 256, 16, 16]               0
          Conv2d-184          [32, 256, 16, 16]         590,080
     BatchNorm2d-185          [32, 256, 16, 16]             512
            ReLU-186          [32, 256, 16, 16]               0
          Conv2d-187         [32, 1024, 16, 16]         263,168
     BatchNorm2d-188         [32, 1024, 16, 16]           2,048
            ReLU-189         [32, 1024, 16, 16]               0
           Block-190         [32, 1024, 16, 16]               0
          Conv2d-191          [32, 256, 16, 16]         262,400
     BatchNorm2d-192          [32, 256, 16, 16]             512
            ReLU-193          [32, 256, 16, 16]               0
          Conv2d-194          [32, 256, 16, 16]         590,080
     BatchNorm2d-195          [32, 256, 16, 16]             512
            ReLU-196          [32, 256, 16, 16]               0
          Conv2d-197         [32, 1024, 16, 16]         263,168
     BatchNorm2d-198         [32, 1024, 16, 16]           2,048
            ReLU-199         [32, 1024, 16, 16]               0
           Block-200         [32, 1024, 16, 16]               0
          Conv2d-201          [32, 256, 16, 16]         262,400
     BatchNorm2d-202          [32, 256, 16, 16]             512
            ReLU-203          [32, 256, 16, 16]               0
          Conv2d-204          [32, 256, 16, 16]         590,080
     BatchNorm2d-205          [32, 256, 16, 16]             512
            ReLU-206          [32, 256, 16, 16]               0
          Conv2d-207         [32, 1024, 16, 16]         263,168
     BatchNorm2d-208         [32, 1024, 16, 16]           2,048
            ReLU-209         [32, 1024, 16, 16]               0
           Block-210         [32, 1024, 16, 16]               0
          Conv2d-211          [32, 256, 16, 16]         262,400
     BatchNorm2d-212          [32, 256, 16, 16]             512
            ReLU-213          [32, 256, 16, 16]               0
          Conv2d-214          [32, 256, 16, 16]         590,080
     BatchNorm2d-215          [32, 256, 16, 16]             512
            ReLU-216          [32, 256, 16, 16]               0
          Conv2d-217         [32, 1024, 16, 16]         263,168
     BatchNorm2d-218         [32, 1024, 16, 16]           2,048
            ReLU-219         [32, 1024, 16, 16]               0
           Block-220         [32, 1024, 16, 16]               0
          Conv2d-221          [32, 256, 16, 16]         262,400
     BatchNorm2d-222          [32, 256, 16, 16]             512
            ReLU-223          [32, 256, 16, 16]               0
          Conv2d-224          [32, 256, 16, 16]         590,080
     BatchNorm2d-225          [32, 256, 16, 16]             512
            ReLU-226          [32, 256, 16, 16]               0
          Conv2d-227         [32, 1024, 16, 16]         263,168
     BatchNorm2d-228         [32, 1024, 16, 16]           2,048
            ReLU-229         [32, 1024, 16, 16]               0
           Block-230         [32, 1024, 16, 16]               0
          Conv2d-231          [32, 256, 16, 16]         262,400
     BatchNorm2d-232          [32, 256, 16, 16]             512
            ReLU-233          [32, 256, 16, 16]               0
          Conv2d-234          [32, 256, 16, 16]         590,080
     BatchNorm2d-235          [32, 256, 16, 16]             512
            ReLU-236          [32, 256, 16, 16]               0
          Conv2d-237         [32, 1024, 16, 16]         263,168
     BatchNorm2d-238         [32, 1024, 16, 16]           2,048
            ReLU-239         [32, 1024, 16, 16]               0
           Block-240         [32, 1024, 16, 16]               0
          Conv2d-241          [32, 256, 16, 16]         262,400
     BatchNorm2d-242          [32, 256, 16, 16]             512
            ReLU-243          [32, 256, 16, 16]               0
          Conv2d-244          [32, 256, 16, 16]         590,080
     BatchNorm2d-245          [32, 256, 16, 16]             512
            ReLU-246          [32, 256, 16, 16]               0
          Conv2d-247         [32, 1024, 16, 16]         263,168
     BatchNorm2d-248         [32, 1024, 16, 16]           2,048
            ReLU-249         [32, 1024, 16, 16]               0
           Block-250         [32, 1024, 16, 16]               0
          Conv2d-251          [32, 256, 16, 16]         262,400
     BatchNorm2d-252          [32, 256, 16, 16]             512
            ReLU-253          [32, 256, 16, 16]               0
          Conv2d-254          [32, 256, 16, 16]         590,080
     BatchNorm2d-255          [32, 256, 16, 16]             512
            ReLU-256          [32, 256, 16, 16]               0
          Conv2d-257         [32, 1024, 16, 16]         263,168
     BatchNorm2d-258         [32, 1024, 16, 16]           2,048
            ReLU-259         [32, 1024, 16, 16]               0
           Block-260         [32, 1024, 16, 16]               0
          Conv2d-261          [32, 256, 16, 16]         262,400
     BatchNorm2d-262          [32, 256, 16, 16]             512
            ReLU-263          [32, 256, 16, 16]               0
          Conv2d-264          [32, 256, 16, 16]         590,080
     BatchNorm2d-265          [32, 256, 16, 16]             512
            ReLU-266          [32, 256, 16, 16]               0
          Conv2d-267         [32, 1024, 16, 16]         263,168
     BatchNorm2d-268         [32, 1024, 16, 16]           2,048
            ReLU-269         [32, 1024, 16, 16]               0
           Block-270         [32, 1024, 16, 16]               0
          Conv2d-271          [32, 256, 16, 16]         262,400
     BatchNorm2d-272          [32, 256, 16, 16]             512
            ReLU-273          [32, 256, 16, 16]               0
          Conv2d-274          [32, 256, 16, 16]         590,080
     BatchNorm2d-275          [32, 256, 16, 16]             512
            ReLU-276          [32, 256, 16, 16]               0
          Conv2d-277         [32, 1024, 16, 16]         263,168
     BatchNorm2d-278         [32, 1024, 16, 16]           2,048
            ReLU-279         [32, 1024, 16, 16]               0
           Block-280         [32, 1024, 16, 16]               0
          Conv2d-281          [32, 256, 16, 16]         262,400
     BatchNorm2d-282          [32, 256, 16, 16]             512
            ReLU-283          [32, 256, 16, 16]               0
          Conv2d-284          [32, 256, 16, 16]         590,080
     BatchNorm2d-285          [32, 256, 16, 16]             512
            ReLU-286          [32, 256, 16, 16]               0
          Conv2d-287         [32, 1024, 16, 16]         263,168
     BatchNorm2d-288         [32, 1024, 16, 16]           2,048
            ReLU-289         [32, 1024, 16, 16]               0
           Block-290         [32, 1024, 16, 16]               0
          Conv2d-291          [32, 256, 16, 16]         262,400
     BatchNorm2d-292          [32, 256, 16, 16]             512
            ReLU-293          [32, 256, 16, 16]               0
          Conv2d-294          [32, 256, 16, 16]         590,080
     BatchNorm2d-295          [32, 256, 16, 16]             512
            ReLU-296          [32, 256, 16, 16]               0
          Conv2d-297         [32, 1024, 16, 16]         263,168
     BatchNorm2d-298         [32, 1024, 16, 16]           2,048
            ReLU-299         [32, 1024, 16, 16]               0
           Block-300         [32, 1024, 16, 16]               0
          Conv2d-301          [32, 256, 16, 16]         262,400
     BatchNorm2d-302          [32, 256, 16, 16]             512
            ReLU-303          [32, 256, 16, 16]               0
          Conv2d-304          [32, 256, 16, 16]         590,080
     BatchNorm2d-305          [32, 256, 16, 16]             512
            ReLU-306          [32, 256, 16, 16]               0
          Conv2d-307         [32, 1024, 16, 16]         263,168
     BatchNorm2d-308         [32, 1024, 16, 16]           2,048
            ReLU-309         [32, 1024, 16, 16]               0
           Block-310         [32, 1024, 16, 16]               0
          Conv2d-311          [32, 512, 16, 16]         524,800
     BatchNorm2d-312          [32, 512, 16, 16]           1,024
            ReLU-313          [32, 512, 16, 16]               0
          Conv2d-314            [32, 512, 8, 8]       2,359,808
     BatchNorm2d-315            [32, 512, 8, 8]           1,024
            ReLU-316            [32, 512, 8, 8]               0
          Conv2d-317           [32, 2048, 8, 8]       1,050,624
     BatchNorm2d-318           [32, 2048, 8, 8]           4,096
          Conv2d-319           [32, 2048, 8, 8]       2,099,200
     BatchNorm2d-320           [32, 2048, 8, 8]           4,096
            ReLU-321           [32, 2048, 8, 8]               0
           Block-322           [32, 2048, 8, 8]               0
          Conv2d-323            [32, 512, 8, 8]       1,049,088
     BatchNorm2d-324            [32, 512, 8, 8]           1,024
            ReLU-325            [32, 512, 8, 8]               0
          Conv2d-326            [32, 512, 8, 8]       2,359,808
     BatchNorm2d-327            [32, 512, 8, 8]           1,024
            ReLU-328            [32, 512, 8, 8]               0
          Conv2d-329           [32, 2048, 8, 8]       1,050,624
     BatchNorm2d-330           [32, 2048, 8, 8]           4,096
            ReLU-331           [32, 2048, 8, 8]               0
           Block-332           [32, 2048, 8, 8]               0
          Conv2d-333            [32, 512, 8, 8]       1,049,088
     BatchNorm2d-334            [32, 512, 8, 8]           1,024
            ReLU-335            [32, 512, 8, 8]               0
          Conv2d-336            [32, 512, 8, 8]       2,359,808
     BatchNorm2d-337            [32, 512, 8, 8]           1,024
            ReLU-338            [32, 512, 8, 8]               0
          Conv2d-339           [32, 2048, 8, 8]       1,050,624
     BatchNorm2d-340           [32, 2048, 8, 8]           4,096
            ReLU-341           [32, 2048, 8, 8]               0
           Block-342           [32, 2048, 8, 8]               0
AdaptiveAvgPool2d-343           [32, 2048, 1, 1]               0
         Flatten-344                 [32, 2048]               0
          Linear-345                    [32, 2]           4,098
          ResNet-346                    [32, 2]               0
================================================================
Total params: 42,556,930
Trainable params: 42,556,930
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 24.00
Forward/backward pass size (MB): 17961.00
Params size (MB): 162.34
Estimated Total Size (MB): 18147.34
----------------------------------------------------------------

