ResNet50----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [32, 64, 122, 122]           9,472
       BatchNorm2d-2         [32, 64, 122, 122]             128
              ReLU-3         [32, 64, 122, 122]               0
         MaxPool2d-4           [32, 64, 61, 61]               0
            Conv2d-5           [32, 64, 61, 61]           4,160
       BatchNorm2d-6           [32, 64, 61, 61]             128
              ReLU-7           [32, 64, 61, 61]               0
            Conv2d-8           [32, 64, 61, 61]          36,928
       BatchNorm2d-9           [32, 64, 61, 61]             128
             ReLU-10           [32, 64, 61, 61]               0
           Conv2d-11          [32, 256, 61, 61]          16,640
      BatchNorm2d-12          [32, 256, 61, 61]             512
           Conv2d-13          [32, 256, 61, 61]          16,640
      BatchNorm2d-14          [32, 256, 61, 61]             512
             ReLU-15          [32, 256, 61, 61]               0
            Block-16          [32, 256, 61, 61]               0
           Conv2d-17           [32, 64, 61, 61]          16,448
      BatchNorm2d-18           [32, 64, 61, 61]             128
             ReLU-19           [32, 64, 61, 61]               0
           Conv2d-20           [32, 64, 61, 61]          36,928
      BatchNorm2d-21           [32, 64, 61, 61]             128
             ReLU-22           [32, 64, 61, 61]               0
           Conv2d-23          [32, 256, 61, 61]          16,640
      BatchNorm2d-24          [32, 256, 61, 61]             512
             ReLU-25          [32, 256, 61, 61]               0
            Block-26          [32, 256, 61, 61]               0
           Conv2d-27           [32, 64, 61, 61]          16,448
      BatchNorm2d-28           [32, 64, 61, 61]             128
             ReLU-29           [32, 64, 61, 61]               0
           Conv2d-30           [32, 64, 61, 61]          36,928
      BatchNorm2d-31           [32, 64, 61, 61]             128
             ReLU-32           [32, 64, 61, 61]               0
           Conv2d-33          [32, 256, 61, 61]          16,640
      BatchNorm2d-34          [32, 256, 61, 61]             512
             ReLU-35          [32, 256, 61, 61]               0
            Block-36          [32, 256, 61, 61]               0
           Conv2d-37          [32, 128, 61, 61]          32,896
      BatchNorm2d-38          [32, 128, 61, 61]             256
             ReLU-39          [32, 128, 61, 61]               0
           Conv2d-40          [32, 128, 31, 31]         147,584
      BatchNorm2d-41          [32, 128, 31, 31]             256
             ReLU-42          [32, 128, 31, 31]               0
           Conv2d-43          [32, 512, 31, 31]          66,048
      BatchNorm2d-44          [32, 512, 31, 31]           1,024
           Conv2d-45          [32, 512, 31, 31]         131,584
      BatchNorm2d-46          [32, 512, 31, 31]           1,024
             ReLU-47          [32, 512, 31, 31]               0
            Block-48          [32, 512, 31, 31]               0
           Conv2d-49          [32, 128, 31, 31]          65,664
      BatchNorm2d-50          [32, 128, 31, 31]             256
             ReLU-51          [32, 128, 31, 31]               0
           Conv2d-52          [32, 128, 31, 31]         147,584
      BatchNorm2d-53          [32, 128, 31, 31]             256
             ReLU-54          [32, 128, 31, 31]               0
           Conv2d-55          [32, 512, 31, 31]          66,048
      BatchNorm2d-56          [32, 512, 31, 31]           1,024
             ReLU-57          [32, 512, 31, 31]               0
            Block-58          [32, 512, 31, 31]               0
           Conv2d-59          [32, 128, 31, 31]          65,664
      BatchNorm2d-60          [32, 128, 31, 31]             256
             ReLU-61          [32, 128, 31, 31]               0
           Conv2d-62          [32, 128, 31, 31]         147,584
      BatchNorm2d-63          [32, 128, 31, 31]             256
             ReLU-64          [32, 128, 31, 31]               0
           Conv2d-65          [32, 512, 31, 31]          66,048
      BatchNorm2d-66          [32, 512, 31, 31]           1,024
             ReLU-67          [32, 512, 31, 31]               0
            Block-68          [32, 512, 31, 31]               0
           Conv2d-69          [32, 128, 31, 31]          65,664
      BatchNorm2d-70          [32, 128, 31, 31]             256
             ReLU-71          [32, 128, 31, 31]               0
           Conv2d-72          [32, 128, 31, 31]         147,584
      BatchNorm2d-73          [32, 128, 31, 31]             256
             ReLU-74          [32, 128, 31, 31]               0
           Conv2d-75          [32, 512, 31, 31]          66,048
      BatchNorm2d-76          [32, 512, 31, 31]           1,024
             ReLU-77          [32, 512, 31, 31]               0
            Block-78          [32, 512, 31, 31]               0
           Conv2d-79          [32, 256, 31, 31]         131,328
      BatchNorm2d-80          [32, 256, 31, 31]             512
             ReLU-81          [32, 256, 31, 31]               0
           Conv2d-82          [32, 256, 16, 16]         590,080
      BatchNorm2d-83          [32, 256, 16, 16]             512
             ReLU-84          [32, 256, 16, 16]               0
           Conv2d-85         [32, 1024, 16, 16]         263,168
      BatchNorm2d-86         [32, 1024, 16, 16]           2,048
           Conv2d-87         [32, 1024, 16, 16]         525,312
      BatchNorm2d-88         [32, 1024, 16, 16]           2,048
             ReLU-89         [32, 1024, 16, 16]               0
            Block-90         [32, 1024, 16, 16]               0
           Conv2d-91          [32, 256, 16, 16]         262,400
      BatchNorm2d-92          [32, 256, 16, 16]             512
             ReLU-93          [32, 256, 16, 16]               0
           Conv2d-94          [32, 256, 16, 16]         590,080
      BatchNorm2d-95          [32, 256, 16, 16]             512
             ReLU-96          [32, 256, 16, 16]               0
           Conv2d-97         [32, 1024, 16, 16]         263,168
      BatchNorm2d-98         [32, 1024, 16, 16]           2,048
             ReLU-99         [32, 1024, 16, 16]               0
           Block-100         [32, 1024, 16, 16]               0
          Conv2d-101          [32, 256, 16, 16]         262,400
     BatchNorm2d-102          [32, 256, 16, 16]             512
            ReLU-103          [32, 256, 16, 16]               0
          Conv2d-104          [32, 256, 16, 16]         590,080
     BatchNorm2d-105          [32, 256, 16, 16]             512
            ReLU-106          [32, 256, 16, 16]               0
          Conv2d-107         [32, 1024, 16, 16]         263,168
     BatchNorm2d-108         [32, 1024, 16, 16]           2,048
            ReLU-109         [32, 1024, 16, 16]               0
           Block-110         [32, 1024, 16, 16]               0
          Conv2d-111          [32, 256, 16, 16]         262,400
     BatchNorm2d-112          [32, 256, 16, 16]             512
            ReLU-113          [32, 256, 16, 16]               0
          Conv2d-114          [32, 256, 16, 16]         590,080
     BatchNorm2d-115          [32, 256, 16, 16]             512
            ReLU-116          [32, 256, 16, 16]               0
          Conv2d-117         [32, 1024, 16, 16]         263,168
     BatchNorm2d-118         [32, 1024, 16, 16]           2,048
            ReLU-119         [32, 1024, 16, 16]               0
           Block-120         [32, 1024, 16, 16]               0
          Conv2d-121          [32, 256, 16, 16]         262,400
     BatchNorm2d-122          [32, 256, 16, 16]             512
            ReLU-123          [32, 256, 16, 16]               0
          Conv2d-124          [32, 256, 16, 16]         590,080
     BatchNorm2d-125          [32, 256, 16, 16]             512
            ReLU-126          [32, 256, 16, 16]               0
          Conv2d-127         [32, 1024, 16, 16]         263,168
     BatchNorm2d-128         [32, 1024, 16, 16]           2,048
            ReLU-129         [32, 1024, 16, 16]               0
           Block-130         [32, 1024, 16, 16]               0
          Conv2d-131          [32, 256, 16, 16]         262,400
     BatchNorm2d-132          [32, 256, 16, 16]             512
            ReLU-133          [32, 256, 16, 16]               0
          Conv2d-134          [32, 256, 16, 16]         590,080
     BatchNorm2d-135          [32, 256, 16, 16]             512
            ReLU-136          [32, 256, 16, 16]               0
          Conv2d-137         [32, 1024, 16, 16]         263,168
     BatchNorm2d-138         [32, 1024, 16, 16]           2,048
            ReLU-139         [32, 1024, 16, 16]               0
           Block-140         [32, 1024, 16, 16]               0
          Conv2d-141          [32, 512, 16, 16]         524,800
     BatchNorm2d-142          [32, 512, 16, 16]           1,024
            ReLU-143          [32, 512, 16, 16]               0
          Conv2d-144            [32, 512, 8, 8]       2,359,808
     BatchNorm2d-145            [32, 512, 8, 8]           1,024
            ReLU-146            [32, 512, 8, 8]               0
          Conv2d-147           [32, 2048, 8, 8]       1,050,624
     BatchNorm2d-148           [32, 2048, 8, 8]           4,096
          Conv2d-149           [32, 2048, 8, 8]       2,099,200
     BatchNorm2d-150           [32, 2048, 8, 8]           4,096
            ReLU-151           [32, 2048, 8, 8]               0
           Block-152           [32, 2048, 8, 8]               0
          Conv2d-153            [32, 512, 8, 8]       1,049,088
     BatchNorm2d-154            [32, 512, 8, 8]           1,024
            ReLU-155            [32, 512, 8, 8]               0
          Conv2d-156            [32, 512, 8, 8]       2,359,808
     BatchNorm2d-157            [32, 512, 8, 8]           1,024
            ReLU-158            [32, 512, 8, 8]               0
          Conv2d-159           [32, 2048, 8, 8]       1,050,624
     BatchNorm2d-160           [32, 2048, 8, 8]           4,096
            ReLU-161           [32, 2048, 8, 8]               0
           Block-162           [32, 2048, 8, 8]               0
          Conv2d-163            [32, 512, 8, 8]       1,049,088
     BatchNorm2d-164            [32, 512, 8, 8]           1,024
            ReLU-165            [32, 512, 8, 8]               0
          Conv2d-166            [32, 512, 8, 8]       2,359,808
     BatchNorm2d-167            [32, 512, 8, 8]           1,024
            ReLU-168            [32, 512, 8, 8]               0
          Conv2d-169           [32, 2048, 8, 8]       1,050,624
     BatchNorm2d-170           [32, 2048, 8, 8]           4,096
            ReLU-171           [32, 2048, 8, 8]               0
           Block-172           [32, 2048, 8, 8]               0
AdaptiveAvgPool2d-173           [32, 2048, 1, 1]               0
         Flatten-174                 [32, 2048]               0
          Linear-175                    [32, 2]           4,098
          ResNet-176                    [32, 2]               0
================================================================
Total params: 23,538,690
Trainable params: 23,538,690
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 21.80
Forward/backward pass size (MB): 11237.17
Params size (MB): 89.79
Estimated Total Size (MB): 11348.77
----------------------------------------------------------------

