ResNet152----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [2, 64, 128, 128]           9,472
       BatchNorm2d-2          [2, 64, 128, 128]             128
              ReLU-3          [2, 64, 128, 128]               0
         MaxPool2d-4            [2, 64, 64, 64]               0
            Conv2d-5            [2, 64, 64, 64]           4,160
       BatchNorm2d-6            [2, 64, 64, 64]             128
              ReLU-7            [2, 64, 64, 64]               0
            Conv2d-8            [2, 64, 64, 64]          36,928
       BatchNorm2d-9            [2, 64, 64, 64]             128
             ReLU-10            [2, 64, 64, 64]               0
           Conv2d-11           [2, 256, 64, 64]          16,640
      BatchNorm2d-12           [2, 256, 64, 64]             512
           Conv2d-13           [2, 256, 64, 64]          16,640
      BatchNorm2d-14           [2, 256, 64, 64]             512
             ReLU-15           [2, 256, 64, 64]               0
            Block-16           [2, 256, 64, 64]               0
           Conv2d-17            [2, 64, 64, 64]          16,448
      BatchNorm2d-18            [2, 64, 64, 64]             128
             ReLU-19            [2, 64, 64, 64]               0
           Conv2d-20            [2, 64, 64, 64]          36,928
      BatchNorm2d-21            [2, 64, 64, 64]             128
             ReLU-22            [2, 64, 64, 64]               0
           Conv2d-23           [2, 256, 64, 64]          16,640
      BatchNorm2d-24           [2, 256, 64, 64]             512
             ReLU-25           [2, 256, 64, 64]               0
            Block-26           [2, 256, 64, 64]               0
           Conv2d-27            [2, 64, 64, 64]          16,448
      BatchNorm2d-28            [2, 64, 64, 64]             128
             ReLU-29            [2, 64, 64, 64]               0
           Conv2d-30            [2, 64, 64, 64]          36,928
      BatchNorm2d-31            [2, 64, 64, 64]             128
             ReLU-32            [2, 64, 64, 64]               0
           Conv2d-33           [2, 256, 64, 64]          16,640
      BatchNorm2d-34           [2, 256, 64, 64]             512
             ReLU-35           [2, 256, 64, 64]               0
            Block-36           [2, 256, 64, 64]               0
           Conv2d-37           [2, 128, 64, 64]          32,896
      BatchNorm2d-38           [2, 128, 64, 64]             256
             ReLU-39           [2, 128, 64, 64]               0
           Conv2d-40           [2, 128, 32, 32]         147,584
      BatchNorm2d-41           [2, 128, 32, 32]             256
             ReLU-42           [2, 128, 32, 32]               0
           Conv2d-43           [2, 512, 32, 32]          66,048
      BatchNorm2d-44           [2, 512, 32, 32]           1,024
           Conv2d-45           [2, 512, 32, 32]         131,584
      BatchNorm2d-46           [2, 512, 32, 32]           1,024
             ReLU-47           [2, 512, 32, 32]               0
            Block-48           [2, 512, 32, 32]               0
           Conv2d-49           [2, 128, 32, 32]          65,664
      BatchNorm2d-50           [2, 128, 32, 32]             256
             ReLU-51           [2, 128, 32, 32]               0
           Conv2d-52           [2, 128, 32, 32]         147,584
      BatchNorm2d-53           [2, 128, 32, 32]             256
             ReLU-54           [2, 128, 32, 32]               0
           Conv2d-55           [2, 512, 32, 32]          66,048
      BatchNorm2d-56           [2, 512, 32, 32]           1,024
             ReLU-57           [2, 512, 32, 32]               0
            Block-58           [2, 512, 32, 32]               0
           Conv2d-59           [2, 128, 32, 32]          65,664
      BatchNorm2d-60           [2, 128, 32, 32]             256
             ReLU-61           [2, 128, 32, 32]               0
           Conv2d-62           [2, 128, 32, 32]         147,584
      BatchNorm2d-63           [2, 128, 32, 32]             256
             ReLU-64           [2, 128, 32, 32]               0
           Conv2d-65           [2, 512, 32, 32]          66,048
      BatchNorm2d-66           [2, 512, 32, 32]           1,024
             ReLU-67           [2, 512, 32, 32]               0
            Block-68           [2, 512, 32, 32]               0
           Conv2d-69           [2, 128, 32, 32]          65,664
      BatchNorm2d-70           [2, 128, 32, 32]             256
             ReLU-71           [2, 128, 32, 32]               0
           Conv2d-72           [2, 128, 32, 32]         147,584
      BatchNorm2d-73           [2, 128, 32, 32]             256
             ReLU-74           [2, 128, 32, 32]               0
           Conv2d-75           [2, 512, 32, 32]          66,048
      BatchNorm2d-76           [2, 512, 32, 32]           1,024
             ReLU-77           [2, 512, 32, 32]               0
            Block-78           [2, 512, 32, 32]               0
           Conv2d-79           [2, 128, 32, 32]          65,664
      BatchNorm2d-80           [2, 128, 32, 32]             256
             ReLU-81           [2, 128, 32, 32]               0
           Conv2d-82           [2, 128, 32, 32]         147,584
      BatchNorm2d-83           [2, 128, 32, 32]             256
             ReLU-84           [2, 128, 32, 32]               0
           Conv2d-85           [2, 512, 32, 32]          66,048
      BatchNorm2d-86           [2, 512, 32, 32]           1,024
             ReLU-87           [2, 512, 32, 32]               0
            Block-88           [2, 512, 32, 32]               0
           Conv2d-89           [2, 128, 32, 32]          65,664
      BatchNorm2d-90           [2, 128, 32, 32]             256
             ReLU-91           [2, 128, 32, 32]               0
           Conv2d-92           [2, 128, 32, 32]         147,584
      BatchNorm2d-93           [2, 128, 32, 32]             256
             ReLU-94           [2, 128, 32, 32]               0
           Conv2d-95           [2, 512, 32, 32]          66,048
      BatchNorm2d-96           [2, 512, 32, 32]           1,024
             ReLU-97           [2, 512, 32, 32]               0
            Block-98           [2, 512, 32, 32]               0
           Conv2d-99           [2, 128, 32, 32]          65,664
     BatchNorm2d-100           [2, 128, 32, 32]             256
            ReLU-101           [2, 128, 32, 32]               0
          Conv2d-102           [2, 128, 32, 32]         147,584
     BatchNorm2d-103           [2, 128, 32, 32]             256
            ReLU-104           [2, 128, 32, 32]               0
          Conv2d-105           [2, 512, 32, 32]          66,048
     BatchNorm2d-106           [2, 512, 32, 32]           1,024
            ReLU-107           [2, 512, 32, 32]               0
           Block-108           [2, 512, 32, 32]               0
          Conv2d-109           [2, 128, 32, 32]          65,664
     BatchNorm2d-110           [2, 128, 32, 32]             256
            ReLU-111           [2, 128, 32, 32]               0
          Conv2d-112           [2, 128, 32, 32]         147,584
     BatchNorm2d-113           [2, 128, 32, 32]             256
            ReLU-114           [2, 128, 32, 32]               0
          Conv2d-115           [2, 512, 32, 32]          66,048
     BatchNorm2d-116           [2, 512, 32, 32]           1,024
            ReLU-117           [2, 512, 32, 32]               0
           Block-118           [2, 512, 32, 32]               0
          Conv2d-119           [2, 256, 32, 32]         131,328
     BatchNorm2d-120           [2, 256, 32, 32]             512
            ReLU-121           [2, 256, 32, 32]               0
          Conv2d-122           [2, 256, 16, 16]         590,080
     BatchNorm2d-123           [2, 256, 16, 16]             512
            ReLU-124           [2, 256, 16, 16]               0
          Conv2d-125          [2, 1024, 16, 16]         263,168
     BatchNorm2d-126          [2, 1024, 16, 16]           2,048
          Conv2d-127          [2, 1024, 16, 16]         525,312
     BatchNorm2d-128          [2, 1024, 16, 16]           2,048
            ReLU-129          [2, 1024, 16, 16]               0
           Block-130          [2, 1024, 16, 16]               0
          Conv2d-131           [2, 256, 16, 16]         262,400
     BatchNorm2d-132           [2, 256, 16, 16]             512
            ReLU-133           [2, 256, 16, 16]               0
          Conv2d-134           [2, 256, 16, 16]         590,080
     BatchNorm2d-135           [2, 256, 16, 16]             512
            ReLU-136           [2, 256, 16, 16]               0
          Conv2d-137          [2, 1024, 16, 16]         263,168
     BatchNorm2d-138          [2, 1024, 16, 16]           2,048
            ReLU-139          [2, 1024, 16, 16]               0
           Block-140          [2, 1024, 16, 16]               0
          Conv2d-141           [2, 256, 16, 16]         262,400
     BatchNorm2d-142           [2, 256, 16, 16]             512
            ReLU-143           [2, 256, 16, 16]               0
          Conv2d-144           [2, 256, 16, 16]         590,080
     BatchNorm2d-145           [2, 256, 16, 16]             512
            ReLU-146           [2, 256, 16, 16]               0
          Conv2d-147          [2, 1024, 16, 16]         263,168
     BatchNorm2d-148          [2, 1024, 16, 16]           2,048
            ReLU-149          [2, 1024, 16, 16]               0
           Block-150          [2, 1024, 16, 16]               0
          Conv2d-151           [2, 256, 16, 16]         262,400
     BatchNorm2d-152           [2, 256, 16, 16]             512
            ReLU-153           [2, 256, 16, 16]               0
          Conv2d-154           [2, 256, 16, 16]         590,080
     BatchNorm2d-155           [2, 256, 16, 16]             512
            ReLU-156           [2, 256, 16, 16]               0
          Conv2d-157          [2, 1024, 16, 16]         263,168
     BatchNorm2d-158          [2, 1024, 16, 16]           2,048
            ReLU-159          [2, 1024, 16, 16]               0
           Block-160          [2, 1024, 16, 16]               0
          Conv2d-161           [2, 256, 16, 16]         262,400
     BatchNorm2d-162           [2, 256, 16, 16]             512
            ReLU-163           [2, 256, 16, 16]               0
          Conv2d-164           [2, 256, 16, 16]         590,080
     BatchNorm2d-165           [2, 256, 16, 16]             512
            ReLU-166           [2, 256, 16, 16]               0
          Conv2d-167          [2, 1024, 16, 16]         263,168
     BatchNorm2d-168          [2, 1024, 16, 16]           2,048
            ReLU-169          [2, 1024, 16, 16]               0
           Block-170          [2, 1024, 16, 16]               0
          Conv2d-171           [2, 256, 16, 16]         262,400
     BatchNorm2d-172           [2, 256, 16, 16]             512
            ReLU-173           [2, 256, 16, 16]               0
          Conv2d-174           [2, 256, 16, 16]         590,080
     BatchNorm2d-175           [2, 256, 16, 16]             512
            ReLU-176           [2, 256, 16, 16]               0
          Conv2d-177          [2, 1024, 16, 16]         263,168
     BatchNorm2d-178          [2, 1024, 16, 16]           2,048
            ReLU-179          [2, 1024, 16, 16]               0
           Block-180          [2, 1024, 16, 16]               0
          Conv2d-181           [2, 256, 16, 16]         262,400
     BatchNorm2d-182           [2, 256, 16, 16]             512
            ReLU-183           [2, 256, 16, 16]               0
          Conv2d-184           [2, 256, 16, 16]         590,080
     BatchNorm2d-185           [2, 256, 16, 16]             512
            ReLU-186           [2, 256, 16, 16]               0
          Conv2d-187          [2, 1024, 16, 16]         263,168
     BatchNorm2d-188          [2, 1024, 16, 16]           2,048
            ReLU-189          [2, 1024, 16, 16]               0
           Block-190          [2, 1024, 16, 16]               0
          Conv2d-191           [2, 256, 16, 16]         262,400
     BatchNorm2d-192           [2, 256, 16, 16]             512
            ReLU-193           [2, 256, 16, 16]               0
          Conv2d-194           [2, 256, 16, 16]         590,080
     BatchNorm2d-195           [2, 256, 16, 16]             512
            ReLU-196           [2, 256, 16, 16]               0
          Conv2d-197          [2, 1024, 16, 16]         263,168
     BatchNorm2d-198          [2, 1024, 16, 16]           2,048
            ReLU-199          [2, 1024, 16, 16]               0
           Block-200          [2, 1024, 16, 16]               0
          Conv2d-201           [2, 256, 16, 16]         262,400
     BatchNorm2d-202           [2, 256, 16, 16]             512
            ReLU-203           [2, 256, 16, 16]               0
          Conv2d-204           [2, 256, 16, 16]         590,080
     BatchNorm2d-205           [2, 256, 16, 16]             512
            ReLU-206           [2, 256, 16, 16]               0
          Conv2d-207          [2, 1024, 16, 16]         263,168
     BatchNorm2d-208          [2, 1024, 16, 16]           2,048
            ReLU-209          [2, 1024, 16, 16]               0
           Block-210          [2, 1024, 16, 16]               0
          Conv2d-211           [2, 256, 16, 16]         262,400
     BatchNorm2d-212           [2, 256, 16, 16]             512
            ReLU-213           [2, 256, 16, 16]               0
          Conv2d-214           [2, 256, 16, 16]         590,080
     BatchNorm2d-215           [2, 256, 16, 16]             512
            ReLU-216           [2, 256, 16, 16]               0
          Conv2d-217          [2, 1024, 16, 16]         263,168
     BatchNorm2d-218          [2, 1024, 16, 16]           2,048
            ReLU-219          [2, 1024, 16, 16]               0
           Block-220          [2, 1024, 16, 16]               0
          Conv2d-221           [2, 256, 16, 16]         262,400
     BatchNorm2d-222           [2, 256, 16, 16]             512
            ReLU-223           [2, 256, 16, 16]               0
          Conv2d-224           [2, 256, 16, 16]         590,080
     BatchNorm2d-225           [2, 256, 16, 16]             512
            ReLU-226           [2, 256, 16, 16]               0
          Conv2d-227          [2, 1024, 16, 16]         263,168
     BatchNorm2d-228          [2, 1024, 16, 16]           2,048
            ReLU-229          [2, 1024, 16, 16]               0
           Block-230          [2, 1024, 16, 16]               0
          Conv2d-231           [2, 256, 16, 16]         262,400
     BatchNorm2d-232           [2, 256, 16, 16]             512
            ReLU-233           [2, 256, 16, 16]               0
          Conv2d-234           [2, 256, 16, 16]         590,080
     BatchNorm2d-235           [2, 256, 16, 16]             512
            ReLU-236           [2, 256, 16, 16]               0
          Conv2d-237          [2, 1024, 16, 16]         263,168
     BatchNorm2d-238          [2, 1024, 16, 16]           2,048
            ReLU-239          [2, 1024, 16, 16]               0
           Block-240          [2, 1024, 16, 16]               0
          Conv2d-241           [2, 256, 16, 16]         262,400
     BatchNorm2d-242           [2, 256, 16, 16]             512
            ReLU-243           [2, 256, 16, 16]               0
          Conv2d-244           [2, 256, 16, 16]         590,080
     BatchNorm2d-245           [2, 256, 16, 16]             512
            ReLU-246           [2, 256, 16, 16]               0
          Conv2d-247          [2, 1024, 16, 16]         263,168
     BatchNorm2d-248          [2, 1024, 16, 16]           2,048
            ReLU-249          [2, 1024, 16, 16]               0
           Block-250          [2, 1024, 16, 16]               0
          Conv2d-251           [2, 256, 16, 16]         262,400
     BatchNorm2d-252           [2, 256, 16, 16]             512
            ReLU-253           [2, 256, 16, 16]               0
          Conv2d-254           [2, 256, 16, 16]         590,080
     BatchNorm2d-255           [2, 256, 16, 16]             512
            ReLU-256           [2, 256, 16, 16]               0
          Conv2d-257          [2, 1024, 16, 16]         263,168
     BatchNorm2d-258          [2, 1024, 16, 16]           2,048
            ReLU-259          [2, 1024, 16, 16]               0
           Block-260          [2, 1024, 16, 16]               0
          Conv2d-261           [2, 256, 16, 16]         262,400
     BatchNorm2d-262           [2, 256, 16, 16]             512
            ReLU-263           [2, 256, 16, 16]               0
          Conv2d-264           [2, 256, 16, 16]         590,080
     BatchNorm2d-265           [2, 256, 16, 16]             512
            ReLU-266           [2, 256, 16, 16]               0
          Conv2d-267          [2, 1024, 16, 16]         263,168
     BatchNorm2d-268          [2, 1024, 16, 16]           2,048
            ReLU-269          [2, 1024, 16, 16]               0
           Block-270          [2, 1024, 16, 16]               0
          Conv2d-271           [2, 256, 16, 16]         262,400
     BatchNorm2d-272           [2, 256, 16, 16]             512
            ReLU-273           [2, 256, 16, 16]               0
          Conv2d-274           [2, 256, 16, 16]         590,080
     BatchNorm2d-275           [2, 256, 16, 16]             512
            ReLU-276           [2, 256, 16, 16]               0
          Conv2d-277          [2, 1024, 16, 16]         263,168
     BatchNorm2d-278          [2, 1024, 16, 16]           2,048
            ReLU-279          [2, 1024, 16, 16]               0
           Block-280          [2, 1024, 16, 16]               0
          Conv2d-281           [2, 256, 16, 16]         262,400
     BatchNorm2d-282           [2, 256, 16, 16]             512
            ReLU-283           [2, 256, 16, 16]               0
          Conv2d-284           [2, 256, 16, 16]         590,080
     BatchNorm2d-285           [2, 256, 16, 16]             512
            ReLU-286           [2, 256, 16, 16]               0
          Conv2d-287          [2, 1024, 16, 16]         263,168
     BatchNorm2d-288          [2, 1024, 16, 16]           2,048
            ReLU-289          [2, 1024, 16, 16]               0
           Block-290          [2, 1024, 16, 16]               0
          Conv2d-291           [2, 256, 16, 16]         262,400
     BatchNorm2d-292           [2, 256, 16, 16]             512
            ReLU-293           [2, 256, 16, 16]               0
          Conv2d-294           [2, 256, 16, 16]         590,080
     BatchNorm2d-295           [2, 256, 16, 16]             512
            ReLU-296           [2, 256, 16, 16]               0
          Conv2d-297          [2, 1024, 16, 16]         263,168
     BatchNorm2d-298          [2, 1024, 16, 16]           2,048
            ReLU-299          [2, 1024, 16, 16]               0
           Block-300          [2, 1024, 16, 16]               0
          Conv2d-301           [2, 256, 16, 16]         262,400
     BatchNorm2d-302           [2, 256, 16, 16]             512
            ReLU-303           [2, 256, 16, 16]               0
          Conv2d-304           [2, 256, 16, 16]         590,080
     BatchNorm2d-305           [2, 256, 16, 16]             512
            ReLU-306           [2, 256, 16, 16]               0
          Conv2d-307          [2, 1024, 16, 16]         263,168
     BatchNorm2d-308          [2, 1024, 16, 16]           2,048
            ReLU-309          [2, 1024, 16, 16]               0
           Block-310          [2, 1024, 16, 16]               0
          Conv2d-311           [2, 256, 16, 16]         262,400
     BatchNorm2d-312           [2, 256, 16, 16]             512
            ReLU-313           [2, 256, 16, 16]               0
          Conv2d-314           [2, 256, 16, 16]         590,080
     BatchNorm2d-315           [2, 256, 16, 16]             512
            ReLU-316           [2, 256, 16, 16]               0
          Conv2d-317          [2, 1024, 16, 16]         263,168
     BatchNorm2d-318          [2, 1024, 16, 16]           2,048
            ReLU-319          [2, 1024, 16, 16]               0
           Block-320          [2, 1024, 16, 16]               0
          Conv2d-321           [2, 256, 16, 16]         262,400
     BatchNorm2d-322           [2, 256, 16, 16]             512
            ReLU-323           [2, 256, 16, 16]               0
          Conv2d-324           [2, 256, 16, 16]         590,080
     BatchNorm2d-325           [2, 256, 16, 16]             512
            ReLU-326           [2, 256, 16, 16]               0
          Conv2d-327          [2, 1024, 16, 16]         263,168
     BatchNorm2d-328          [2, 1024, 16, 16]           2,048
            ReLU-329          [2, 1024, 16, 16]               0
           Block-330          [2, 1024, 16, 16]               0
          Conv2d-331           [2, 256, 16, 16]         262,400
     BatchNorm2d-332           [2, 256, 16, 16]             512
            ReLU-333           [2, 256, 16, 16]               0
          Conv2d-334           [2, 256, 16, 16]         590,080
     BatchNorm2d-335           [2, 256, 16, 16]             512
            ReLU-336           [2, 256, 16, 16]               0
          Conv2d-337          [2, 1024, 16, 16]         263,168
     BatchNorm2d-338          [2, 1024, 16, 16]           2,048
            ReLU-339          [2, 1024, 16, 16]               0
           Block-340          [2, 1024, 16, 16]               0
          Conv2d-341           [2, 256, 16, 16]         262,400
     BatchNorm2d-342           [2, 256, 16, 16]             512
            ReLU-343           [2, 256, 16, 16]               0
          Conv2d-344           [2, 256, 16, 16]         590,080
     BatchNorm2d-345           [2, 256, 16, 16]             512
            ReLU-346           [2, 256, 16, 16]               0
          Conv2d-347          [2, 1024, 16, 16]         263,168
     BatchNorm2d-348          [2, 1024, 16, 16]           2,048
            ReLU-349          [2, 1024, 16, 16]               0
           Block-350          [2, 1024, 16, 16]               0
          Conv2d-351           [2, 256, 16, 16]         262,400
     BatchNorm2d-352           [2, 256, 16, 16]             512
            ReLU-353           [2, 256, 16, 16]               0
          Conv2d-354           [2, 256, 16, 16]         590,080
     BatchNorm2d-355           [2, 256, 16, 16]             512
            ReLU-356           [2, 256, 16, 16]               0
          Conv2d-357          [2, 1024, 16, 16]         263,168
     BatchNorm2d-358          [2, 1024, 16, 16]           2,048
            ReLU-359          [2, 1024, 16, 16]               0
           Block-360          [2, 1024, 16, 16]               0
          Conv2d-361           [2, 256, 16, 16]         262,400
     BatchNorm2d-362           [2, 256, 16, 16]             512
            ReLU-363           [2, 256, 16, 16]               0
          Conv2d-364           [2, 256, 16, 16]         590,080
     BatchNorm2d-365           [2, 256, 16, 16]             512
            ReLU-366           [2, 256, 16, 16]               0
          Conv2d-367          [2, 1024, 16, 16]         263,168
     BatchNorm2d-368          [2, 1024, 16, 16]           2,048
            ReLU-369          [2, 1024, 16, 16]               0
           Block-370          [2, 1024, 16, 16]               0
          Conv2d-371           [2, 256, 16, 16]         262,400
     BatchNorm2d-372           [2, 256, 16, 16]             512
            ReLU-373           [2, 256, 16, 16]               0
          Conv2d-374           [2, 256, 16, 16]         590,080
     BatchNorm2d-375           [2, 256, 16, 16]             512
            ReLU-376           [2, 256, 16, 16]               0
          Conv2d-377          [2, 1024, 16, 16]         263,168
     BatchNorm2d-378          [2, 1024, 16, 16]           2,048
            ReLU-379          [2, 1024, 16, 16]               0
           Block-380          [2, 1024, 16, 16]               0
          Conv2d-381           [2, 256, 16, 16]         262,400
     BatchNorm2d-382           [2, 256, 16, 16]             512
            ReLU-383           [2, 256, 16, 16]               0
          Conv2d-384           [2, 256, 16, 16]         590,080
     BatchNorm2d-385           [2, 256, 16, 16]             512
            ReLU-386           [2, 256, 16, 16]               0
          Conv2d-387          [2, 1024, 16, 16]         263,168
     BatchNorm2d-388          [2, 1024, 16, 16]           2,048
            ReLU-389          [2, 1024, 16, 16]               0
           Block-390          [2, 1024, 16, 16]               0
          Conv2d-391           [2, 256, 16, 16]         262,400
     BatchNorm2d-392           [2, 256, 16, 16]             512
            ReLU-393           [2, 256, 16, 16]               0
          Conv2d-394           [2, 256, 16, 16]         590,080
     BatchNorm2d-395           [2, 256, 16, 16]             512
            ReLU-396           [2, 256, 16, 16]               0
          Conv2d-397          [2, 1024, 16, 16]         263,168
     BatchNorm2d-398          [2, 1024, 16, 16]           2,048
            ReLU-399          [2, 1024, 16, 16]               0
           Block-400          [2, 1024, 16, 16]               0
          Conv2d-401           [2, 256, 16, 16]         262,400
     BatchNorm2d-402           [2, 256, 16, 16]             512
            ReLU-403           [2, 256, 16, 16]               0
          Conv2d-404           [2, 256, 16, 16]         590,080
     BatchNorm2d-405           [2, 256, 16, 16]             512
            ReLU-406           [2, 256, 16, 16]               0
          Conv2d-407          [2, 1024, 16, 16]         263,168
     BatchNorm2d-408          [2, 1024, 16, 16]           2,048
            ReLU-409          [2, 1024, 16, 16]               0
           Block-410          [2, 1024, 16, 16]               0
          Conv2d-411           [2, 256, 16, 16]         262,400
     BatchNorm2d-412           [2, 256, 16, 16]             512
            ReLU-413           [2, 256, 16, 16]               0
          Conv2d-414           [2, 256, 16, 16]         590,080
     BatchNorm2d-415           [2, 256, 16, 16]             512
            ReLU-416           [2, 256, 16, 16]               0
          Conv2d-417          [2, 1024, 16, 16]         263,168
     BatchNorm2d-418          [2, 1024, 16, 16]           2,048
            ReLU-419          [2, 1024, 16, 16]               0
           Block-420          [2, 1024, 16, 16]               0
          Conv2d-421           [2, 256, 16, 16]         262,400
     BatchNorm2d-422           [2, 256, 16, 16]             512
            ReLU-423           [2, 256, 16, 16]               0
          Conv2d-424           [2, 256, 16, 16]         590,080
     BatchNorm2d-425           [2, 256, 16, 16]             512
            ReLU-426           [2, 256, 16, 16]               0
          Conv2d-427          [2, 1024, 16, 16]         263,168
     BatchNorm2d-428          [2, 1024, 16, 16]           2,048
            ReLU-429          [2, 1024, 16, 16]               0
           Block-430          [2, 1024, 16, 16]               0
          Conv2d-431           [2, 256, 16, 16]         262,400
     BatchNorm2d-432           [2, 256, 16, 16]             512
            ReLU-433           [2, 256, 16, 16]               0
          Conv2d-434           [2, 256, 16, 16]         590,080
     BatchNorm2d-435           [2, 256, 16, 16]             512
            ReLU-436           [2, 256, 16, 16]               0
          Conv2d-437          [2, 1024, 16, 16]         263,168
     BatchNorm2d-438          [2, 1024, 16, 16]           2,048
            ReLU-439          [2, 1024, 16, 16]               0
           Block-440          [2, 1024, 16, 16]               0
          Conv2d-441           [2, 256, 16, 16]         262,400
     BatchNorm2d-442           [2, 256, 16, 16]             512
            ReLU-443           [2, 256, 16, 16]               0
          Conv2d-444           [2, 256, 16, 16]         590,080
     BatchNorm2d-445           [2, 256, 16, 16]             512
            ReLU-446           [2, 256, 16, 16]               0
          Conv2d-447          [2, 1024, 16, 16]         263,168
     BatchNorm2d-448          [2, 1024, 16, 16]           2,048
            ReLU-449          [2, 1024, 16, 16]               0
           Block-450          [2, 1024, 16, 16]               0
          Conv2d-451           [2, 256, 16, 16]         262,400
     BatchNorm2d-452           [2, 256, 16, 16]             512
            ReLU-453           [2, 256, 16, 16]               0
          Conv2d-454           [2, 256, 16, 16]         590,080
     BatchNorm2d-455           [2, 256, 16, 16]             512
            ReLU-456           [2, 256, 16, 16]               0
          Conv2d-457          [2, 1024, 16, 16]         263,168
     BatchNorm2d-458          [2, 1024, 16, 16]           2,048
            ReLU-459          [2, 1024, 16, 16]               0
           Block-460          [2, 1024, 16, 16]               0
          Conv2d-461           [2, 256, 16, 16]         262,400
     BatchNorm2d-462           [2, 256, 16, 16]             512
            ReLU-463           [2, 256, 16, 16]               0
          Conv2d-464           [2, 256, 16, 16]         590,080
     BatchNorm2d-465           [2, 256, 16, 16]             512
            ReLU-466           [2, 256, 16, 16]               0
          Conv2d-467          [2, 1024, 16, 16]         263,168
     BatchNorm2d-468          [2, 1024, 16, 16]           2,048
            ReLU-469          [2, 1024, 16, 16]               0
           Block-470          [2, 1024, 16, 16]               0
          Conv2d-471           [2, 256, 16, 16]         262,400
     BatchNorm2d-472           [2, 256, 16, 16]             512
            ReLU-473           [2, 256, 16, 16]               0
          Conv2d-474           [2, 256, 16, 16]         590,080
     BatchNorm2d-475           [2, 256, 16, 16]             512
            ReLU-476           [2, 256, 16, 16]               0
          Conv2d-477          [2, 1024, 16, 16]         263,168
     BatchNorm2d-478          [2, 1024, 16, 16]           2,048
            ReLU-479          [2, 1024, 16, 16]               0
           Block-480          [2, 1024, 16, 16]               0
          Conv2d-481           [2, 512, 16, 16]         524,800
     BatchNorm2d-482           [2, 512, 16, 16]           1,024
            ReLU-483           [2, 512, 16, 16]               0
          Conv2d-484             [2, 512, 8, 8]       2,359,808
     BatchNorm2d-485             [2, 512, 8, 8]           1,024
            ReLU-486             [2, 512, 8, 8]               0
          Conv2d-487            [2, 2048, 8, 8]       1,050,624
     BatchNorm2d-488            [2, 2048, 8, 8]           4,096
          Conv2d-489            [2, 2048, 8, 8]       2,099,200
     BatchNorm2d-490            [2, 2048, 8, 8]           4,096
            ReLU-491            [2, 2048, 8, 8]               0
           Block-492            [2, 2048, 8, 8]               0
          Conv2d-493             [2, 512, 8, 8]       1,049,088
     BatchNorm2d-494             [2, 512, 8, 8]           1,024
            ReLU-495             [2, 512, 8, 8]               0
          Conv2d-496             [2, 512, 8, 8]       2,359,808
     BatchNorm2d-497             [2, 512, 8, 8]           1,024
            ReLU-498             [2, 512, 8, 8]               0
          Conv2d-499            [2, 2048, 8, 8]       1,050,624
     BatchNorm2d-500            [2, 2048, 8, 8]           4,096
            ReLU-501            [2, 2048, 8, 8]               0
           Block-502            [2, 2048, 8, 8]               0
          Conv2d-503             [2, 512, 8, 8]       1,049,088
     BatchNorm2d-504             [2, 512, 8, 8]           1,024
            ReLU-505             [2, 512, 8, 8]               0
          Conv2d-506             [2, 512, 8, 8]       2,359,808
     BatchNorm2d-507             [2, 512, 8, 8]           1,024
            ReLU-508             [2, 512, 8, 8]               0
          Conv2d-509            [2, 2048, 8, 8]       1,050,624
     BatchNorm2d-510            [2, 2048, 8, 8]           4,096
            ReLU-511            [2, 2048, 8, 8]               0
           Block-512            [2, 2048, 8, 8]               0
AdaptiveAvgPool2d-513            [2, 2048, 1, 1]               0
         Flatten-514                  [2, 2048]               0
          Linear-515                     [2, 2]           4,098
          ResNet-516                     [2, 2]               0
================================================================
Total params: 58,223,618
Trainable params: 58,223,618
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.50
Forward/backward pass size (MB): 1584.56
Params size (MB): 222.11
Estimated Total Size (MB): 1808.17
----------------------------------------------------------------

