VGG16----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [32, 64, 244, 244]           1,792
       BatchNorm2d-2         [32, 64, 244, 244]             128
              ReLU-3         [32, 64, 244, 244]               0
            Conv2d-4         [32, 64, 244, 244]          36,928
       BatchNorm2d-5         [32, 64, 244, 244]             128
              ReLU-6         [32, 64, 244, 244]               0
         MaxPool2d-7         [32, 64, 122, 122]               0
            Conv2d-8        [32, 128, 122, 122]          73,856
       BatchNorm2d-9        [32, 128, 122, 122]             256
             ReLU-10        [32, 128, 122, 122]               0
           Conv2d-11        [32, 128, 122, 122]         147,584
      BatchNorm2d-12        [32, 128, 122, 122]             256
             ReLU-13        [32, 128, 122, 122]               0
        MaxPool2d-14          [32, 128, 61, 61]               0
           Conv2d-15          [32, 256, 61, 61]         295,168
      BatchNorm2d-16          [32, 256, 61, 61]             512
             ReLU-17          [32, 256, 61, 61]               0
           Conv2d-18          [32, 256, 61, 61]         590,080
      BatchNorm2d-19          [32, 256, 61, 61]             512
             ReLU-20          [32, 256, 61, 61]               0
           Conv2d-21          [32, 256, 61, 61]         590,080
      BatchNorm2d-22          [32, 256, 61, 61]             512
             ReLU-23          [32, 256, 61, 61]               0
        MaxPool2d-24          [32, 256, 30, 30]               0
           Conv2d-25          [32, 512, 30, 30]       1,180,160
      BatchNorm2d-26          [32, 512, 30, 30]           1,024
             ReLU-27          [32, 512, 30, 30]               0
           Conv2d-28          [32, 512, 30, 30]       2,359,808
      BatchNorm2d-29          [32, 512, 30, 30]           1,024
             ReLU-30          [32, 512, 30, 30]               0
           Conv2d-31          [32, 512, 30, 30]       2,359,808
      BatchNorm2d-32          [32, 512, 30, 30]           1,024
             ReLU-33          [32, 512, 30, 30]               0
        MaxPool2d-34          [32, 512, 15, 15]               0
           Conv2d-35          [32, 512, 15, 15]       2,359,808
      BatchNorm2d-36          [32, 512, 15, 15]           1,024
             ReLU-37          [32, 512, 15, 15]               0
           Conv2d-38          [32, 512, 15, 15]       2,359,808
      BatchNorm2d-39          [32, 512, 15, 15]           1,024
             ReLU-40          [32, 512, 15, 15]               0
           Conv2d-41          [32, 512, 15, 15]       2,359,808
      BatchNorm2d-42          [32, 512, 15, 15]           1,024
             ReLU-43          [32, 512, 15, 15]               0
        MaxPool2d-44            [32, 512, 7, 7]               0
          Flatten-45                [32, 25088]               0
           Linear-46                 [32, 4096]     102,764,544
             ReLU-47                 [32, 4096]               0
          Dropout-48                 [32, 4096]               0
           Linear-49                 [32, 4096]      16,781,312
             ReLU-50                 [32, 4096]               0
          Dropout-51                 [32, 4096]               0
           Linear-52                    [32, 2]           8,194
          VGG_net-53                    [32, 2]               0
================================================================
Total params: 134,277,186
Trainable params: 134,277,186
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 21.80
Forward/backward pass size (MB): 12182.41
Params size (MB): 512.23
Estimated Total Size (MB): 12716.44
----------------------------------------------------------------

