VGG11----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [32, 64, 244, 244]           1,792
       BatchNorm2d-2         [32, 64, 244, 244]             128
              ReLU-3         [32, 64, 244, 244]               0
         MaxPool2d-4         [32, 64, 122, 122]               0
            Conv2d-5        [32, 128, 122, 122]          73,856
       BatchNorm2d-6        [32, 128, 122, 122]             256
              ReLU-7        [32, 128, 122, 122]               0
         MaxPool2d-8          [32, 128, 61, 61]               0
            Conv2d-9          [32, 256, 61, 61]         295,168
      BatchNorm2d-10          [32, 256, 61, 61]             512
             ReLU-11          [32, 256, 61, 61]               0
           Conv2d-12          [32, 256, 61, 61]         590,080
      BatchNorm2d-13          [32, 256, 61, 61]             512
             ReLU-14          [32, 256, 61, 61]               0
        MaxPool2d-15          [32, 256, 30, 30]               0
           Conv2d-16          [32, 512, 30, 30]       1,180,160
      BatchNorm2d-17          [32, 512, 30, 30]           1,024
             ReLU-18          [32, 512, 30, 30]               0
           Conv2d-19          [32, 512, 30, 30]       2,359,808
      BatchNorm2d-20          [32, 512, 30, 30]           1,024
             ReLU-21          [32, 512, 30, 30]               0
        MaxPool2d-22          [32, 512, 15, 15]               0
           Conv2d-23          [32, 512, 15, 15]       2,359,808
      BatchNorm2d-24          [32, 512, 15, 15]           1,024
             ReLU-25          [32, 512, 15, 15]               0
           Conv2d-26          [32, 512, 15, 15]       2,359,808
      BatchNorm2d-27          [32, 512, 15, 15]           1,024
             ReLU-28          [32, 512, 15, 15]               0
        MaxPool2d-29            [32, 512, 7, 7]               0
          Flatten-30                [32, 25088]               0
           Linear-31                 [32, 4096]     102,764,544
             ReLU-32                 [32, 4096]               0
          Dropout-33                 [32, 4096]               0
           Linear-34                 [32, 4096]      16,781,312
             ReLU-35                 [32, 4096]               0
          Dropout-36                 [32, 4096]               0
           Linear-37                    [32, 2]           8,194
          VGG_net-38                    [32, 2]               0
================================================================
Total params: 128,780,034
Trainable params: 128,780,034
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 21.80
Forward/backward pass size (MB): 6876.72
Params size (MB): 491.26
Estimated Total Size (MB): 7389.78
----------------------------------------------------------------

